{
 "Data": [
  {
   "Title": "Questions about $TIF calls expiring tomorrow",
   "#Comments": 21,
   "Score": 2,
   "Symbols": [
    "$TIF"
   ],
   "Selftext": " \n\nSo about a month or so ago I bought 25 132$ call expiring 1/8/21 on $TIF. They were super cheap at the time (125$ total) and I honestly didn't really understand what I was doing. They were planning on releasing their earnings report late December/ early January. I thought that with the holidays and the general uncertainty of the world. People might be buying jewelry, but the real reason I bought it was because it was cheap and i'm dumb.\n\nWell, now January 8th is tomorrow and the current stock is not showing up on Finviz, yahoo finance or Robinhood. I can see on Google Finance that the AH for TIF is 132.40 which would net me a decent profit, but I can't find the stock through my broker (Robinhood, yea RH. boo... w/e).\n\nI've been looking through the news and discovered that TIF was bought out by LVMH recently for 16 billion, but I'm not sure where that leaves me. Will my options even show up tomorrow? or will it expire worthless. Is the recent buyout the reason why I can't see the shares anymore? Also why was $TIF not really moving at all for the past 3 months.\n\nSuper newbie here, any help is appreciated"
  },
  {
   "Title": "$PFE Earnings to Tendie Town",
   "#Comments": 63,
   "Score": 5,
   "Symbols": [
    "$PFE"
   ],
   "Selftext": "Hi fellow retards, \n\nPfizer is reporting earnings on 2/2 and I expect them to beat estimates due to the large orders they're receiving for the vaccine. \n\nAlso I think their upcoming rebrand will move the needle as well.\n\nI know you guys think pharma is tapped but the market is assuming it will be gone this year, news to the contrary may be coming out soon as they study the new variant. This could turn to a seasonal flu like situation, I don't think Covid is going anywhere.\n\n3/19c $39\n\n[https://i.imgur.com/kEv7IQY.png](https://i.imgur.com/kEv7IQY.png)"
  },
  {
   "Title": "Can someone explain this to me? $AAPL Call Sweep Bearish $130 01/08/2020",
   "#Comments": 9,
   "Score": 4,
   "Symbols": [
    "$AAPL"
   ],
   "Selftext": " • For **AAPL** (NASDAQ:[AAPL](https://www.futunn.com/quote/stock?m=us&amp;code=AAPL)), we notice a **call** option **sweep** that happens to be **bearish**, expiring in 1 day(s) on **January 8, 2021**. A trader bought **299** contract(s) at a **$130.00** strike. This particular call needed to be split into 5 different trades to become filled. The trader or institution spent **$35.5K** on this trade with a price of **$119.0** per contract. There were **41140** open contracts at this strike prior to today, and today **89557** contract(s) were bought and sold. \n\n&amp;#x200B;\n\nWhy would this be bearish? Is it because the trader bought the $130 call when stock is $130+ (or this morning below $130)?\n\nnew to options, would like to learn more.\n\nI'm holding a few $128/$129$130 01/08 call.\n\nThanks in advance!"
  },
  {
   "Title": "$MU Earnings Call Thread",
   "#Comments": 19,
   "Score": 3,
   "Symbols": [
    "$MU"
   ],
   "Selftext": "In memory of [MartyMoho](https://www.reddit.com/r/wallstreetbets/comments/eaujdv/the_rise_and_fall_of_martymoho/), I have made this earnings post. Micron has breached the notorious 60 price level and is now almost at 80. Let's pray for all $MU 80C holders tonight in memory of MartyMoho, one of the OG high rollers in this sub."
  },
  {
   "Title": "Why $SLX is a better bet than $MT",
   "#Comments": 20,
   "Score": 3,
   "Symbols": [
    "$SLX",
    "$MT"
   ],
   "Selftext": "I see a lot of you buying $MT calls for june or simply buying the shares, but if you truly want to bet on the steel shortage instead of betting on whether MT can specifically milk it, you're better off buying SLX.\n\nSLX tracks the  NYSE Arca Steel Index, tracking all steel companies in the index.\n\nLess risk towards individual management, but will participate in the run up just as much.\n\nIt's also up significantly while MT has somewhat stagnated.\n\n&amp;#x200B;\n\nIf you're really serious about investing in Steel, this is a better play.\n\n&amp;#x200B;\n\npositions: 10x june 18th 45$ calls"
  },
  {
   "Title": "IPOF - Chamath's biggest SPAC deal ever - Deal announcing soon",
   "#Comments": 49,
   "Score": 2,
   "Symbols": [
    "$DM"
   ],
   "Selftext": "The time has come. Chamath has 3 SPACs now:\n\nIPOD - $400m in size\n\nIPOE - $700m in size\n\nIPOF - $1B in size \n\n&amp;#x200B;\n\nSPAC has very limited downside and huge upside potential. If no deal, all shareholders will be returned $10 after the 2-year deadline. Now, the most painful part about betting on SPAC is that you never know when a deal will be announced... But there are rumors that will bring up the stock price.\n\n&amp;#x200B;\n\nFor IPOF, it's almost guaranteed that a deal will be announced very soon. This is what Chamath, the owner of IPOF tweeted before Christmas:\n\nhttps://preview.redd.it/wqpwkq8qwx961.png?width=610&amp;format=png&amp;auto=webp&amp;s=937c64fd4c2cd32121005d20480bac3bf5a355e1\n\nThis deal has to be IPOF because IPOE was reported to be merging with SoFi today. Both $DM and $MP's deal sizes were $250m and $350m so it's VERY unlikely to be IPOD.\n\n&amp;#x200B;\n\nTLDR: BUY IPOF. I'm too retarded to buy options. Although IPOF already 30% up but it's still early. It's not uncommon to see a SPAC double or even triple in price. See LGVW, HYLN, IPOB .. I don't need to list all of them. Basically limited downside and huge upside. But if you get in, be ready to ride the whole journey until the merger completes.. which is usually 3 months out."
  },
  {
   "Title": "$SNOW is up 11% on the lock-up expiration day",
   "#Comments": 29,
   "Score": 3,
   "Symbols": [
    "$SNOW"
   ],
   "Selftext": "I checked news and I was looking for a dip today to buy in. but wtf? up 11% by noon?\n\nEarly lock up expiration is today. Can some one explain to me what is happening? non of the IPO shareholders taking profit?\n\n 39M shares will be available to trade today, which will make the total float to \\~90M.\n\nI haven't seen any action despite it going up. \n\nIs that it for today? or the expiration is yet to take place?\n\nPlease open the gate and so I can buy dip.\n\nPlease."
  },
  {
   "Title": "$DHI easy tendies. New Residential Construction report drops 1/29 🚀🚀",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$DHI"
   ],
   "Selftext": "The New Residential Construction report comes out every month. When the date comes stocks of home builders go up ⬆️ . Next report is 1/29/21.\n\n$DHI has jumped to $78, $73, $75 the last few months of reports. Stock currently around $68.\n\nGrabbed some 1/15 68c. Easy entry point &amp; exit."
  },
  {
   "Title": "$FCEL - how long you holding?",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$FCEL"
   ],
   "Selftext": "Saw someone say these guys used to trade as high as $125 - could it really get back there? These guys are unprofitable as fuck, despite all the green deal talk. What we saying?"
  },
  {
   "Title": "Commodity Club - Nickel for your Pickel - $VALE",
   "#Comments": 93,
   "Score": 1,
   "Symbols": [
    "$VALE"
   ],
   "Selftext": "Alright boys - welcome to a new addition to the commodity club. We continue our narrative today with Nickel. $.05c about to make you so hard. \n\nQuick disclaimer - today's post will focus on $VALE. So much news to share about why this is about to go to $25-27 by March. \n\n&amp;#x200B;\n\n**Earnings** \\- [Link](https://1drv.ms/x/s!Aqh0bpkatZYkciY7YA4lH8hq3BQ?e=GA4hvF)\n\nEarnings for Q3 were very solid. If you reference the above link, I've shared details into VALE's Q3 earnings. There's a few key takeaways: \n\n* Reference the Avg Prices tab and see what VALE got in Q3 for each commodity. For Q4, there's a few big winners we should expect: \n   * Iron Ore - up 30% in Q4. This is VALE's largest commodity and likely priced into earnings. It is 80% of their revenue. \n   * Met Coal - also up 30% in Q4. This is another huge line item for VALE and was a loss in Q4. At current prices, this will be an easy winner, but only 1% of their revenue. \n   * Copper - up about 20% in Q4. This is 5% of their revenue and drive about $500m in profits in Q4. \n   * Nickel - up about 15% in Q4. This is about 10% of their revenue. \n* VALE made $2.9b in Q3. That's about $.59/share. They have a 3.9% dividend to go along with this. \n* Production was up over Q1 and Q2, but depressed since 2019. Some of this has been a result of declining ore quality and Covid. There was also a landslide that caused some production loss. \n\n**High-Level Research**: \n\nOkay - so core commodity prices are increasing. We also know that VALE sends about 60% of their product to China. So how does this translate? Here's where I explain why Q4 will be amazing, and how Nickel will be the catalyst for a massive earnings beat. \n\n* Iron Ore is super expensive, and we are seeing massive shipments being sent to China. China is so short on steel that they are buying scrap for the first time ever from Japan. Here's a series of articles/tweets to read: \n   * [Post 1](https://twitter.com/YuanTalks/status/1346356073309978624?s=19) \\- Iron Ore hitting record high prices, but shipments falling\n   * [Post 2](https://www.mysteel.net/article/5020695-0501/WEEKLY--Aust--Brazilian-iron-ore-shipment-over-Dec-28-Jan-3.html) \\- looking at shipping details, we see that VALE's shipments actually increased while iron from Australia fell. VALE shipped 6.5m tons of iron in the last week of the year - that's about $1b in revs in a week. \n   * [Post 3](https://www.mining.com/iron-ore-shipments-from-brazil-and-australia-set-record-high/) \\- even though shipments fell in the last week of December, shipments are at all time highs. VALE is literally sending mountains of iron to China at record prices. Yay! \n      * Also note that the Baltic Dry Index is nearing highs too. Shipping rates are expensive and will hurt margins slightly. \n\n**Projections**: \n\nOkay - so Iron is going to be a huge winner in Q4. Right now, here's the earnings projections for VALE: \n\n* Low - $.5/share (about $2.5b in profit) \n* Medium - $.8/share (about $4b in profit) \n* High - $1/share (about $5b in profit) \n\nAt Q3 output levels and current prices, we should expect to be near the high estimate of $1/share. Revs are expected at $12-13b, but should be much higher given current shipping details we've seen from VALE to China. At the worst, we have a Rev and Earnings beat. \n\nSo why Nickel? \n\n**Thesis**: \n\nIf you reference the Q3 Earnings Call - Nickel was the clear callout for VALE's earnings beat last quarter. You'll regularly see Nickel prices and sales being a major driver for increased earnings. \n\nHere's Nickel's [chart](https://tvc-invdn-com.akamaized.net/data/tvc_b0922c4db148b2c166ae2ff909d8183a.png): \n\n&amp;#x200B;\n\n[Nickel Futures](https://preview.redd.it/y36ns5ublx961.png?width=1677&amp;format=png&amp;auto=webp&amp;s=8d09c9901ac2abdb4914ae42fd17f097c4e069d2)\n\nNickel just broke out and is entering a massive bull market. Currently Nickel is trading at $18,000/ton, which is much higher than VALE's realized price of $15,000/ton in Q3. What's interesting is that Nickel is rising despite [rising stock piles](http://www.kitcometals.com/charts/lmewarehouse.html) in warehouses. \n\nHere's where we get a bit speculative - reference VALE's Nickel production here: [Link](http://www.vale.com/EN/investors/information-market/quarterly-results/QuarterlyResultsDocs/PREREPORT3T20_i_vf.pdf)\n\nMining outputs are variable quarter to quarter due to weather, ore grades, demand, prices, etc - sometimes when bull markets or demand increases, miners turn on production that was previously on hold. We see that in Q3, VALE saw soaring demand for Nickel as it relates to sales, and this would be an indicator for a higher demand for Nickel. However, nickel output is actually down from 2019, when prices were at similar prices to today. \n\nWith nickel prices breaking out and appearing to be headed much higher, VALE might have offline nickel production that they'll turn back on to take advantage of higher demand and prices. Additionally, nickel prices are looking like they might go significantly higher into Q4, and have a much higher price target than say iron or coal. We've also seen VALE buy miners in Indonesia for additional Nickel production, which is aligned with this ongoing Nickel breakout. \n\n**Prediction**: \n\nVALE's nickel output will return to 2019 levels and take advantage of the current pricing. We could see an additional 20m tons produced, and a massive profit line item on Q4. Additionally, if VALE can lock in these prices for Q4 and continue to increase production and see rising prices, Nickel could become 15-20% of VALE's business and bring in over $1b in profit a quarter. \n\nBased on an expected earnings/rev beat and future outlook for VALE, I'm expecting the share price to jump to $25-27 in March based on current P/E and other metrics for the stock. \n\n**Positions**: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/0r4768skox961.png?width=718&amp;format=png&amp;auto=webp&amp;s=dc3185bea658f163e58e1a38f8c66f6e1214d8b8"
  },
  {
   "Title": "$420 on 4/20 is no longer just a meme gents",
   "#Comments": 4,
   "Score": 1,
   "Symbols": [
    "$SPY"
   ],
   "Selftext": "The market makers are willing it into the universe, it's time...\n\n$SPY 4/20 $420, what a time to be alive!\n\n[https://finance.yahoo.com/news/credit-suisse-raises-sp-500-price-target-to-4200-154746293.html?.tsrc=fin-notif](https://finance.yahoo.com/news/credit-suisse-raises-sp-500-price-target-to-4200-154746293.html?.tsrc=fin-notif)"
  },
  {
   "Title": "DD Part 2: $HIMX Q4 Performance",
   "#Comments": 19,
   "Score": 1,
   "Symbols": [
    "$HIMX"
   ],
   "Selftext": "U buy stonk or call cuz earnings get beat beat\n\n**Tldr;**\n\n**Buy shares and calls before February earnings date**\n\nEx:\n\n* Calls: $9sp 3/19\n* Calls: $10sp 1/21/22\n\nor go ballsy and go for February options\n\n&amp;#x200B;\n\n1. **See here for Previous DD from Q3 Results:**\n\n[https://www.reddit.com/r/wallstreetbets/comments/k5j08h/some\\_dd\\_on\\_a\\_low\\_marketcap\\_gem\\_himax\\_technologies/](https://www.reddit.com/r/wallstreetbets/comments/k5j08h/some_dd_on_a_low_marketcap_gem_himax_technologies/)\n\n&amp;#x200B;\n\n2. **Preliminary Q4 Unaudited results announced:**\n\n[https://www.stocktitan.net/news/HIMX/himax-technologies-inc-pre-announces-preliminary-unaudited-fourth-ico2n3fd9ozg.html](https://www.stocktitan.net/news/HIMX/himax-technologies-inc-pre-announces-preliminary-unaudited-fourth-ico2n3fd9ozg.html)\n\n**Revenue**: $275.8 million\n\n**Gross Margin:** 31.2%\n\n**EPS:** .20\\~\n\n&amp;#x200B;\n\n**vs. Q3 numbers**:\n\n**Revenue**: $239.9 million\n\n**Gross Margin:** 22.3%\n\n**EPS:** .02 - .028\n\n&amp;#x200B;\n\n**Q3 earnings expectations for Q4:**\n\n* Expectation was a 10% increase in Revenue QoQ; **+14.5%ish increase**\n* 29% Gross Margin; **+3.2% increase**\n* .15 - .16 EPS; **+.04-.05\\~ increase**"
  },
  {
   "Title": "GIS Analytics and Historical Data",
   "#Comments": 7,
   "Score": 1,
   "Symbols": [
    "$GIS"
   ],
   "Selftext": "Hey all,\n\nLooking into a lot of analytics that I've had success with, I think that $GIS has a great option chance! Analyst and P/E expectations have turned positive which has led to a price increase of around 2% within the coming week. This has happened 5 times in the past which has led to 85% of those days resulted in an upward move in a week period.\n\n\\- The median move for the week is 2% and with GIS dropping early this morning is a great chance to buy it. My hit ratio for that comes in very high around 90%. I am in at a strike price of 57.5.\n\nI've had a lot of success with these metrics but feel free to use or not use!"
  },
  {
   "Title": "Unified Blue Government = ☀️Solar to the Moon! 🚀🚀🚀",
   "#Comments": 5,
   "Score": 1,
   "Symbols": [
    "$TAN"
   ],
   "Selftext": "We've seen fantastic performance by renewables lately (along with most of the market, so...🐂), but a truly Democrat-Held government (Presidency, both houses of Congress via Harris) means we are about to see a strong renewed push for green energies, renewables, and solar in particular. \n\n$TAN 7/16/21 155C is trading at $8.00\n\nSCRATCH THAT, SKIP MOON. SOLAR TO THE SUN 🚀🌞\n\nLET'S GOOOOOO🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀☀️"
  },
  {
   "Title": "YOLO $12,849 in $PLUG",
   "#Comments": 34,
   "Score": 2,
   "Symbols": [
    "$PLUG"
   ],
   "Selftext": "From3K to \\~13K so far. now i'm doing $PLUG\n\n1/15 $45 Call\n\n1/29 $45 Call\n\n1/29 $46 Call\n\n2/19 $47 Call\n\n&amp;#x200B;\n\nWhich me luck boys\n\nhttps://preview.redd.it/gllmds3ldx961.png?width=1393&amp;format=png&amp;auto=webp&amp;s=ff01c2bcc2f69a5a35b18e94eb3dcee07e70ccf8"
  },
  {
   "Title": "Steel Stocks - $MT and Schnitzer Smashes Earnings",
   "#Comments": 573,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "From Zack’s: (more confirmation)\n\n4 Steel Stocks Set to Gain on Spurred Up Demand in 2021\n\nMentioned:\tMT RYI SC.HN ZEUS\n\nThe steel industry in the United States now seems poised to make a comeback from the COVID-19 led slump during the earlier part of last year. Demand for the metal is gradually returning as manufacturers are springing to action. Notably, increased demand has led to higher steel prices. Per S&amp;P Global Platts, the benchmark price for hot-rolled steel hit a two-year high of $900 per ton in December 2020, as mentioned in a Wall Street Journal article.\n\nMoreover, the American Iron and Steel Institute reported that in the week ending Jan 2, production increased 3.1% from the week ending Dec 26, 2020. Capacity utilization also improved to 80.1% from the previous week’s capacity utilization of 72.3%. Although weekly productions were down on a year-over-year basis, the uptick in production from the prior holiday-induced week bodes well.\n\nReflective of the uptick in demand for steel, manufacturing activity has also been expanding in the United States. Per the latest report from the Institute for Supply Management, the purchasing manager’s index for December was 60.7% compared to 57.5% in November, marking the eighth consecutive month of growth.\n\nMeanwhile, the World Steel Association (“worldsteel”) also forecast in a report that global demand for steel will rise 4.1% in 2021 following an estimated slump of 2.4% in 2020. Moreover, worldsteel predicted that demand for steel in the United States should increase 6.6% in 2021 following an estimated drop of 15.8% in 2020.\n\nSeparately, global production of light vehicles is expected to rebound in 2021. This rebound will be important because the automotive industry is a major contributor to demand for steel. Notably, IHS Markit estimated global light vehicle production to rebound 14% to 84.3 million units in 2021, following an estimated dip of 17% in 2020, as quoted in a Business Wire article. The article further mentioned that in North America, IHS Markit forecast a production increase of 29% on a year-over-year basis for the remainder of 2021 following a cautious view of the first quarter.\n\n4 Steel Stocks to Buy Now\n\nThe outlook for the demand for steel is gradually improving. Steel prices have witnessed an uptick and reflective of the rising demand, manufacturing activity has also continued to expand. Meanwhile, production of light vehicles is also expected to rebound in 2021, a development that bodes well for the steel industry. This makes it a good time to invest in steel stocks that stand to benefit from this improved outlook. We have selected four such stocks that carry a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nArcelorMittal MT, along with its subsidiaries, owns and operates steel manufacturing and mining facilities in Europe, North and South America, Asia, and Africa. The company sells its products to various customers in the automotive, appliance, engineering, construction, energy and machinery industries through a centralized marketing organization, as well as distributors. The company currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings increased 62.2% over the past 60 days. The company’s expected earnings growth rate for the current year is more than 100%.\n\nSchnitzer Steel Industries, Inc. SC.HN recycles ferrous and nonferrous scrap metals; and manufactures finished steel products worldwide. Under the Cascade Steel and Scrap segment, the company provides semi-finished goods, which include billets; and finished goods consisting of rebar, coiled rebar, wire rods, merchant bars, and other specialty products. The company currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings increased 52.8% over the past 60 days. The company’s expected earnings growth rate for the current year is more than 100%.\n\nRyerson Holding Corporation RYI, along with its subsidiaries, processes and distributes industrial metals in the United States, Canada, Mexico and China. The company offers a line of products in carbon steel, stainless steel, alloy steels and others. It currently has a Zacks Rank #1. The Zacks Consensus Estimate for its current-year earnings increased 35% over the past 60 days. The company’s expected earnings growth rate for the current year is more than 100%.\n\nOlympic Steel, Inc. ZEUS processes and distributes metal products in the United States and internationally. The company currently has a Zacks Rank #2. The Zacks Consensus Estimate for its current-year earnings increased 77.4% over the past 60 days. The company’s expected earnings growth rate for the current year is more than 100%."
  },
  {
   "Title": "🚀🚀🚀 $GME Squeeze PT 🚀🚀🚀",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "Meme magic is real and shout out to  [u/Stonksflyingup](https://www.reddit.com/user/Stonksflyingup/) with that enigma meme yesterday. Papa Cohen is 100% leaving us clues in his emojis.\n\n  \nBen Franklin tweet -- An ounce of prevention is worth a pound of a cure\n\n16 ounces in a pound, therefore the cure will be 15x share price.  Share price at time of tweet, 19.37.  19.37x15 = 390 \n\n**Squeeze price target is AT LEAST 390**\n\nfor those of you visual motherfuckers, 1 🚀 = 1$:\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀   \n\n&amp;#x200B;\n\nPositions: 1300 shares avg 13.80 and a few 20 2/19 C \n\nKeep those 💎✋ strong  boys our 🚀 are fueled with the blood of  **🌈🐻**"
  },
  {
   "Title": "Why $QQQJ isn't done - YUUUUUGE POTENTIAL",
   "#Comments": 97,
   "Score": 1,
   "Symbols": [
    "$QQQJ"
   ],
   "Selftext": "Tired of seeing ICLN and TAN posts and feeling FOMO because you missed the rocketship ETF? Well, look no further than QQQJ, an ETF which tracks the NASDAQ Next Gen 100 Index (the next 100 NASDAQ companies after the ones in QQQ). 🚀🚀🚀\n\nAs expectations for an economic recovery increase due to the incoming Biden administration, we should see continued growth in the stocks that comprise QQQJ, more so than the large-caps that comprise QQQ. This evidence can be seen by backtesting data provided on the NASDAQ website, which compares the performance of QQQJ against other mid-cap fund performance.\n\n[Backtested 1-year returns](https://preview.redd.it/6m82eh2lnw961.png?width=1008&amp;format=png&amp;auto=webp&amp;s=6c7851affb4a37b06d998d79be2c22780a1e58a2)\n\n[Backtested 10-year returns ](https://preview.redd.it/y06ylljinw961.png?width=933&amp;format=png&amp;auto=webp&amp;s=1c58927490a95207b50682b37792b98c34088862)\n\nSome of its more well-known holdings include recently beat-down companies such as:\n\n* ROKU (down 5% from December highs)\n* TTD (down 20% from December highs)\n* BYND (down 18% from December highs)\n* DKNG (down 10% from December highs)\n\nDespite this beatdown of its more famous holdings, it's still almost back to pre-December crash highs. More importantly, the premiums on its calls are still lower compared to other similarly priced ETFs.\n\nThe incoming volatility from the swearing in of a new president should also cause\n\nBut won't growth be limited because companies will move into QQQ as soon as they grow? Not necessarily - in a bull market, all stonks go up, including those in QQQ. If all stonks are going up, then everyone wins, but QQQJ wins more.\n\n# More confirmation bias:\n\nBelow is some historic data showing what happens when we have a Democratic president and a split or Republican-led Congress. Combine this with the Roaring Twenties, vaccine hopes, stimulus hopes, economic recovery hopes, and super hot growth potential in healthcare, tech, IT etc, and QQQJ i \n\nhttps://preview.redd.it/fwy5xioxkw961.png?width=789&amp;format=png&amp;auto=webp&amp;s=4a9f4fa13509d8e06e9881b24e9515e7a14c1b17\n\n# Charts\n\nI've done some rudimentary crayon analysis on Tradingview, and as you all can see, we should see QQQJ at 35 sometime around March. This is based on the most bearish analysis I could find based on its current trend and macroeconomic conditions. As you can see, it's shown relatively stable growth thus far (aside from the crash in December).\n\n[Rudimentary Bearish Crayon Analysis](https://preview.redd.it/cgpw2lo6kw961.png?width=1060&amp;format=png&amp;auto=webp&amp;s=a97dcfa2c8937b07dd5f9fcd903e28a568180e1d)\n\nAlternatively, we could see hyper growth as the stocks in the Next Gen 100 Index rally based on an optimistic outlook from the potential redo of the Roaring Twenties, vaccine hopes, stimulus hopes, economic recovery hopes, and super hot growth potential in healthcare, tech, IT etc. Below is my best bull-case TA drawing:\n\n[Advanced Bull Crayon Analysis](https://preview.redd.it/g6oe3niaow961.png?width=931&amp;format=png&amp;auto=webp&amp;s=d867780073995d921ef7170fec0e9ae7a1371ee0)\n\n# HERE'S THE KEY POINT\n\nSome of QQQJ's holdings recently suffered major beatdowns and are poised for recovery.\n\nPremiums are higher than they were two weeks ago but still undervalued compared to similarly priced ETFs. June 35cs are going for $1.10 right now. \n\nBased on my ~~astrology~~ TA predictions, these should be ITM by March/April, at which time you can either sell the calls or just exercise them and sell the shares.\n\nBuzzwords:\n\nROARING TWENTIES VACCINE STIMULUS HYPE HEALTHCARE TECH IT RECOVERY STOCKS MOON ROCKET \n\n# Positions\n\n100x June 35c 🚀🚀🚀"
  },
  {
   "Title": "What is the worst event that has propelled stocks the highest?",
   "#Comments": 12,
   "Score": 1,
   "Symbols": [
    "$IWM"
   ],
   "Selftext": "We all remember the Dallas Police Riots in 2016 that sent the markets soaring upwards. We all remember the Watts riots that sent the markets rocketing upwards, in the 90's. We all just witnessed the capital being raided that sent the $IWM up 4%. We all remember Ebola that sent stocks soaring and, of course, we remember the Corona state of emergency that sent the Nasdaq up 70%. Does anybody else remember any other bad events that sent the market soaring upwards?"
  },
  {
   "Title": "$ears direct listing",
   "#Comments": 13,
   "Score": 1,
   "Symbols": [
    "$EARS",
    "$ears"
   ],
   "Selftext": "$EARS will be going the direct listing route...before you click the link substitute what you should already know\n\n&amp;#x200B;\n\n[https://venturebeat.com/2021/01/06/sears-raises-520-million-at-29-5-billion-valuation-will-go-public-through-direct-listing/](https://venturebeat.com/2021/01/06/roblox-raises-520-million-at-29-5-billion-valuation-will-go-public-through-direct-listing/)"
  },
  {
   "Title": "$BB King, the blast from the past with the legendary comeback",
   "#Comments": 337,
   "Score": 5,
   "Symbols": [
    "$FB",
    "$BB"
   ],
   "Selftext": "**BB is king.**\n\nbefore anything, this is not financial advice, go fuck yourself you autists. I am a degenerate with a hypothesis. Now that that disclaimer is done\n\nMan blackberry, who the hell thought I’d be investing in you after the fall of BBM and Brickbreaker. Well, strap in folks as I take you through one of the most bullish stories in stonk history, and it all starts with one statement. Everything you’re thinking about with Blackberry at the moment, is wrong.\n\nIt is not a phone company. It is not telling you to use BBM. It is a software, automotive, and cybersecurity company that is about to make a killing. Let’s begin:\n\nBB stock price, 6.71 as of Close on 1-6-2021. \n\nTechnically, this thing is a fucking beauty. MACD flip, Stoch RSI cross, volume died on the sells and the thing is pushing up just the market died twice while it had solid momentum. This is going to move soon, but let's go away from crayons and into the magical land of make believe, news events, conferences, and fundamentals. It's not just two letters, it's a business. https://www.tradingview.com/x/uI3Cl51F/ \n\n**Recent Earnings**\n\nFiscal Quarter End| Date Reported| Earnings Per Share* | Consensus EPS* Forecast| % Surprise\n---|---|----|----|----\nNov 2020| 12/17/2020| 0.1 | -0.04| 100\nAug 2020| 09/24/2020| 0.1| -0.02| 600\nMay 2020| 06/24/2020| 0| -0.04| 100\nFeb 2020| 03/31/2020| 0.06| 0.01| 500\n\n\n\nSurprises along the board.\n\n* Revenues last quarter, $224 MM.\n* Revenues projected for Q4, $246 MM.\n* Full year Guidance 2021, $950 MM. \n* Mkt cap, $4 B. \nTotal company non-GAAP revenue of $224 million; total company GAAP revenue of $218 million. Non-GAAP earnings per basic and diluted share of $0.02; GAAP loss per basic and diluted share of $0.23. Net cash generated from operating activities of $29 million.\n\n\n\nSaw this cute image of CRWD PLTR and SNOW, all with similar or lower Revs but SNOW is half but worth 20x BB, CRWD has less revs but is operating at 11.75x, PLTR (WSB fav) has 50M more projected annual revs and is worth 11x. Alright who cares about revenue, that's only today. If only it accounted for the big event happening in the next 9 days (see news events below).\n\n**NEWS EVENTS**\n\n*FB settlement*\n\nI’m not going to go into deep detail here as it is quite intricate and all I know is that BB won a suit against fuckerberg $FB related to messaging, whatsapp, and something else. $FB has till January 15th, 2020 to settle, see here: https://www.courtlistener.com/recap/gov.uscourts.cand.331602/gov.uscourts.cand.331602.144.0.pdf \n\nThis FB settlement is not included in earnings expectations, meaning THAT SHIT GOES UP or will be in analyst projections.\n\n*BlackBerry IVY - Intellectual Vehicle Data Platform*\n\nThe big kahuna that will change BB for the next few years. Per BB website: “BlackBerry and AWS are joining forces to develop BlackBerry IVY, a scalable, cloud-connected software platform that will allow automakers to create personalized driver and passenger experiences and improve operations of connected vehicles with new BlackBerry QNX and AWS technology.”\n\nWhat does it mean to the end consumer (the automakers?)\n\n**IVY Fueling Business Outcomes**\n\nBlackBerry IVY will help automakers and automotive suppliers:\n\nFuel Innovation by supporting rapid development of new customer experiences\nDrive Revenue by unlocking new revenue streams and business models\nReduce Costs by moving processing to the edge &amp; reducing raw data transmission\nImprove Operations with enhanced data visibility and access\nExpand Ecosystems by unlocking the broader app developer community\n\n\nWanna watch a video? [bideo here](https://youtu.be/fwDnUNENSoY) \n\nWant a TL;DR? Automotive, cloud, cybersecurity, IOT, electric vehicles, every bubble on the planet. And this shit got all of it. Want more info? https://blackberry.qnx.com/en/aws Read this and watch their conferences coming up.\n\n**Partnerships with big companies**\n\nBlackberry partnered with Zoom (link: https://blogs.blackberry.com/en/2020/10/blackberry-and-zoom-together-secure-your-virtual-enterprise-meetings), Microsoft Teams (link: https://www.prnewswire.com/news-releases/blackberry-athoc-integrates-with-microsoft-teams-for-critical-event-management-301147559.html) and some other company that I forgot. Cybersecurity adding onto big big platforms that exploded this past year. MORE MONEY you dumbasses.\n\nPatents\nBB started offloading old patents but have one that will be important as of recent, with the sexiest one being this: https://uspto.report/patent/grant/10880812 \n\nVery pretty stuff, big sex.\n\n\n**Business Implications**\n\nBB makes their money from licensing, cybersecurity (one of the only companies that have not been hacked in this SolarWind shit), BB QNX is already in 175 MM cars worldwide, partnered with XPEV, and is in talks with multiple Tier 1 automakers, 20 different OEMs, and will be in vehicles by 2023. Does that mean anything now? Yes, you dumbass. Per CEO John Chen, my new president, #DidYouKnow @BlackBerry has been selected by 19 of the top 25 #ElectricVehicle manufacturers, and they represent 61% of the Electric Vehicle market?\n\nBubblicious and sexy. Expect some of the big tier 1s like Nissan, Toyota, BMW, and others to jump on this train. Think TSLA doesn’t have competition? Bitch they cant even make a billion dollars unless they sell stock (which since MS just upgraded their price, I bet they offer at least $5B in stock in the coming days).\n\n**CONFERENCES**  \n\nBB is speaking at the following conferences:\n\nCiti’s 2021 Global TMT West Virtual Conference - Thursday January 7th, 2021 at 1 PM with the Steve Rai, Blackberry CFO  and John Wall, Co-Head of BlackBerry Technology Solutions (BTS) \n\nJP Morgan 19th Annual Tech / Auto Forum\nTuesday January 12th, 2021 at 5:45 PM ET \nwith the Steve Rai, Blackberry CFO  and John Wall, Co-Head of BlackBerry Technology Solutions (BTS) \n\nNeedham’s 23rd Annual Virtual Growth Conference \nFriday, January 15th, 2021 at 1:15 pm ET \nWith Ryan Permeh, Blackberry Chief Security Architect &amp; Co-founder of Cylance and Eric Cornelius, Blackberry Chief Product Architect \n\nThis was just announced and you bet your ass this will pump this stock up.\n\n\n\n**Conclusion:**\n\nThis stock will generate a lot more cash in the coming years, will gain in the short term by offloading old patents, settling with FB and getting some moolah, growing in their partnership with Bezos gang, roll out to more EVs with Tier 1 and Tier 2 automotive companies, and compete with Tesla on this as well. This shit trades at $6.70 and is so close to going up if the market just doesn’t crash in the interim. They already are used by big companies for Access and other Mobile applications, so that someone can securely use their dinky iPhone to work. Think big whales aren’t interested? Look at 2022 2023 option OI. \n\nI think this goes to lower PT of $10 by May, more likely $15. uThInKitWiLLdOUbleINmKTcAp???? Yes you fucking idiot, this is trading at 4X sales only, will be profitable this year, and has so much shit coming up. This is UNDER 4B!!!!!!!!!!!!!!!! Just buy the stock and sit on it. Want options? Buy them too. Have fun guys, I hope you all make money.\n\nMy positions:\n\n29 contracts Feb $7C, bought as recently as yesterday.\n1300 Shares, price avg of $7.001. I could have actively traded this prior to ER but decided to long term hold cause I am not a daytrader, and I fully believe in this hypothesis. I wouldn’t be typing this shit if not. Enjoy, go make money"
  },
  {
   "Title": "Call me a retard if you want.. JMIA 🚀",
   "#Comments": 42,
   "Score": 5,
   "Symbols": [
    "$GS"
   ],
   "Selftext": "Yeah that’s fucking right ladies and gents, ahem retards and autists.\n\nThe play was JMIA, this company is severely undervalued and isn’t based out of the US so the Biden admin with a Democratic Congress essentially isn’t a threat to margins and profits.\n\nWorth noting now leaps are great as well and I recommend you get in before it’s too late.\n\nAnyways their 2nd capital raise was necessary to become the conglomerate they want to become and I was bullish but after that recent one I became extremely bullish.\n\nSo what was the play? Loaded 150 JMIA Jan. 15 $40’s a minute before market close. We’ll see who wins this one.. had to roll over the 500% $GS $280 calls after yesterday and today.\n\nALSO my FREE ADVICE to you so you can see the same return I did today on $GS. I recommend getting some $300 Jan. 8 calls at open.. $289 and it explodes to $301/$302 fast.\n\nAnd always remember 💎 ✋🏼‘s and 🖕🏼 🌈 🐻’s."
  }
 ]
}