{
 "Data": [
  {
   "Title": "$BBBY Short squeeze plan",
   "#Comments": 23,
   "Score": 1,
   "Symbols": [
    "$BBBY"
   ],
   "Selftext": "Here is my take on $BBBY 6 days before their Q3 ER.\n\nAfter a big change in management now led by Mark Tritton, $BBBY has managed to crawl back from the dead by shutting down numerous stores, selling the Cost Plus World Market and significantly improving the online shopping, which has played a large part in BBBY's success story.  All the company's debt has now been paid off and they have announced a large share buyback plan.\n\n$BBBY managed to beat their Q2 estimate by $0,73 which resulted in $BBBY skyrocketing 70%. After that the stock has fallen 33% and has at the moment over 60% short float. \n\nAll aforementioned information means that a large 🌈🐻 trap has been set and we are going to see a massive short-squeeze. Q3 earnings are supposed to be positive and are going to function as a catalyst to brutalize the bears. Combining it with the January effect, $BBBY has set its course to the Moon and the engines have been fired up.\n\nPossible risks:\n-$BBBY fell through its support line at $18 per share. There is a large gap to fill and although unlikely, the fall to $15 is not impossible.\n-According to Yahhoo Finance $BBBY has formed a bearish Top Triangle pattern. A bullish Falling Wedge pattern has also taken form in 1 day chart but in my opinion patterns won't play a large role in this short-squeeze.\n-Average analyst rating is 2,6. Who really cares tho.\n\nTLDR:\n-Possible short-squeeze incoming\n-60% short float\n-Q3 ER in 6 days, likely to beat the estimated earnings\n-$BBBY has fallen almost 20% during December, great time to buy.\n-Buy shares not options.\n-Medium risk - High reward"
  },
  {
   "Title": "$NVDA is about to blow up and I’m tired of no one talking about it",
   "#Comments": 84,
   "Score": 1,
   "Symbols": [
    "$NVDA"
   ],
   "Selftext": "You heard right. I’m tired of you GME PLTR losers sucking each other off. I come to you you with a real fucking winner here. \n  \nNVDIA has been consolidating for 3 fucking months, getting tighter and tighter and this baby is ready to pop. All time highs were at 580 and it’s only at 520. It can get to 580 in to days when this baby blows. And we all know this is easily an $1000+ stock.\n\nTLDR: $NVDA 520c 01/22/21"
  },
  {
   "Title": "why $GME it’s all I see",
   "#Comments": 23,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "I want to go to tendie town to and the rocket hasn’t left yet. My question is why do you guys all think it will go up? I have been gaming since before COVID and honestly most people get their games from PlayStation or Xbox store. People don’t buy disks and GameStop online store just seems like an extra step because I can just get the game from PS4 store. But everyone is boarding the rocket to tendie town and I don’t want to miss out. That being said when is a good time/price to buy at if I buy. Also is it worth selling some PLTR to buy shares because I have 60 shares PLTR and no buying power or cash to add to the account."
  },
  {
   "Title": "Jan 01, 2021 | Today's Top 25 WSB Tickers",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$ROPE"
   ],
   "Selftext": "To help you YOLO your money away, here are all of the tickers mentioned at least 10 times in all the posts within the past 24 hours (and links to their Yahoo Finance page) along with a sentiment analysis percentage:\n\nTicker | Mentions | Bullish (%) | Neutral (%) | Bearish (%)\n:- | :- | :- | :- | :-\n$ROPE | [11 mentions (100% of all mentions)](https://www.homedepot.com/b/Hardware-Chains-Ropes-Rope/N-5yc1vZc2gr) | 36 | 9 | 54\n\nTake a look at my [source code](https://github.com/RyanElliott10/wsbtickerbot) and make some contributions if you're interested."
  },
  {
   "Title": "$SAM prince increase",
   "#Comments": 29,
   "Score": 1,
   "Symbols": [
    "$SAM"
   ],
   "Selftext": "So by now, we have all seen the video of the dude smashing the twisted tea on the other dude's head, if you haven't, you are a loser. Anyways, the video of OCSP with the dude riding a longboard drinking ocean spray went viral on Sep 25th, and the stock quadrupled by Oct 23d. The dude smashed a dude with a twisted tea this week and it's already now it’s a viral meme. Unless twisted tea is absolutely retarded they will use this publicity to further promote twisted tea which will sell more. The only difference is twisted tea falls under the ticker $SAM and it's a parent company so I don't expect as much of a move as OCSP but it will move and they will increase their sales. It literally can't go tits up"
  },
  {
   "Title": "My friend $aapl",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$aapl"
   ],
   "Selftext": "2021... $200"
  },
  {
   "Title": "GME.. Lots of FUD.",
   "#Comments": 12,
   "Score": 1,
   "Symbols": [
    "$DASH"
   ],
   "Selftext": "I am long GME 4k shares @13.25 after cost average. I got in after reading some of u/deepvalue? Months ago. I got started at $8 on shares and 10c april. \n\nI am not looking at my portfolio but I have 10c, 15c, 25c all april. I have averaged up 5 times. \n\nI am not a smart man. I follow trends and what I believe in. I did the same thing as my guy u /deepvalue. I have been into every gamestop store i can drive to in 5 hours, even down into the morass of the MS delta. The real deal is that what they are doing is working, at least kind of. \n\n.. same day stuff is fucked because they use door dash and door dash gives first name and last name first letter.   Well I tried that, my name is the 7th most common name in the world, and my last name starts with S... so yea, I got mixed up and fucked, not because if GME but because of $DASH. Turns out that $DASH labels orders by first name, and last initial. Would have worked fine if my name was zack zak. \nI hung out and talked to the manager after going to the store to get my shit straight... he is out if so much store stock., and corporate has no clue when he can get more... I'm not even talking about consoles, he is out of damn pokemon BS. I asked about some stupid Thor hammer ... yea.. back  ordered for at least a month, if even then.\n\nThe past week I have seen GME shit talk and FUD from bad actors out the wood work. Accounts made in DEC, reactivated accounts, with no other DD or up votes on what we think. \n\nFuck these guys. \n\nIf you are GME gang ...DO NOT SELL YOUR SHARES!\nStand by the DD that the smarts on this sub provided months ago. \n\nI know it's hard when you see days down. This is a solid play. Even if there is no VW like squeeze, we will still see a $40-50 price because GME is actually worth that. I think more like 70ish if we can vote in RC. \n\nIn closing: look at the users here spouting  FUD , look at the DD months back, look at why you bought into this in the first place. \n\nAsk yourself this weekend: can I take the 20% up and down, do I want gamestop  there for me, do I want to give BAC And Melvin my tendies? \n\nWell, when they give me red arrows, I the shade with small buys.\n\nDo not buy 100 shares. Buy 1, or 2. Buy what you can buy. This is a win and a win that you can give to a solid company. \n\nThrow off the Melvin  FUD the BAC fud , I say  GME is  America And America is GME...   \n\nYour local broadcast is concluded."
  }
 ]
}