{
 "Data": [
  {
   "Title": "Undervalued company’s we can make 10x in",
   "#Comments": 7,
   "Score": 1,
   "Symbols": [
    "$MGTI",
    "$INVU",
    "$Arbkf"
   ],
   "Selftext": "$Arbkf is only $1.50 it mines more than riot and they are valued at 10$!\n$INVU 0.3$ way undervalued for mining company!\n$MGTI in 2017 it’s stock price was 8$ now it’s like 0.20$ and very underpriced as the ding dong is worth 35k\n\n1- 5x money back \n2- 10x money back\n3- 15x money back\nIF Everything stays good"
  },
  {
   "Title": "$PLTR is like a big retarded baby learning to walk",
   "#Comments": 25,
   "Score": 8,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "IMO $PLTR is going to run once it learns to walk.  Its like a big baby learning to walk keeps taking a bunch of steps and falls on its face to get right back up and keep trying to walk.  The guardians have to keep pointing the baby in the right direction...\n\nOnce it starts to walk, it will be it will be running across the room in seconds and its just going to keep growing and running faster.  \n\n# 🚀🚀🚀\n\n&amp;#x200B;\n\nThis is DD\n\n&amp;#x200B;\n\nPLTR will also be the first data big tech on Mars \n\n# 🚀🚀🚀 when Elon  starts the colony.\n\n&amp;#x200B;\n\nedit:  \n\n# 🚀🚀🚀 \n\n# "
  },
  {
   "Title": "$AAPL about to print",
   "#Comments": 81,
   "Score": 5,
   "Symbols": [
    "$AAPL"
   ],
   "Selftext": "Looking at 4-hour chart back to November, $AAPL is currently in the bottom of this upward channel that it has been trading in. I'm predicting one or two more red days for Apple and then this bitch is about to be a green Apple. \n\nhttps://preview.redd.it/3r0c3am8sra61.png?width=2368&amp;format=png&amp;auto=webp&amp;s=de8be2c5c7bc6963c96305fb559944562061a6d4"
  },
  {
   "Title": "Amicus Therapeutics $FOLD - Option Activity Indicates a Double Before March 19th",
   "#Comments": 20,
   "Score": 1,
   "Symbols": [
    "$FOLD"
   ],
   "Selftext": " Amicus Therapeutics pipeline - [https://www.amicusrx.com/programs-pipeline/](https://www.amicusrx.com/programs-pipeline/) \n\nI'll make this short - someone has been accumulating FOLD shares with a vengeance recently. On Friday there were unusual options at the March date at $35 and $27. \n\nThe bets are $1.7M that FOLD is trading above $36.50 and $2.7M that it is trading above $31. And that is the breakeven price, so I suspect a whale believes that this is going MUCH, MUCH higher to justify the risk.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6597ih92bra61.png?width=1339&amp;format=png&amp;auto=webp&amp;s=4b1fc8d147cbab3adc74df6bf9bf29a7134682c9\n\nThey have one commercial drug, and two near the end of their phase 3 trials. \n\nTomorrow, Tuesday, they are presenting at the **39th Annual J.P. Morgan Healthcare Conference** \n\nThey are expecting word for their Phase 3 drug this quarter: \"The U.S. FDA previously granted Breakthrough Therapy Designation to AT-GAA for the treatment of LOPD based on clinical efficacy results from the Phase 1/2 clinical study, including improvements in six-minute walk distance, as well as comparison to natural history of treated patients. Top-line data for the global Phase 3 PROPEL clinical study of AT-GAA in LOPD is on-track for the first quarter of 2021.\"\n\nI'm following the whale and I am in with shares, and March $22, $23, $24, and $35 call options."
  },
  {
   "Title": "250 contract $BPY Naked put update. Still going strong",
   "#Comments": 4,
   "Score": 3,
   "Symbols": [
    "$BPY"
   ],
   "Selftext": " There are rumors that BPY will be pushed to raise their bid, if that happens, I'll roll up to a 17$ strike instead.\n\nSo far, this has been a pretty profitable trade and the premium's still quite juicy, am considering freeing up more capital to increase this position by another 50 or 100 contracts.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/b08bxtgr9ra61.png?width=981&amp;format=png&amp;auto=webp&amp;s=ab4f001c221555f1b2ce137a7d78e0f6b2146e1e"
  },
  {
   "Title": "DD $SRPT Outlook",
   "#Comments": 67,
   "Score": 6,
   "Symbols": [
    "$SRPT"
   ],
   "Selftext": "Ok assholes and fucksticks, sit down and listen about the story of a stock called $SRPT, a stock that lost half its stock price after a single phase 2 study report.\n\nLet me start off by giving a bit of background on the study that just gave us the sexiest dip of 2021 so far. Currently Sarepta Therapeutics is engaged in several different drug and disease group projects, with it's main other competitor being Daddy Pfizer. Pfizer is currently competing against Sarepta to treat Duchenne muscular dystrophy. Both companies are developing several drugs to combat this disease which most affects boys around the age 3 and continues to quickly decrease their muscle tone until they are in their teens and presented with a complete loss of ambulation, which eventually leads to heart and lung problems and eventually most of those diagnosed die within their 20's to early 30's. Currently Sarepta is working in 3 main areas of pharmacology Gene Editing, Gene Therapy, and RNA Tech. This study concerned Gene Therapy, where a healthy genetic code is inserted into the body and starts producing whatever the subject's previously flawed genetic code wasn't able to produce. For Duchenne's it is protein fibers that compose muscle. The thing about gene therapy is its a single time medication, a one and done. Once these kids have a dose their DNA contains the appropriate genetics and can produce the proteins. No long term therapies, no daily medications, just injection and improvement.\n\nAll parts of this paragraph are referring to the genetic therapy treatment called SRP-9001. So in Phase 1 of this study (Trial 101) they found that the kids had a high rate of success of protein synthesis after injection, and it was maintained years after injection, a huge success, but that is a highly controlled study without a placebo group, and among a small group of kids. The study that just dropped last week was Trial 102. Trial 102 was Phase 2, and looking for long term sustainability and safety with a larger group of kids, the study did not find enough evidence to prove the therapy was more effective than a placebo, however it was rated as safe, something which Pfizer has had difficulty with in their treatment (more on that later, fuck you I'm writing a lot, and you're gonna read it. Bitch.) The next study, Trial 103, which began Fall of 2020 and will be releasing results primary results May 31st 2021. It is a phase 1 trial, which means it has stronger controls and is more likely to show a positive result, a result which will spike stock prices. Trial 103 will be looking to establish efficacy and safety of this SRP-9001, something which Trial 101 already established, but was contradicted by Trial 102. It is extremely likely Trial 103 will be successful in May. They will also be working on dosage and beginning to create their commercial model for production with these tests. They already are recruiting for Trials 301 and 303 following the completion of Trial 103.\n\n&amp;#x200B;\n\nAs you can see, one failed test hasn't slowed down their pipeline of development at all. This is new technology and they are working to perfect it. It can still be modified and it will be modified. But what if something goes wrong with SRP-9001 or Pfizer completely captures the market? Currently Sarepta has 43 different drug development programs going on 27 of which involve Gene Therapy. In addition they have 2 treatments currently being produced commercially, and another 8 therapies in their final phase of study and waiting for rollout. Finally they have 14 more treatments that are in the preclinical planning phase.\n\n&amp;#x200B;\n\nSarepta isn't just a purely speculative company, they have therapies in every part of their pipeline, therapies that are life changing and will make the stock explode with any positive news. News which is more than likely coming with the amount of trials they are running and the vast range of therapies they are developing. One test dropped this stock 50%, a negative test result that didn't have to do with dangers of the drug, but difficulty presenting increase in protein synthesis vs the placebo group, something that will quickly be rectified and has only been a speed bump in the development cycle. 50% stock price drop when there are 7 other therapies in the final phases of study and are looking to release research in the coming months.\n\n&amp;#x200B;\n\nNow to discuss the competition quickly. Pfizer also has a gene therapy program, and it is in phase 3 of study, whereas Sarepta was in phase 2. However Sarepta was seen as being ahead in development as they began their placebo trial a whole year before Pfizer, Pfizer's placebo trial started just before the new year. Pfizer has now caught up in the race, but they have had several severe side effects in their therapy and are a whole year behind in their placebo, which could show more side effects and might not show strong results against the placebo, in the same way Sarepta had difficulty. Sarepta is well positioned against Pfizer, and at this stock price you are well positioned to take advantage of their hard work.\n\n&amp;#x200B;\n\nSo you've gotten this far I'm guessing you'll want some positions\n\n&amp;#x200B;\n\nJan 22nd 105$ Call, This is purely based on them rebounding from that unnecessary 50% drop\n\nMay 21 135$ Call, Pre Trial buildup Price\n\nJune 18 185$ Call, Post Trial success Price\n\nJan 21 2022 210$ Call, EOY\n\n&amp;#x200B;\n\nBuy them stonks bb, wishing you all the best and strongest diamond hands whatever you buy, as long as it's not puts. And wish these kids some big balls for dealing with a disease that is fucking brutal and unyielding. Thanks for reading so far and  🚀🚀🚀"
  },
  {
   "Title": "You people are creating autists.",
   "#Comments": 1151,
   "Score": 100,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "To preface this story, I am a licensed, fee-only advisor in the USA. I manage roughly $26MM.\n\nI was speaking to a client this morning and he asked if I would have a conversation with his 15 year old son and answer some questions for him and point him in the right direction in terms of his finances. He has apparently got a little lucky on $TSLA lately and made some good money for a 15 year old, (I'm assuming he is using his parents' outside account).\n\nAs soon as I got on the phone with him, I noticed an air of superiority. After discussing his \"investment strategy\" with him for a moment he started to tell me he knows more about investing than I ever will. Keep in mind he says he has been \"investing\" for 2 months. Then he hit me with this quote, which I will never forget in my entire life:\n\n\"Long term investments are for pussies. I dont want to drive a ferrari when I'm 60 if I could when I'm 16\"\n\nYou people are creating an entire generation of autists. Godspeed."
  },
  {
   "Title": "Trump holding press conference today on big tech censorship, Puts on $TWTR",
   "#Comments": 150,
   "Score": 4,
   "Symbols": [
    "$TWTR"
   ],
   "Selftext": "Donald Trump is holding a press conference Today at approx. 3:30 pm eastern relating to big tech censorship.  He as recently alluded to quickly taking action against big tech/social media in response to the recent purging of conservatives on all platforms.\n\nMost notably, the orange man himself was banned from Twitter late last week.  I believe this will be his primary target via executive action.  Whether any action will stick long term is hard to say.  \n\nTwitter has lost its biggest celebrity, and now will likely face increased regulation/scrutiny.  While Twitter's stock is down, it has not yet reached even December lows.  I think the stock still has significant downside.\n\nLink to press conference livestream:  https://www.youtube.com/watch?v=QsWgG11iiCw"
  },
  {
   "Title": "AMZN is getting hot",
   "#Comments": 67,
   "Score": 3,
   "Symbols": [
    "$AMZN"
   ],
   "Selftext": "Here is the next AMZN play, and I got a nice graph to prove it so you retards don't ban me. Anyways, I got a nice run with an AMZN Call not long ago that confirmed this (at least in my eyes). so I am willing to put all of my money on it. Jeff Bezos wants his title back from Papa Musk.  \n\n\nLong story short, AMZN is about to pop. they have earnings coming in late January and we all know they KILLED IT! From previous years, they have been dominating the Black Friday and Ciber Mondays sales, so it is not surprising they did it again with all these covid restrictions. Now, timing is everything, so you still have to time the move. I believe it will rally and then pull back before the final rally up to the moon. you can get calls or spreads, both will pay very nice.   \n\n\nPositions $AMZN 3300/3350C for Jan 29.  \nOnce the pullback happens, then load on Calls. Price target AMZN $3400+\n\nhttps://preview.redd.it/2taynzc9qqa61.png?width=770&amp;format=png&amp;auto=webp&amp;s=94a62e564b6b0a83639c7219552a1aaee7232bf8"
  },
  {
   "Title": "Keeping it rolling",
   "#Comments": 20,
   "Score": 1,
   "Symbols": [
    "$PSTH"
   ],
   "Selftext": "Took 11 days into 2021 to reach this milestone. Never thought I would crack six figures in a year. #blessed... now I have 120% of it in $PSTH shares and June/Dec calls. All or nothing.\n\nhttps://preview.redd.it/0ww5k9a5cqa61.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=95d504aaae17c23a8d1e3c1fc532f48e56f0b44b"
  },
  {
   "Title": "$MELI is a great buy and hold, going balls deep.",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$MELI"
   ],
   "Selftext": "$MELI is a great buy and hold\n\n1) Deep on E-commerce and Fintech, this company is an Amazon + Square + Paypal combination in South America. ARK funda have a good share of it\n2) E-commerce purchases as a part of all retail in Latin America at the end of last year were somewhere around 4% of the total. Huge growth ahead.\n3) MELI jumped 7% on friday because in a press release, MercadoLibre said it will offer $400 million worth of debt paying 2.375% interest and maturing in 2026, and also $700 million worth of debt paying 3.125% and maturing in 2031. The company noted that this will be its first offering of debt securities. \n4) Just started to ride the Green wave, which only brings gains: \"MercadoLibre intends to use the net proceeds from the sale ... to finance or refinance ... environmental objectives such as: clean transportation, land conservation and preservation, energy efficiency, renewable energy, green buildings and pollution prevention and control.\"\n\nMELI can go really high without much risk associated, just expect some low volume volatility. \nMy floor Price Target for MELI is $2300 in 6-9 months"
  },
  {
   "Title": "I know you guys don’t necessarily like Technical Analysis but $PLTR.",
   "#Comments": 100,
   "Score": 1,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "So here’s my DD: \n\n$PLTR is building a steady and solid Relative Strength Index rating. \n\nIt got an analyst upgrade this AM to $30. \n\nLooking at a 3 month chart, you see the (obvious) flight from $11 - $30 through the beginning to the end of November. From here, PLTR forms a bullish pennant, signaling strong support levels and higher highs more often, with higher lows as well. A pause in the price movement which leads to a second breakout. \n\nThis is all from a technical standpoint, which is how I trade personally, and I know you guys think it’s bullshit. But if there are enough retards out there thinking like me, they’ll be buying in too. \n\n$PLTR may finally fly again 🚀🚀🚀"
  },
  {
   "Title": "Signal Hit $70 @ Open! 7000% Up since Elon's Tweet on Thursday",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$SIGL"
   ],
   "Selftext": "Heads UP WSB! Musk Insanity! \n\n$SIGL Volume is barely over 250,000 and its fluctuating so wildly... \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ootsyhoyzpa61.png?width=983&amp;format=png&amp;auto=webp&amp;s=483ee8f2598ba8e75998b096e60a44fa707bbdb0"
  },
  {
   "Title": "PLTR Holders, I’ve got a question.",
   "#Comments": 20,
   "Score": 1,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "If you’re someone who’s held $PLTR before it surpassed $20, are you not worried about the lockup? Better question; if you have shares at an avg of &gt;$15, practically the amount that shareholders were able to sell at the end of last lockup, do you think they’ll sell now that it’s doubled-tripled in value? There’s a big presentation at the end of this month and I know PLTR will be ~$30 by then, but that’s before the lockup ending. If it rises more and more, why wouldn’t shareholders take their profits at a much higher average than last time they had the chance? It’s all speculative, but if the 80% of shares don’t get sold off, then that’s when $PLTR will moon. Except that’s a huge “what if”. I’m looking for people who have been holding for 3+ months, not you recent bag holders who just got in.\n\nCurrent PLTR positions:\n\n300 shares @26.3\n\n1/15 27c x5\n1/22 28c x3\n\nAlso, no proof of positions then your comment is automatically deemed useless to me.\n\n🚀🚀"
  },
  {
   "Title": "$XPEV - Where all bullish indicators collide",
   "#Comments": 67,
   "Score": 1,
   "Symbols": [
    "$XPEV"
   ],
   "Selftext": "**FOMOed on TSLA last week ? Didn't make any money ? Looking at other people's gains makes you cry?**      \nLook no further! XPEV is about to explode and follow TSLA and NIO and in a little bit I'm gonna use pictures to show you, autists, why.\n\n&amp;#x200B;\n\n  \nMy father once said: \\*\"Son, the path I had walked is filled with mushroom, you are now picking.\"\\*  \nThat's not what actually my dad said, but it's what Grandaddy Elon once told Xiao Peng, anyways  \nI assume you already know everything about XPENG, knowing how well you like to read in this sub, so lets dive into it.     \n\n\n&amp;#x200B;\n\n**When it all comes together:**  \nRarely you open a chart and looks so good like the stripper in Vegas you desperately dream about, but have no tendies to go.    \n\n&amp;#x200B;\n\n  \n**1. Textbook Head and Shoulders.**\n\n**2. Volume Profile** to the right shows a very well indicated Support Zone       \n\n\n*Processing img gdbj29x89ma61...*\n\n**3.  Golden Cross**    \n\n&amp;#x200B;\n\n[ The golden cross is a chart pattern that is a bullish signal in which a relatively short-term moving average crosses above a long-term moving average. The golden cross is a bullish breakout pattern formed from a crossover involving a security's short-term MA\\(20\\) in our case breaking above its long-term MA\\(50\\) and\\/or resistance level. ](https://preview.redd.it/f7zmrh9fama61.png?width=838&amp;format=png&amp;auto=webp&amp;s=c6c11d3c04a1ccf18008d3877918c9d8e6586d19)\n\n**4. Bullish Momentum on MACD (D)**      \n\n\n[You can see here how the bearish momentum comes to an end implicating steady improvement to the bull side.](https://preview.redd.it/22mdhys2bma61.png?width=673&amp;format=png&amp;auto=webp&amp;s=4f20c8caed8f8bf48578f17028b5b14e690e2d5e)\n\n**5. It's a damn EV, all EVs go up, don't be a pussy!**     \n\n  \n\n\nNow let's talk everyone's favorite \\*Implied Volatility\\* and \\*Risk Management\\*    \n\n  \n\n\n![img](hvwg5p44dma61 \"IV graph showing to difference in IV in their respective DTE.\n\")\n\n**Paper Flow:**      \n\n\n[$156K in 52C for next week, this is actually right at the first PT on the left shoulder resistance level.](https://preview.redd.it/zsu5bwykdma61.png?width=908&amp;format=png&amp;auto=webp&amp;s=0298add7343f4f54d5c7ea622705bba8b9a108ee)\n\n&amp;#x200B;\n\nFinally Targets:  \n\n\n*Processing img mlaatt9xhma61...*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**What to buy, considering the high IV and the future of S&amp;P:**  \n\n\n[Personally, I think we're over extended and right at the top, looking for a correction back to the 360 level, so be very careful.](https://preview.redd.it/pbq9d437jma61.png?width=906&amp;format=png&amp;auto=webp&amp;s=cfa96bd94b0fb850c95afd6270ee9b5ce24e06fb)\n\n**Positions:**  \n15 JAN 47.5C  \n19 FEB 60C"
  },
  {
   "Title": "$CLHI DD. Next $SNOW &amp; $ZI sitting at $1.51 pps",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$ZI",
    "$SNOW",
    "$CLHI"
   ],
   "Selftext": "If you ever wanted the opportunity to invest in the next $SNOW or $ZI when it was under $2 per share with only 24m OS &amp; only 200m AS you have the chance now. Currently an otc stock with the merger with The Data Source finalizing any day, it will uplist this year &amp; you will be kicking yourself for missing this opportunity. Here’s a document I put together of some DD for this incredible opportunity. Verify everything I say as it may seem too good to be true but these opportunities don’t come around too often. Let me know your thoughts &amp; if you have any questions lmk\n\n\nhttps://docs.google.com/file/d/1THfVJm_Hs0Cr2lVb9VPrINEqKlFPEZLl/edit?usp=docslist_api&amp;filetype=msword"
  },
  {
   "Title": "Why $TSLA isn't overvalued (real edition)",
   "#Comments": 25,
   "Score": 1,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "First, at the top, for those of us here who can't read... TSLA  🚀🚀🚀🚀 \n\nOkay, I need you guys to listen, and listen good because I am going to go over a lot of already known public information about TSLA that somehow the gummy bears here keep forgetting, or just are not accounting for.\n\nTSLA is more than a car business, it's more than a solar power company, and it's more than a tech company.  TSLA has the absolute best long term solution for solar power roofing on the market right now when factoring in maintenance costs, power bill savings, and all installation.  Clean energy over the next few years is going to 🚀🚀🚀🚀 in general because of the movements the USA will make in order to promote clean energy as a country, and the world as a whole will follow.  This means that there will be lots of new properties being built with solar panels, and there will be lots of people who are doing roof repairs swapping to solar panels.  TSLA already has factories in multiple countries, and has the infrastructure to quickly scale up to meet demand, which we have seen back with their model 3 production ramp up, and now with their massive funding, they should be able to do so much more effectively this time than the last.  TSLA will make a lot of money this year, next year, and onward off of their solar panels alone, and they will likely sell very well with the 25 year TSLA warranty in conseration.\n\nSolar market recap/summary:\n\nTSLA has the best solution, competitive pricing for premium roofing, and long term performance because of the 25 year warranty.\n\nTSLA has factories in most of the world already, and is able to scale up really fast in order to meet rapid demand as the demonstrated with the model 3.\n\nNow, that's just the beginning, FSD will have a massive impact when they achieve it because they will no longer be taking market share just from the car industry, but also from uber/lyft/grubhub, etc.  Elon has said before that they want to eventually have enough cars in production to roll out FSD taxi's.  They said initially, they will leave the steering wheel for user override, with the intention of eventually having enough of the roads being self driving cars, and the software being mature enough to remove the steering wheel (we'll see about it, I'm not one to go against papa Elon, but I don't know if people would be okay with that in the next 5 years +).  Elon also said in the same conference, that he wants to allow existing Tesla owners to be able to lend their cars back to Tesla to let them be a part of the FSD taxi service with all profits going to the owner of the car instead of Tesla, which will give them a faster ramp up time in every area because Teslas are popular enough, and the need for extra income is always there, like you retards know.  \n\nSo, to summarize all of this, Tesla isn't a car company, or a solar company, or whatever kind you can think of because Tesla is really just something we haven't seen before, and it will continue to grow, and amaze us in how much of the world they will be able to profit off of.\n\nThis is also why we don't need to worry so much about Tesla competitors in this sense because they are so far ahead of the curve that they aren't playing in a fair fight.  Tesla is done with cars, papa Elon wants to get to a point where nobody owns a car, and everyone uses the Tesla-Express.  This will cripple the insurance business for individual car insurance, since only people who own cars will need it.\n\nThis post is getting long, and so I won't get into all the other upsides of their batteries, and charging stations, but I will say that the upside is just as massive.\n\nGranted, at a certain point papa Elon said this robo-taxi would be ready in 2020+, I would expect it to be ready numbers wise 2022-2023, and infrastructure, and regulation hurdles in production 2024-2025.  I am not saying that TSLA will be uphill constantly on this trip, and that there is not a bubble, but what I am saying is that all of those things accounted for, the entire upside of the company, in terms of it's impact to the world, and how much the world will eventually rely on it, the price is far under where it will be, and this will be competing in the same scale as Amazon within no time (relatively speaking).\n\nTLDR:\n\nTSLA has massive unaccounted for potential on their robo-taxi, and solar roofing future, and even if we are in a bubble, TSLA will eventually be a name everyone knows by name because they own, or use one of their products.  TSLA 🚀🚀🚀🚀🚀🚀🚀🚀 \n\n&amp;#x200B;\n\nI will get better at writing these, I need my IQ to drop a bit more from WSB before I can get some real quality out.\n\nThanks guys.\n\nSources:  \n[https://twitter.com/elonmusk/status/1249210220200550405?ref\\_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1249210220200550405%7Ctwgr%5E%7Ctwcon%5Es1\\_&amp;ref\\_url=https%3A%2F%2Fwww.caranddriver.com%2Fnews%2Fa32159871%2Ftesla-robo-taxis-still-coming-2020%2F](https://twitter.com/elonmusk/status/1249210220200550405?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1249210220200550405%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.caranddriver.com%2Fnews%2Fa32159871%2Ftesla-robo-taxis-still-coming-2020%2F)  \n\n\n[https://www.youtube.com/watch?v=LO1nDnnv\\_Og](https://www.youtube.com/watch?v=LO1nDnnv_Og)"
  },
  {
   "Title": "$CNET *EXTREMELY UNUSUAL OPTIONS ACTIVITY*",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$CNET"
   ],
   "Selftext": "LISTEN UP YOU RETARDS. I did some reading and u all need to jump in and make $4.00 calls exp 1/15/21 on $CNET. Look at this\n\n&amp;#x200B;\n\n*Processing img iw6iownzlna61...*\n\nI DONT KNOW WHAT IV AND VOL/OI MEAN BUT THEY ARE PRETTY FUCKIN BIG LETS MAKE SOME FUCKIN DOUGH ON MONDAY BOYS WHOS WITH ME"
  },
  {
   "Title": "$NGA",
   "#Comments": 18,
   "Score": 2,
   "Symbols": [
    "$NGA"
   ],
   "Selftext": "* Am not sure if this post is authorized* please delete if it’s not thanks!\n\nCEO of Lion Aka NGA yesterday on Guide Auto French Radio:\n\n🤚 Highlights:\n\n- People don’t know us if you are looking at cars market but when comes to 🚌 and heavy trucks 🛻 we are known ...we did born 12 years ago!\n\n- Our first delivery took place in 2016\n\n- I started with my partner during 2008 and 2010 we said we will not touch EV cars and we went for heavy Trucks \n\n- Main trucks (Diesel) problems/issues is they do Rust and we took our time to innovate and perform that our products dont rust as Fast as Diesel matter fact our clients are very interested as it save them future costs of maintenance !\n\n- Our clients can choose to pay for battery autonomy depending on their needs starting 150km (100 miles) our best seller and up ...dont forget they are either busy in the morning or evening so they charge it in between if needed...We are flexible with our client needs\n\n- EV school bus 🚌 or heavy trucks cost 2 times more compared to regular diesel ones however in a long run it gets cheaper ..we are talking about 40k more and usually it will take 3-5 years for a client to save money back they invested which is very interesting because after that no costs at all ....\n\n- Our buses/trucks life span is about 12 years or so\n\n- Since the beginning we do pack our batteries (Quebec faciliy)\n\n- We have a long term deal with BMW for their I3 400V and we do split Them to 800V \n\n- We have also have an agreement with a company called Romeo Power ..\n\nAlert 🚨: We announced that we are going to build our own battery facility for 500 gigawatts ..we are not only be able to pack our batteries but to build them 100% Lion  ...we will not gonna need anyone for batteries anymore this way we can answer to PO’s very fast ..\n\n- Yes we can start selling Lion’s batteries ..companies can ask us and it will be our pleasure to help them but our main focus now is to be Self-Served first\n\n- Lion can customize their EV based on the client requirements exemple a truck sold in Canada or North USA it gets very cold during the winter times so the heating will be Diesel ...trucks sold  to California or Florida as exemple are 100% EV\n\n- During The cold winters Trucks will probably loose 10% of their electric capacity...\n\n- Amazon deal is true it’s up to 2500 trucks not 2500 PO...500 trucks order maximum a year because they want to keep orders open for other companies (orders are For Lion 6 and Lion 8...\n\n- In Quebec facility we can build 2500 EV per year with no problems ...\n- Yes we are known for 🚌 but it has been 5 years ago that we planned to go into urban trucks as well so our facility is ready ..it’s not new for us ...\n\n- Truck Lion is 100% Lion we don’t buy anything from outside... \n- We have no intention to compete with cars market our vision is only for heavy/urban trucks ..cars market do have their big players already...\n\n- Companies they dont think about environmental benefits only matter fact those discussions last usually 30 sec during our meetings ...our discussions is more about the economy and the benefits that can generate (long term).....\n\n- Hydrogen Fuel ? we did study this avenue but we said NO we are not taking that road..hydrogene today is beneficial for long distance heavy trucks and for now our focus is on urban trucks as our maximum battery autonomy is 400 km or 250 miles...\n\n- When companies call us for 600-700 km unfortunately we dont have any products for them today..\n\n- Urban trucks or delivery 🚚 or school buses 🚌 represents billions of $ and we want to control that first !\n\n🚨 Alert \n\nOur battery autonomy now can do 400km by 2021 will reach 430km by 2022 will do 500km by the next upcoming years (6-7) will reach to 800-900 km (600 miles) so why invest now on hydrogen when we know we will get there very soon with 100% EV for heavy long distance trucks ( he did laugh) !\n\nComments: We don’t want to waste our time with Hydrogen we will take down that market for long distance trucks soon anyway..again our main focus is urban trucks\n\nhttps://www.qub.radio/balado/le-guide-de-l-auto\n\nMyself: * I do hold NGA shares and i dont trade any shorts or puts...I will hold shares for a long hold*"
  },
  {
   "Title": "The Real Short Interest of GME and other Details",
   "#Comments": 39,
   "Score": 0,
   "Symbols": [
    "$gme"
   ],
   "Selftext": "All you frickin autists who have no idea have been reading yahoo finance and shit to say that there is a 130%+ short interest in GME. I have spent a few hours looking into all this shit\n\n1. The short interest is like 60%. \n\nhttps://www.shortsight.com/short-interest-of-float-2-0/\n\nhttps://twitter.com/ihors3/status/1346561814956552193?s=21\n\n2. Legally, the passive investors have to recall their shares on a “material vote”, practically I think material isn’t defined. They didn’t recall their shares when there was a proxy battle between permit/hestia and the board. Only chance they recall their votes is if there is a go private, even then they might not. Not sure about this.\n\nhttps://www.marketscreener.com/quote/stock/STATE-STREET-CORPORATION-14499/news/Investing-Giants-Cede-Full-Vote-Power-WSJ-30755472/\n\nhttps://www.blackrock.com/corporate/literature/publication/securities-lending-viewed-through-the-sustainability-lens.pdf\n\n3. Don’t underestimate how long shorts can and will hold out. Look at Tesla. The passive investors DO have a handshake agreement as you can see in the blackrock PDF. Read the examples of Dell and Telecom Italia. Incidentally other \n\nThat being said, GME being taken private is still the key element to a short squeeze.\n\n$gme gamestop"
  },
  {
   "Title": "Calls on $YUM? KFC console will literally warm your tendies",
   "#Comments": 33,
   "Score": 6,
   "Symbols": [
    "$YUM"
   ],
   "Selftext": "I honestly don’t even know the right ticker for this interesting “opportunity.” I imagine with KFC becoming a tech company, we can not only have our tendies but eat them also.\n\nAnyone know where to dump money into this venture? I think it’s the most retarded play that it might just work. $YUM seems to be what the internet wants me to pick but maybe some of you know better.\n\nAlso, if you know where I can get an actual console, I would love to eat chicken out of it\n\nNo positions yet because I’m not sure if I have the right ticker"
  }
 ]
}