{
 "Data": [
  {
   "Title": "$WISH continues to print, the most downloaded ecommerce application will surprise you!",
   "#Comments": 26,
   "Score": 0,
   "Symbols": [
    "$WISH"
   ],
   "Selftext": "Ok so i had this post yesterday about $WISH potential with some key details [https://www.reddit.com/r/wallstreetbets/comments/kr8ir9/pltr\\_co\\_founder\\_john\\_lonsdale\\_8vc\\_firm\\_owns\\_a/](https://www.reddit.com/r/wallstreetbets/comments/kr8ir9/pltr_co_founder_john_lonsdale_8vc_firm_owns_a/) Today has been another good print. Don't take this off the book just because you see many cheap shit products. This company is like kings of ecommerce marketing techniques, no wonder WISH application was the most downloaded shopping app worldwide in 2020. [https://www.businessinsider.in/retail/news/wish-the-worlds-most-downloaded-shopping-app-has-filed-to-go-public-after-reporting-1-75-billion-in-revenue-in-the-first-9-months-of-the-year/articleshow/79371802.cms](https://www.businessinsider.in/retail/news/wish-the-worlds-most-downloaded-shopping-app-has-filed-to-go-public-after-reporting-1-75-billion-in-revenue-in-the-first-9-months-of-the-year/articleshow/79371802.cms) As long as $WISH user base continues to grow, you will be amazed when earnings are made public, good luck!"
  },
  {
   "Title": "$BB TO THE MOOON🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
   "#Comments": 20,
   "Score": 0,
   "Symbols": [
    "$PLTR",
    "$BB"
   ],
   "Selftext": "Hello fellow autists, I’m a 17 year old degenerate gambler who found this great place about a month or two ago. Around then, $PLTR was booming, and I made $30 off of your brilliance. Then I made a mistake. The greatest mistake of my life thus far. I believed in meme stocks, and started investing in every meme stock there has been since, and made $10 here and there, slowly expanding my portfolio. Then a DD on Black Berry, which is now a cyber security company, working in the public and private sectors, including working with car company’s computer technology, caught my eye, and something about it made me put 80% of my money into it🚀🚀🚀🚀🚀🚀🚀. Then it dropped from 8 to around 6 dollars, leaving me lost, hopeless, and almost penniless. But my emotions do not effect my hands, as they are diamond. So after hearing all of that, im sure your wondering, why not buy the dip like a sane autist and wait, because stocks only go up? The answer is, I can’t. My mommy thinks I am going to lose my life savings of a grand if I keep losing money like this, so she won’t add any more into my Robinhood account until she sees some green. So please, for the love of god, fuel those rockets up, support my gambling addiction, and SEND BLACK BERRY TO THE MOTHERFUCKIN MOON🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$JOE... Buy into The Hamptons when it was still a bunch of fucking potatoes farms.",
   "#Comments": 33,
   "Score": 2,
   "Symbols": [
    "$JOE"
   ],
   "Selftext": " $JOE is a company that owns large coastal Florida real estate. The market is on fire and benefitting hugely from the mass exodus of the rich from tax heavy states such as New York as well as the fear of inflation. \\[[https://www.joe.com/video-gallery](https://www.joe.com/video-gallery)\\] \n\n $JOE owns about 170000 acres across Florida. The Company develops its land through segments comprising residential, resorts and leasing.  Fair value today is north of $100 and it likely trades for a few hundred a share over the next year.\n\nIt's latest SEC filing makes me extremely bullish. \\[[https://ir.joe.com/node/18531/html](https://ir.joe.com/node/18531/html)\\] \n\nIt currently has an estimated earnings per share growth rate of 40%. Total revenue increased by approximately 28% to $42.0 million for the third quarter of 2020 as compared to $32.8 million for the third quarter of 2019.\n\nThis included a 37% increase in real estate revenue, a 22% increase in leasing revenue and a **21% increase in hospitality revenue.** A 21% increase in hospitality revenue, during COVID, not bad...\n\nIt trades at 4x book value. Even if the company stops making money and sells all it's land the shareholder will still get more back than what the stock currently trades at. \n\nManagement has also been slowly buying back shares and this looks set to continue, in addition they've announced a new quarterly dividend program this year.\n\nThey are set to announce the sell out of one of their developments in the next few weeks and this will likely provide a catalyst. \n\nThis stock will explode over the coming months. If you bought into the Hamptons 50+ years ago your family would have made an absolute fortune. Now is another opportunity. \n\nTLDR: [https://www.youtube.com/watch?time\\_continue=4&amp;v=Od6FMshu3wk&amp;feature=emb\\_title](https://www.youtube.com/watch?time_continue=4&amp;v=Od6FMshu3wk&amp;feature=emb_title) \n\nPosition: JOE Long Call Dec 17'21 Call 50"
  },
  {
   "Title": "Is it me or is this subreddit lately just all about option calls on $TSLA, $GME, and $PLTR lately?",
   "#Comments": 61,
   "Score": 0,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "Don’t get me wrong - I do admire all of these stocks (not equally, but that’s another discussion). However, lately I have been seeing that this subreddit is just turning into a spam centre of just these three stocks of someone either claiming absolute servitude to Daddy Musk, or just throwing a meme without serving anything new. \n\nEveryone of course is free to do whatever they want, but I am wondering if it’s just me feeling like this or are there people here who have been getting the exact feeling all along? If you are feel like that, what would you wish to change?"
  },
  {
   "Title": "Updated gains porn - $BPY merger arbitrage",
   "#Comments": 18,
   "Score": 1,
   "Symbols": [
    "$BPY"
   ],
   "Selftext": "The other day, I posted about a merger arbitrage play that pretty much can't go tits up.\n\nEnded up increasing my position by an extra 50 contracts, I'm now naked 250 x 16$puts for June expiry.\n\nShares are holding steady at 17 as investors are betting that they will have to increase their bid above 16.50 to take this baby private.\n\nPuts are still changing hands at about .85-.90$, there's still some room to the play, although it's not as appealing as it was on Monday, I think you still have some room to make some easy money while you wait to see what the next meme stock is.\n\nIf you have limited margin available, you can open a credit spread selling the June 16$ puts and buying the 10, 11 or 12$ puts to reduce your margin requirement significantly.\n\nThe buyout offer is 50c above the strike, this has a VERY high likelihood of success.\n\n&amp;#x200B;\n\n[https://www.reddit.com/r/wallstreetbets/comments/kqiptp/some\\_dd\\_that\\_will\\_actually\\_make\\_you\\_people\\_money/](https://www.reddit.com/r/wallstreetbets/comments/kqiptp/some_dd_that_will_actually_make_you_people_money/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9nd4ra4ulq961.png?width=984&amp;format=png&amp;auto=webp&amp;s=6b255a88ba29a5b30f5302cc95b56bc3ccc662cb"
  },
  {
   "Title": "$$SKLZ DD inside! My own REPOST was an Xmas present but New Years THIS THING GOT LEGS!!",
   "#Comments": 23,
   "Score": 1,
   "Symbols": [
    "$SKLZ"
   ],
   "Selftext": "ONLY CHANGE IS NOW CATHIE FROM ARK IS IN BABY!!!!\n\n\nXmas Present!! More $SKLZ DD inside!\n\nCourtesy of The Great Correction \n\nValuation Disparity...\n\nU currently 800M in revenue.\nSKLZ currently 250M in revenue.\n\n250/800 = .31 or 31%\n\nSo SKLZ should be valued at 31% of U's current market cap based on total revenue.\n\nU current market cap 45B\n\n45(.31) = gives us SKLZ market cap with U's valuation... 14.06B\n\nSKLZ current market cap... only 7B @ $20\n\n14/7 = 2\n\nWe need to multiply the current share price by 2 to get to a 14B market cap.\n\n2($20) = $40\n\nSo if SKLZ is just valued like it's peers, it's ALREADY a $40 stock WITHOUT the 100%+ growth they will experience over the next 24 months.\n\n$80+ in 2022.\n\nIt's just math.\n\nSKLZ is a BIG FAT gift here.\n\nPeople will catch on eventually.\n\nGood Luck.\n\nTLDR THIS SHIT IS A BEAST!!!! AKA CATHIE FROM ARK IS INNNNNNNN IT TO WINN IT"
  },
  {
   "Title": "Imagine not buying $CRM at $216 this morning, LMAO.",
   "#Comments": 9,
   "Score": 1,
   "Symbols": [
    "$CRM"
   ],
   "Selftext": "Just saying guys, it's like seeing a drunk, sexy ass 10/10 at the club, and doing absolutely nothing. Like a doormat of a man.\n\nIn fact, imagine if that 10/10 even came up to you, whispered some seductive shit to you. Something like, \"Stonks only go up, you fuck\".\n\nAnd you STILL did nothing. There's no excuse at that point, you are not saveable."
  },
  {
   "Title": "$BBBY, why it's not too late to get in",
   "#Comments": 53,
   "Score": 1,
   "Symbols": [
    "$BBBY"
   ],
   "Selftext": "$BBBY has been on a run the last couple of days, up \\~17% from the lows of last week thursday.\n\nNow, there has been enough good DD here as to why this Earnings play should work out, so i won't focus on these fundamental points. \n\n(if you want to read up, lots more to find aswell:\n\n[https://www.reddit.com/r/wallstreetbets/comments/km048x/very\\_bullish\\_on\\_bbby\\_dd\\_included/](https://www.reddit.com/r/wallstreetbets/comments/km048x/very_bullish_on_bbby_dd_included/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/kqgxzm/bbby\\_omni\\_channel\\_short\\_squeeze\\_against\\_melvin/](https://www.reddit.com/r/wallstreetbets/comments/kqgxzm/bbby_omni_channel_short_squeeze_against_melvin/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/krapwx/i\\_am\\_investing\\_everything\\_i\\_have\\_into\\_bbby\\_here/](https://www.reddit.com/r/wallstreetbets/comments/krapwx/i_am_investing_everything_i_have_into_bbby_here/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/kr1o3x/bbby\\_upcoming\\_er\\_is\\_the\\_next\\_short\\_squeeze\\_play/](https://www.reddit.com/r/wallstreetbets/comments/kr1o3x/bbby_upcoming_er_is_the_next_short_squeeze_play/) )\n\n&amp;#x200B;\n\nPersonally, although i wrote my DD over a week ago and had decent positions, i mainly went in yesterday after close (at $19.70) and today morning (at $20.35) for another 600 shares. And I don't really regret any of this. It has been on a steady climb for a couple of days now. Last week the shorts pushed it down, probably trying to shake off more people and spread fear so they could buy in at a lower point. (worked vs. me, i got scared of the idiot crayon TA analysts that said it could go to 15, so i didnt buy the dip and waited for confirmation of runup.)\n\nBut last earnings it was the same, it wasn't too late by any means to get in right before earnings. \n\nFrom Sep. 21 to Sep. 30, the price went from \\~$12.2 to \\~$14.5, or a nearly 20% increase. Then it popped to \\~$20.5 after earnings, or another \\~30%. 2 weeks later it was at \\~$25, or another 25%.\n\nSo, despite it running up 17% before earnings now, last time it gained another +50% on top of that after earnings. And, as the DD shows, this earnings should be even better. The thing is, shorts and investors seem to know this. The float and volume on this is way too high for retail to move it like this, it's not a meme stock anyway. So you still have today to get into this if you believe in the earnings.\n\nOn top of that, the CEO Mark tritton is no imbecile. They have literally hundrets of millions ($325m) to spend on share buybacks until the end of february. **What better point to create shareholder value than to present excellent earnings AND use a ton of the sharebuyback money to blow up the price at the same time?** This duality ensures that shorts start to sweat and the price goes up even more, and for good reason.\n\nCompare this to JWN. They TRIPLED their share price in november due to better than expected earnings, and investors being optimistic about them surviving the pandemic.\n\nThe reason for 70% shorts for BBBY is that everyone expected them to not survive corona, or atleast heavily succumb under their garbage assets and dept. All of that has been taken care of. If BBBY shows again that they are on a sustainable road to profits again, this will fly. On this note, I won't sell for a couple weeks even if earnings do pop it 20%+, will wait for 50% at the least depending on earnings. Could be well another JWN in the makings.\n\n&amp;#x200B;\n\nRisks: Earnings miss. This is all, but based on the price movement, DD done and history, this should not happen.\n\n&amp;#x200B;\n\n**Tl;dr:** Share buybacks combined with good earnings and super high short% of float = payday for anyone who still gets in. Compare to previous earnings (these should be even better) and the pop of another retailer in november, JWN."
  },
  {
   "Title": "YOLO TRADE ON $JAGX",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$JAGX"
   ],
   "Selftext": "Watch it go +300% in Q12021. Buy the yacht on credit and pay it off when this puppy explodes.\n\n[to the mooonnn🚀🚀🚀🚀](https://www.marketwatch.com/story/jaguar-health-shares-soar-40-in-heavy-volume-on-track-for-18-month-high-11609869144)"
  },
  {
   "Title": "Time to buy cannabis stocks!",
   "#Comments": 39,
   "Score": 1,
   "Symbols": [
    "$MSOS"
   ],
   "Selftext": "The MORE act which federally decriminalizes cannabis has already passed the house, now the senate has the power to bring it to a vote. I personally believe that the MSOs have the greatest potential. $MSOS is the easiest play, or check out it's holdings for ideas (sorry robinhood crowd, they're all OTC meaning $MSOS is your only play). \n\nWhy US companies over Canadian?\n\n1) The US market is WAY larger than Canada's. \n2) Cannabis being a schedule 1 substance has been a significant handcuff to MSOs (multi state operators).\n3) US based companies have much more attractive financials. \n\nWhat does decriminalization do for MSOs?\n1) Allows their products to cross state lines. The reason they are called MSOs is they have to silo operations in each state in which they operate. Any product bought in a dispensary is grown and processed in that state as well. Centralizing operations will lead to massive economy of scale improvement. \n2) Allows them to move from OTC markets to the NYSE/NASDAQ.\n3) Allows them to use banks. Right now it is a cash business in most states except the few with specialized credit unions. This leads to overhead in security and cash management.\n4) Allows them to take tax deductions. Any company dealing in a schedule 1 substance has to pay full corporate tax without any deductions."
  },
  {
   "Title": "The next pharma pennystock to lift off!!",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$CHEK",
    "$BNGO"
   ],
   "Selftext": "Got both $BNGO and $CHEK this week!! Made more than 200% on both! Next up is $TNXP!! Buying heavily premarket today"
  },
  {
   "Title": "$NGA DD for my fellow autist ngas",
   "#Comments": 37,
   "Score": 1,
   "Symbols": [
    "$NGA"
   ],
   "Selftext": "\n\nLion is a super legit company. Confirmed!!!\nSo much potential, read up on it here. This was before amazon ordered 2000 vehicles!\nhttps://pages.thelionelectric.com/wp-content/uploads/2020/11/Investor-Presentation_20203011.pdf (notice how JT even visited?)\n\nSo basically NGA is a SPAC for Lion to get funding for operations. Theyre saying the merger is happening as soon as feb. The only issue here is that once they merge, Lion shareholders will own 70% of the combined company (IF they end up merging which is statistically improbable but COULD always happen if it gets rejected). SPACs are usually a nono but this ones got a lot going for it.\n\nWhat this means post-merger : assuming todays after hours close at 23$ per share, this implies a 4.5 Billion dollar valuation. Which isn't much in the EV sector... that's why its a BUY NOW until merger ASSUMING you believe in the EV sector. If you don't, ignore this post. \n\nWhen I say \"not much for the EV sector\" I'm referencing my opinion to NKLA, which isn't even a real company and has 0 product which is valued at 6+ billion usd right now...\n\nWhat's happening : not many shares are available pre-merger and I doubt the insiders who own 70% of the \"unavailable shares\" will sell a big part once they can due to the potential of this. It's getting a lot of hype. Possible investigation into this but everything gets investigated these days while no fraud is found.\nhttps://www.globenewswire.com/news-release/2020/12/03/2139439/0/en/SHAREHOLDER-ALERT-Rigrodsky-Long-P-A-Announces-Investigation-of-Northern-Genesis-Acquisition-Corp-Merger.html\n\nSHORT TERM BUY (I'd put superbuy if it was a word)\nPositions at market open \n25c jan 15 \n25c feb 19\n30c apr 16\n\n\nTHIS IS A POTENTIAL MEME STOCK!!\n\nyou gonna buy NGA my nga?\n\n🚀💎"
  },
  {
   "Title": "Amazon Buying 2,500 Lion Electric Trucks $NGA",
   "#Comments": 48,
   "Score": 1,
   "Symbols": [
    "$NGA"
   ],
   "Selftext": "Why is nobody talking about this. NGA to the god damn moon. You guys might say it's too late, I say there's still room to go. Actual vehicles on the road? $3.5B projected revenue by 2024? Deal with BEZOS, Blink, Chargepoint, and MORE? \n\nJUSTIN TRUDEAU VISITED THEIR FACTORY? Yeah this isn't no NKLA. This one is for the long term. Wait until they finish expanding to the US. None of the other meme stocks have actual heavy duty EVs and school bus EVs on the road except for these guys. \n\n[https://finance.yahoo.com/news/northern-genesis-spac-rallies-lion-162015419.html](https://finance.yahoo.com/news/northern-genesis-spac-rallies-lion-162015419.html)\n\n[https://pages.thelionelectric.com/wp-content/uploads/2020/11/Investor-Presentation\\_20203011.pdf](https://pages.thelionelectric.com/wp-content/uploads/2020/11/Investor-Presentation_20203011.pdf)\n\n[https://www.youtube.com/watch?v=rsOuM1G2yho](https://www.youtube.com/watch?v=rsOuM1G2yho)\n\nI see Amazon deal. I see real vehicles sold. No more DD to be done.  Wake the hell up."
  },
  {
   "Title": "Bull/Bear thesis for $MT and $VALE",
   "#Comments": 5,
   "Score": 1,
   "Symbols": [
    "$MT",
    "$VALE"
   ],
   "Selftext": "With all the bullish chatter surrounding these two tickers, can anyone think of a legitimate Bear thesis for these stocks in the next ten years? \n\nIn my opinion metals will grow like we have never seen them before going into this EV market. Supply is already scarce, Demand is rising and the dollar is dying. \n\nMetals seem like the most obvious play which is why I am asking for someone to present a bear thesis"
  }
 ]
}