{
 "Data": [
  {
   "Title": "FYI- For everyone getting fucked over by RH and switching to TDA this weekend, you CAN do instant deposit!",
   "#Comments": 41,
   "Score": 6,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "I answered this in another thread regarding STEEL GANG getting fucked by RH not allowing ADRs to buy the fucking $MT dip and $VALE, but here's the post by /u/danieldriscoll\n\n\"\nFor everyone switching to TD Ameritrade today after being fucked over by RH you should know that there definitely IS instant deposit with TD Ameritrade.\n\nYou have to download the actual TD Ameritrade app (I have not tried using the ThinkorSwim app)!\n\nGo to the 'More' tab on the bottom far right, then go to 'Contact us'.\n\nFrom there hit the message bubble next to 'Need help with your account?'. That will open an iMessage window.\n\nOnce there, type in \"Fund account\". It will ask you to click a link to login to TDA on Safari then you can come back to the iMessage and it will ask you to click on a 'Deposit Menu'. \n\nClick on the 'Deposit Menu' and select the first option which is Apple Pay (Debit Card Deposit) and from there you're good to go! Just keep following the instructions.\n\nTL;DR: TD Ameritrade also offers Instant Deposit for iOS but if you're on Android...R.I.P. I guess. Also, puts on RH!! \"\n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/fceg0u/yes_you_can_do_instant_deposit_with_td_ameritrade\n\nAlso:\n\nhttps://www.tdameritrade.com/funding-and-transfers.page\n\nFor me, for options it took 3 business days for funds to be cleared for use. \n\nFor those fellow autists that binge Adderall and study charts and researching the next moon rocket, there is a metric fuck ton of resources on TD Ameritrade. \n\n-Nitro"
  },
  {
   "Title": "BOW DOWN BEFORE YOUR AUTISTIC GOD $TSLA YOLOs GO BRRRRRR 1627%",
   "#Comments": 10,
   "Score": 4,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "3 tranches of YOLO calls + 1 set of short puts = $15K in &gt; $233,457.38 actualized profit.\n\n* TSLA 01/08/2021 750.00 C\n* TSLA 01/08/2021 800.00 C\n* TSLA 01/08/2021 850.00 C\n* TSLA 01/08/2021 725.00 P\n\nNot Pictured: 7K in losses from TSLA 01/08/2021 900.00 C / TSLA 01/08/2021 950.00 C. You don't get them all right.\n\n\\#diamondhands\n\n&amp;#x200B;\n\n[- TSLA 01\\/08\\/2021 725.00 P](https://preview.redd.it/x8wkssn247a61.png?width=1654&amp;format=png&amp;auto=webp&amp;s=b478d55d172ca1708ad3c2c76d6e4eaedfd8ccb2)\n\n[- TSLA 01\\/08\\/2021 850.00 C](https://preview.redd.it/kqdvvwn247a61.png?width=3120&amp;format=png&amp;auto=webp&amp;s=fa75be32df1d2d8f7df731799bcdc3530ae7fff7)\n\n[- TSLA 01\\/08\\/2021 800.00 C](https://preview.redd.it/bugdeyn247a61.png?width=3138&amp;format=png&amp;auto=webp&amp;s=bf8e373e8a0845aef8b47b0fe399c5313886ce13)\n\n[TSLA 01\\/08\\/2021 750.00 C](https://preview.redd.it/sb8kbyn247a61.png?width=3148&amp;format=png&amp;auto=webp&amp;s=810cb0250b7d13f5cef649d631e630ecc74fb74a)"
  },
  {
   "Title": "Musk’s long game",
   "#Comments": 37,
   "Score": 4,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "Ironically, Musk has no desire to accumulate wealth for the sake of buying things or controlling governments. He wants capital to (1) save Earth and (2) colonize Mars.\n\nNearly all of his net worth is currently tied to the share price of $TSLA, so how does he extract cash without selling shares and pushing his net worth down?  I know, I know, what a lovely problem to have!\n\nBut seriously, how can he maintain his net worth while extracting cash?\n\nSomeone recently suggested to Musk that he change his corporate structure to resemble Alphabet. Elon replied positively.\n\nThe Plan: restructure $TSLA into a holding company which then acquires, one-by-one and only when the timing is perfect, each of his private companies.  Musk receives a direct cash payout for his share of each private company.\n\nElon gets cash, $TSLA holders gain various private companies. $TSLA’s share price fluctuates, but never crashes and analysts dive in and attempt to quantify the future value of each new company."
  },
  {
   "Title": "Google is running a scam. Their GOOG stock is a Pyramid scheme.",
   "#Comments": 64,
   "Score": 6,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "GOOG is a C class stock without voting rights and it doesn’t pay dividends, and they said that they will not pay them in the future. The company explicitly said in its 2017 annual filing with the Securities and Exchange Commission that \"we intend to retain any future earnings and do not expect to pay any cash dividends in the foreseeable future.\" Google states the \"par value” (the amount Google owes you for the stock) of each GOOG stock is 0.001$ US Dollars. Yet each stock is sold at 1700$ in the stock market.\n\nWhy does one buy a GOOG stock? To make money. But since GOOG doesn’t pay dividends, the only way to make money is by selling it to other investor at a higher price. But that investor is buying that stock from the first to also make money, by selling it to others at a higher price. And if everyone is buying GOOG stock to sell it to someone else at a higher price, then what real value GOOG stocks have?\n\nIf you come to Alphabet Inc, and show them your 1700$ stock and told them to repay it, they will pay you 0.001$ US Dollars.\n\nSo the only way you can make money, is by taking money generated by new investors.\n\nDefinition of a Ponzi Scheme: “A Ponzi scheme is a fraudulent investing scam which generates returns for earlier investors with money taken from later investors. Ponzi schemes eventually bottom out when the flood of new investors dries up and there isn't enough money to go around. At that point, the schemes unravel.” So if GOOG is a ponzi scheme, when do investors dry up and the scheme is unraveled like other Ponzi schemes? The unraveling gets hidden, because It is masked as a bubble burst.\n\nWhen the new investors stop buying stocks, last investors holding that stock cannot sell them at a higher price and the price of the stock crushes, we call it a bubble burst.\n\nIf GOOG doesn’t give any money to its investors, and only source of money for investors are new investors, than it’s a zero sum game. Like a gambling game with other people, but with fees attached to be able to play at a casino, in this case Google.\n\nBut it isn’t advertised as a gambling, GOOG is advertised as an investment by Alphabet, making clueless investors buy GOOG stocks, not knowing that its just a zero sum gambling. This is at the edge of criminality. I don’t even know how is it legal.\n\nThe simple truth is, GOOG is a Ponzi scheme, being advertised as an investment, when in reality it’s a zero-sum gambling game where the winners are those who sell them first before others, and if everyone knew that it was a zero sum gambling, GOOG stock price would crush right now and no one would want to buy it anymore. This is outrageous.\n\nPosition $TSLA 2/19 $1000C"
  },
  {
   "Title": "I thought $TSLAs chart looked familiar",
   "#Comments": 68,
   "Score": 7,
   "Symbols": [
    "$TSLAs"
   ],
   "Selftext": "Some people need a serious reality check. This shit is ridiculous. The EV market is shockingly similar to the dot com bubble and its not even like people arent aware, its just that everyone thinks they will be able to sell their shares to some idiot at a higher price which has been true thus far, but that second people stop believing that we are in trouble.\n\nI can already see people saying \"how did we not see that coming\", the writing is on the walls. Countless IPOs/SPACs with companies WITH NO REVENUE. Imagine 2 years ago, if a company with no revenue went public people would laugh. Now people will pay ridiculous amounts for QS, a company with NO REVENUE FOR 6 \\*\\*\\*\\*\\*\\* YEARS.\n\nCompanies jumping 10+% just because they announce they will be apart of the EV market. \n\nMaybe im just not chad enough, but I can no longer stay on this ride with you all. I wish you all the best.\n\n&amp;#x200B;\n\n[$CSCO ](https://preview.redd.it/i0ylfgd0d6a61.png?width=1216&amp;format=png&amp;auto=webp&amp;s=c5bcd1bb9d19a84966bd834a0f17c6e8e3c43201)\n\n&amp;#x200B;\n\n[$TSLA](https://preview.redd.it/ax937boje6a61.png?width=1260&amp;format=png&amp;auto=webp&amp;s=12745cce4783133a9981159ade6206625147235d)"
  },
  {
   "Title": "Im long on degenerate gambling $CBOE",
   "#Comments": 6,
   "Score": 5,
   "Symbols": [
    "$CBOE"
   ],
   "Selftext": "More and more retards have joined our ranks during 2020 with over a million new subscribers on this subreddit just this year alone. And what do we all have in common? Degenerate options gambling habbits. Which is why im long CBOE as of just now because every retard in reddit, tiktok, preschool, nursing homes are playing god damm options. You know those small few cent regulatory fees that you have to pay even on \"free\" brokers when you play options? Who do you think gets that shit, thats right its CBOE, the Chicago Board of Options Exchange. \n\nTo be more specific,  CBOE generates a majority of its money through transaction fees. 76% of their revenue is based on their exclusive license agreements regarding S&amp;P 500 Index options (42%) and volatility-based options and futures (36%). And with daily volume in single-stock options averaging17.3 million contracts during 2020, up 68% from 2019, CBOE WILL BE SWIMMING IN MONEY. \n\nIn fact their Q1 revenue jumped by 300 million from Q4 2019, due to the popularity of VIX and associated derivatives during the crash, but have since fallen off as the market recovered and these products were used less. Personally I bought 105 calls expiring after earnings to take advantage of the IV hike that happens before earnings. I dont plan on holding through earnings doe. \n\nTLDR: Retard like option, CBOE make option, CBOE MOON 🚀  🚀  🚀  🚀"
  },
  {
   "Title": "Leverage is infinite money cheat",
   "#Comments": 34,
   "Score": 6,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "TLDR: When everyone is on &gt;1x leverage, and leverages up on every stock going up, we have infinite demand for a stock.\n\n&amp;#x200B;\n\nFor those who did not understand right away:\n\n  1. let's say we all buy $TSLA on 3x leverage.\n\n  2. $TSLA goes up 2% tomorrow.\n\nWhich means we have more buying power (remember, 3x leverage)\n\n  3.  we use the new 4% of buying power to buy more tesla stock. This promts it to go up another x%. \n\nRepeat from step 1"
  },
  {
   "Title": "There are always signs of a bubble",
   "#Comments": 24,
   "Score": 5,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "Disclaimer: I am not a financial analyst, I am however autistic and YOLOed my life savings on bear contracts today.\n\nThe stock markets are at an all time high after the worst year of recent human history. Take profits while you can, don't wait until the non-autists wakes up from their hibernation to do what bears do again. $TSLA is high, not because it should be, but because the previous bears had to close positions at unfortunate times. Michael Burry sees that there is a bubble, the question that remains is when.\n\nThese are just my autistic thoughts, do whatever you please."
  },
  {
   "Title": "I'm getting the fuck out",
   "#Comments": 431,
   "Score": 8,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "I'm a $TSLA moonboi through and through. Papi Musk has been my sweet provider of tendies over the last two years, so it's with a heavy heart that I sell the rest of my shares. I've been slowly offloading as we've been making this retard-fueled run-up, but I think the piper is going to come to collect, this company simply can't be worth one trillion dollars when I still get excited to see the rare model 3 on the road. It makes no goddamn sense.\n\nI still think TSLA has and will continue to change the world, but with a valuation of 859.9B when companies like Facebook that basically print money are only worth 756.96B it's time for me to cash the fuck out.\n\nI'll probably try shorting this bitch from here, I'd love to buy back in around the $400 levels."
  },
  {
   "Title": "PLTR flash sale!",
   "#Comments": 40,
   "Score": 5,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "$PLTR is now on sale for the low price of 24.80 a share! This sale is for a limited time only and will not print as many trendies if purchased at a later date (Daddy Karp does not condone yolo’ing your life savings into this stock and takes no responsibility if you do so). Now is the time boys and girls, let’s show them the power of WSB and let’s get rich together! $300 price target at the end of 2022!\n\nTLDR: buy PLTR because it goes 🚀🚀🚀"
  },
  {
   "Title": "$GLD hits new low today!",
   "#Comments": 52,
   "Score": 2,
   "Symbols": [
    "$GLD"
   ],
   "Selftext": "Alright retards, listen up. GLD is currently sitting in a slump after its most recent rebound from rock bottom at around $162. It charged back up to ~$183 before dropping to its current low of ~$172. I believe now is the time to buy calls and shares because if you look at the historical charts, this baby only heads one direction, up! I also do not foresee a future where rappers and celebrities ice themselves out in anything but this sweet, yellowish substitute for money. Anyways, I see this rebounding in the next week before hitting new highs at the end of the month.\n\nPositions:\n100 shares @ 172.13\n5x 174 calls 1/29\n\nTldr: GLD goes 🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$GME Gang - Ryan Cohen Could Be Attending the ICR Next Week!",
   "#Comments": 164,
   "Score": 9,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "We might be hearing for the first time directly from Ryan Cohen next week during Gamestop's QA session.\n\nHe qualifies as an Interactive registree - [https://icr.swoogo.com/icrconference2021/begin?reg\\_type\\_id=103832](https://icr.swoogo.com/icrconference2021/begin?reg_type_id=103832)\n\nCan't stop, won't stop, Gamestop!\n\nhttps://preview.redd.it/ssju0f9b85a61.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=6221e0376bf014fe90f5348cbd52986cb0b026df"
  },
  {
   "Title": "$CRON to the moon!",
   "#Comments": 8,
   "Score": 1,
   "Symbols": [
    "$CRON"
   ],
   "Selftext": "Stoned Bull here.\n\nBiden administration will be opening the flood gates for pot stocks this year.\n\nCRON has a strong balance sheet and a very efficient/effective operation leading me to believe it's under priced. This stock was over $20 with a republican administration and I think this year it's going to break through that.\n\nOne way to cool the temperatures in the country is to get everyone high!\n\n60X 2/26 $11c"
  },
  {
   "Title": "All You Retards Talking About NYSE Threshold Securities for $GME",
   "#Comments": 40,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "I was reading up on rules and regulations on [https://www.sec.gov/investor/pubs/regsho.htm](https://www.sec.gov/investor/pubs/regsho.htm)\n\n**5. After adoption of Rule 204, why are there still threshold securities and why is there still a threshold securities close-out requirement?**\n\n**Even after adoption of Rule 204, failures to deliver may occur in certain circumstances. The appearance of a security on a threshold list does not necessarily mean that there has been abusive “naked” short selling or any impermissible trading in the stock. Delivery failures can be caused by both long and short sales. In addition, notwithstanding actions by broker-dealers to close out delivery failures, certain securities may remain on an SRO’s**[**\\[17\\]**](https://www.sec.gov/investor/pubs/regsho.htm#_ftn17) **threshold securities list for a variety of legitimate reasons, such as:**\n\n* **Despite proper action to close out fails, new delivery failures from long or short sales, at the same or other broker-dealers, result in the security staying on the threshold list;**\n* **One or more broker-dealers may have temporary but legitimate problems in obtaining the stock they borrowed in time for delivery;**\n* **Long sellers may have difficulty in producing stock in good deliverable form to their broker-dealer.**\n\nYou retards need to read. Being on NYSE Threshold Securities for consecutive days doesn't mean they're doing an illegal short selling of a stock. It could mean that there could be a failure to deliver at the same or other broker-dealers."
  },
  {
   "Title": "Papa John's $PZZA - Make money, help franchise owners, and give Papa his company back",
   "#Comments": 23,
   "Score": 2,
   "Symbols": [
    "$PZZA"
   ],
   "Selftext": "First, to reduce any confusion, the company will be referred to as Papa John's and the person will be referred to as Schnatter.\n\nI was joking about the idea to take over Papa John's with some of my friends yesterday to get Schnatter back in control of his company, and when I started doing my research I actually liked what I saw purely from an investment standpoint. This post will have two main parts: how we can get Schnatter his job back and also how we can easily make money on PZZA. We'll do the money stuff first.\n\n&amp;#x200B;\n\n**Chart**\n\nAs of writing this, PZZA is currently trading at $94.10 and the ATH is $102.25. It is basically guaranteed that it will go back to the ATH. It has also sailed past the 20 and 10 day moving average, so there is no resistance until ATH. This is great for options.\n\nhttps://preview.redd.it/s6klbqs2u4a61.png?width=920&amp;format=png&amp;auto=webp&amp;s=a797b3678678bd167818ee455dcde4d49f6e4512\n\n&amp;#x200B;\n\nIn addition, I suspect that PZZA could be forming a cup and handle pattern. If this plays out, the price target would be (ATH + (ATH - Bottom of Cup)), which is about $131.38. However, we won't know if this is a cup and handle until it happens.\n\nhttps://preview.redd.it/umhvpr1ou4a61.png?width=1140&amp;format=png&amp;auto=webp&amp;s=b468ffd791469758f0679d390c4b6d72cad01a35\n\nEven if the pattern fails, a delivery pizza restaurant is a pretty safe place for your money to be during the pandemic.\n\n&amp;#x200B;\n\n**Other Numbers**\n\n[Target price](https://www.wsj.com/market-data/quotes/PZZA/research-ratings) of $104.50 with a high of $116.00. I think this is low going off the chart.\n\n[31 million shares](https://finviz.com/quote.ashx?t=pzza) float. I know that's a lot, but Schnatter already owns almost [1.3 million shares](https://ir.papajohns.com/stock-information/ownership-profile).\n\nGuys, it's take out pizza in a pandemic it should really be self explanatory.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNow we can talk about how Schnatter can become reinvolved with the company, which should help PZZA stock even more. As you will see, ever since he left the company has not been in as good of a position.\n\n**Why Schnatter Left**\n\nIn 2017, he made a controversial comment about how the [NFL player protests were hurting Papa John's sales](https://www.npr.org/sections/thetwo-way/2017/12/22/572779230/papa-johns-ceo-steps-down-following-controversial-remarks-on-nfl) because they were the official pizza sponsor of the NFL. I don't want this to get political, but this is essential to talk about. Schnatter stepped down as CEO but remained on the board of directors. Fast forward into 2018, where Schnatter was reported to have [used a racial slur](https://www.forbes.com/sites/noahkirsch/2018/07/11/papa-johns-founder-john-schnatter-allegedly-used-n-word-on-conference-call/?sh=376e4e6e4cfc) in a meeting and it was recorded. Then, he stepped down from his position and no longer had a role in the company (besides for shareholder).\n\n&amp;#x200B;\n\n**Schnatter's Fight for Innocence**\n\nEver since both of these allegations have surfaced, Schnatter has maintained his innocence and that his words were taken out of context. In a [recent interview](https://www.youtube.com/watch?v=1lYGrUA6YjA) Schnatter had with the H3 Podcast (I know many people don't care for them, myself included, but those opinions don't change what Schnatter says in the interview) where he explained why both allegations were false. Regarding the NFL drama, Schnatter claims that he was talking about how the NFL had a leadership problem because they were not addressing the issue. [His exact words were,](https://www.foxbusiness.com/retail/ex-fbi-director-clears-papa-johns-founder-of-racial-bias-slams-clearly-inaccurate-media) \"*The NFL is hurting, and more importantly by not resolving the current debacle to the player and owner’s satisfaction, NFL leadership has hurt Papa John’s shareholders.\"* In regards to the allegations of him using a racial slur, former FBI director Louis Freeh, wrote a [report](https://papajohnschnatter.report/read-the-report) where he explains how that in the phone call where he used a slur, he many times stated how he does not support any form of racism, and when he said the word, he was referring to how Colonel Sanders used it and it bothered him. There are two parts to the recording that Schnatter has been fighting in court to get released. The first part includes him using the slur and the context, and the second part includes the other people on the call celebrating after Schnatter hung up talking about how \"they got him\" and they needed to get it to the press right away. This is all according to the H3 interview. It is common sense that Schnatter would not want a recording made public that would damage him, and the company seems intent on keeping it secret, showing that they are likely hiding something.\n\n&amp;#x200B;\n\n**Sales are Slumping**\n\n[Sales are decreasing](https://www.statista.com/statistics/221441/papa-johns-total-revenue/#:~:text=Revenue%20of%20Papa%20John's%20worldwide%202007%2D2019&amp;text=American%20pizza%20restaurant%20franchise%20Papa,seeing%20a%20decline%20in%20revenue) every year since his role as been minimized. It's as simple as that. They are in no way a failing company, they are just making less money than they were.\n\n*Processing img 934fvr5jq4a61...*\n\nIn addition to slumping sales, in the [H3 interview](https://www.youtube.com/watch?v=1lYGrUA6YjA), Schnatter claims that Papa John's total number of customers is down significantly and that the quality has decreased. He says he buys about 600 pizzas every 90 days from stores around the country to check on the quality. In my personal experience, I can say the quality at my local Papa John's has decreased over the past couple years.\n\n&amp;#x200B;\n\n**Why Schnatter Can Fix This**\n\nSchnatter is more devoted to Papa John's than most CEOs (after Karp and Elon), even though he technically doesn't work for them anymore. As I said before, he does frequent quality checks on the restaurants. The reason he does is is because he cares about the franchise owners and employees who have been negatively impacted by the new management and slumping sales. Who else still puts effort into a company after they've been fired from it? Also, this is just speculation, but since he is still closely associated with the company it is still his reputation.\n\n&amp;#x200B;\n\n**What we can do**\n\nIt's simple, buy shares! If we buy enough shares of PZZA, we (along with Schnatter) can become the majority shareholder of the company. There are [just over 31 million shares float](https://finviz.com/quote.ashx?t=pzza) and Schnatter still owns almost [1.3 million shares](https://ir.papajohns.com/stock-information/ownership-profile), or 3.88% of the company. If he can convince a few of the other large investors that it is in their best interest to see him in charge again, we can easily call a shareholder meeting, vote out those who wrongly accused him, and put him, back in charge.\n\n&amp;#x200B;\n\n**Historical Implications**\n\nSchnatter has long been touting \"The Day of Reckoning\" but has not given any hints as to if it has already happened, if it is multiple events, or what it will be specifically. If we can accomplish this, WSB would go down in history (it already has) again for giving a man his company back... and we will make money in the process. We can be the day of reckoning!\n\n&amp;#x200B;\n\n**Is This Legal?**\n\nYes, it is perfectly legal. This would technically be a hostile takeover, which is legal, but we can just call it something else. Besides, I'm pretty sure Ryan Cohen is trying to do the same thing with Game Stop.\n\n&amp;#x200B;\n\n**TLDR**\n\nPZZA chart shows easy money, Schnatter is innocent of accusations, only he can bring Papa John's back to its former glory, and we can be the ones to do that. The Day of Reckoning is here!\n\n&amp;#x200B;\n\nPZZA PLTR GME SPCE ICLN TSLA 🚀🚀🚀\n\n&amp;#x200B;\n\nAlso if I misspelled \"Schnatter\" anywhere I'm sorry."
  },
  {
   "Title": "Steel Stock Updates $X $CLF $CMC",
   "#Comments": 402,
   "Score": 1,
   "Symbols": [
    "$CMC",
    "$CLF",
    "$X",
    "$STLD"
   ],
   "Selftext": "CFRA MAINTAINS STRONG BUY OPINION ON SHARES OF CLEVELAND-CLIFFS INC.\n\nWe increase our 12-month target price by $8 to $22, which assumes CLF will tradeat an EV/EBITDA multiple of 9.0x our '21 EBITDA estimate, a premium to CLF'sthree-year average forward EV/EBITDA of 8.0x, which we think is justified by thestrong improvement in domestic steel fundamentals and CLF's businesstransformation via strategic acquisitions. We narrow our '20 loss per shareestimate by $0.10 to $0.19 and increase our '21 EPS estimate by $1.86 to $3.11,as we account for the recent surge in steel prices and CLF closing itsacquisition of ArcelorMittal USA (AM USA). With the integration of AM USA, CLFeffectively increases its iron ore pellet supply capacity from 20 million tonnesto 28 million tonnes and increases intercompany sales of pellets from 45% to90%. The two acquisitions of CLF's largest customers (AK Steel and AM USA)should lower the volatility of CLF's earnings and, more importantly, CLF hasbecome a powerhouse in the domestic steel industry, one that is over-indexed to automotive\n\n2021-01-08 13:13:00 GMT DJ US Steel Price Target Announced at $28.00/Share by Deutsche bank\n\n2021-01-08 13:02:00 GMT DJ Commercial Metals Price Target Announced at $22.00/Share by Deutsche bank\n\n$MT, $VALE, $CMC, $STLD\n\nHang in there. \n\nIt got hotter faster than expected and pullbacks are healthy. \n\nBuying started coming in on the beaten down stocks today. \n\nThis is a GOLDEN OPPORTUNITY TO COST AVERAGE. \n\nEveryone that keeps asking “when is a good entry point?”\n\nNOW\n\nOn all steel stocks that are down today. \n\nBuy the dip. \n\nYou will thank yourself later. \n\nRising tides lift all boats and we are closing in on 2008 levels as said by Schnitzer yesterday. \n\nAlso, remember it’s Friday and we have had a barn burner week. \n\nThere will be profit takers. \n\nMany thought I was full of shit for a couple weeks. \n\nThen the wave came. \n\nThis is the wave ebbing back before another larger one. \n\nStay 🦾\n\nVito"
  },
  {
   "Title": "$MT is not getting delisted, just getting taken off of RH",
   "#Comments": 69,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "Okay so I think people are freaking out like crazy over this shit. It should already be known that RH looks nice as fuck, but it is a complete piece of shit when compared to other brokerages. $MT is getting taken off of RH, so you can't buy it anymore from 1/11/20. BUT, if you bought before that date, you can still sell them. $MT IS NOT GETTING DELISTED which is what I feel like some people think this is. Stop being a paper handed pussy. You can still buy it on any other brokerage. $MT TO THE MOON \n\nPerfect opportunity as Vito has stated to buy in if you haven't done so already.\n\nPRAISE OUR LORD AND SAVIOR VITO\n\nPositions: April 27C"
  },
  {
   "Title": "Free Tendies By Buying Chamath's SPACs ($IPOD, $IPOE, $IPOF)",
   "#Comments": 4,
   "Score": 1,
   "Symbols": [
    "$IPOA",
    "$IPOC",
    "$IPOB",
    "$IPOF",
    "$IPOD",
    "$IPOE"
   ],
   "Selftext": "Here's how you can make free tendies only limited to how much you want to put in:\n\n2020 was the year of SPACs. If you don't know what a SPAC is, it's basically a blank-check company that allows a sponsor/manager to go and merge with a private company and therefore make them public. Once the target is announced, there is a pop in price because people rush into the SPAC (in some cases, rush out if the target seems shitty). \n\nNow, here's how to make the tendies. Chamath Palihapitiya is the king of the SPAC. If you need proof, look at his track record. $IPOA today is $SPCE. $IPOB today is $OPEN. $IPOC is becoming $CLOV. $IPOD is not announced yet, $IPOE was announced yesterday (becoming SoFi), and $IPOF is not announced yet either. Go look at the track record. It's flawless. Every one of the announced SPACs is up over 100%. $IPOD and $IPOF are not even announced yet, and they're up a lot already. \n\nChamath's plan is to create 26 SPACs, $IPOA-$IPOZ. This is the best part. You can just buy into the SPAC and sell on the pop of the announcement, or if you believe in the SPAC, you can hold it. This man creates diamonds from anything he touches. \n\nMake him your dad just like I did. You won't regret it. Go get those free tendies lads."
  },
  {
   "Title": "Alcoholic weapons &amp; $SAM Spreads",
   "#Comments": 15,
   "Score": 1,
   "Symbols": [
    "$SAM"
   ],
   "Selftext": "good fuckin MORNING to all you glass brains out there, how we doin?  We eatin fresh warm tendies with elon after yesterday?  Or are we fomo'ing in and out of palantir putting bulletholes in our portfolios?\n\nRegardless, i dont think i saw enough appreciation for the fact that the richest individual currently living priced one of his EV models for ***exactly*** $69,420.  What a time to be alive.  The torch has been fucking PASSED!  And to who, but our leader?  C'mon boys, we can pump it a little more for celebratory purposes and get Elon to 200B for a day.\n\nLet's get down to business; it's time to get stupid wasted off twea's and truly's like our wives to cope with our losses.  Instead of buying that FD for Tesla next week, get one on Apple instead &amp; spend the rest on a few cases of booze to drink while apple fucks you and then goes up 10 points.\n\nThe viral video of loser white guy getting fatality'd with a can of tea sent shockwaves through the meme community.  Saw a string of videos on tiktok of people dramatically opening a briefcase and pulling out a twisted tea like they're boutta air out the scene with a glizzy.  And that was just **ONE** of the chain of free advertising videos, made sometimes and reposted often by kids who *didn't/can't/don't* even drink TT or alcohol.  That girl on Twitter has posted multiple times about how this event already is and will continue to affect her work schedule for the coming month.\n\nAlllll kinds of search trends exploded for \"Twisted Tea\" and \"Sam Adams\".  Someone posted a week or so ago with screenshots of different explosive search trends, tried finding that post and their account but failed at both (like most things in life).  EDIT—u/Altruistic_report105 posted it 3 days ago, fuckin go nuts n look at the good data he posted.\n\nNot to mention the fact that Sam Adams is a high volume stock, trading healthily at almost exactly a grand a share, and they **fucking murdered** their last two earnings.  They crushed 2019 in sales &amp; are currently set up by meme power and alcoholics normalizing their problems to kill another earnings report, coming 2/17 after hours.  \n\nWhy is the meme power so important?  Why is this sudden late boost in sales so important?\n\n**Because the dusty old millionaire shareholders aren't on social media and have no clue about the true potential because they play sudoku on paper and thus aren't pricing in the coming action.**\n\nI'm not saying that Sam Adam's doing good is gonna be news to them; but every single time the big dollars are aware of a catalyst and possible positive price action change backed by a strong financial quarter, they price that in for options and then our lottery calls are too expensive and risky to play.\n\nEnough bullshit, lets get down to it.  Before i open my positions, im gonna try and grab some extra money quick trading NIO calls as NIO Day is saturday and should give a small run up friday.\n\nHere are my positions; starting off by selling a short spread, taking the credit, and doubling it down into 2 poor mans calls.  If your primary language is retard i can translate---Me sell shit position and buy 2 good ones!\n\n\\-1 $SAM 2/19 1050p, +1 $SAM 2/19 1040p\n\n\\-1 $SAM 2/19 1050c,  +1 $SAM 2/19 1040c    x2\n\nGonna be in it for about a grand, and out for 2 in profits for a total of 3.\n\n5% over the next 5 weeks with a strong catalyst backing it should be an easy task for the big dog to pull off &amp; it will be just in time to make my annual car payment on the 21st ;) wish a fellow retard some luck and drink some tea's for me!"
  },
  {
   "Title": "Alcoholic Weapons &amp; $SAM Spreads",
   "#Comments": 3,
   "Score": 1,
   "Symbols": [
    "$SAM"
   ],
   "Selftext": "good fuckin MORNING to all you glass brains out there, how we doin?  We eatin fresh warm tendies with elon after yesterday?  Or are we fomo'ing in and out of palantir putting bulletholes in our portfolios?\n\nRegardless, i dont think i saw enough appreciation for the fact that the richest individual currently living priced one of his EV models for ***exactly*** $69,420.  What a time to be alive.  The torch has been fucking PASSED!  And to who, but our leader?  C'mon boys, we can pump it a little more for celebratory purposes and get Elon to 200B for a day.\n\nLet's get down to business; it's time to get stupid wasted off twea's and truly's like our wives to cope with our losses.  Instead of buying that FD for Tesla next week, get one on Apple instead &amp; spend the rest on a few cases of booze to drink while apple fucks you and then goes up 10 points.\n\nThe viral video of loser white guy getting fatality'd with a can of tea sent shockwaves through the meme community.  Saw a string of videos on tiktok of people dramatically opening a briefcase and pulling out a twisted tea like they're boutta air out the scene with a glizzy.  And that was just **ONE** of the chain of free advertising videos, made sometimes and reposted often by kids who *didn't/can't/don't* even drink TT or alcohol.\n\nAlllll kinds of search trends exploded for \"Twisted Tea\" and \"Sam Adams\".  Someone posted a week or so ago with screenshots of different explosive search trends, tried finding that post and their account but failed at both (like most things in life).\n\nNot to mention the fact that Sam Adams is a high volume stock, trading healthily at almost exactly a grand a share, and they **fucking murdered** their last two earnings.  They crushed 2019 in sales &amp; are currently set up by meme power and alcoholics normalizing their problems to kill another earnings report, coming 2/17 after hours.\n\nWhy is the meme power so important?  Why is this sudden late boost in sales so important?\n\n**Because the dusty old millionaire shareholders aren't on social media and have no clue about the true potential because they play sudoku on paper and thus aren't pricing in the coming action.**\n\nI'm not saying that Sam Adam's doing good is gonna be news to them; but every single time the big dollars are aware of a catalyst and possible positive price action change backed by a strong financial quarter, they price that in for options and then our lottery calls are too expensive and risky to play.\n\nEnough bullshit, lets get down to it.  Before i open my positions, im gonna try and grab some extra money quick trading NIO calls as NIO Day is saturday and should give a small run up friday.\n\nHere are my positions; starting off by selling a short spread, taking the credit, and doubling it down into 2 poor mans calls.  If your primary language is retard i can translate---Me sell shit position and buy 2 good ones!\n\n\\-1 $SAM 2/19 1050p, +1 $SAM 2/19 1040p\n\n\\-2 $SAM 2/19 1050c,  +2 $SAM 2/19 1040c\n\nGonna be in it for about a grand, and out for 2 in profits for a total of 3.\n\n5% over the next 5 weeks with a strong catalyst backing it should be an easy task for the big dog to pull off &amp; it will be just in time to make my annual car payment on the 21st ;) wish a fellow retard some luck and drink some tea's for me!"
  },
  {
   "Title": "Alcoholic Weapons &amp; $SAM plays",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$SAM"
   ],
   "Selftext": "good fuckin MORNING to all you glass brains out there, how we doin?  We eatin fresh warm tendies with elon after yesterday?  Or are we fomo'ing in and out of palantir putting bulletholes in our portfolios?\n\nRegardless, i dont think i saw enough appreciation for the fact that the richest individual currently living priced one of his EV models for ***exactly*** $69,420.  What a time to be alive.  The torch has been fucking PASSED!  And to who, but our leader?  C'mon boys, we can pump it a little more for celebratory purposes and get Elon to 200B for a day.\n\nLet's get down to business; it's time to get stupid wasted off twea's and truly's like our wives to cope with our losses.  Instead of buying that FD for Tesla next week, get one on Apple instead &amp; spend the rest on a few cases of booze to drink while apple fucks you and then goes up 10 points.\n\nThe viral video of loser white guy getting fatality'd with a can of tea sent shockwaves through the meme community.  Saw a string of videos on tiktok of people dramatically opening a briefcase and pulling out a twisted tea like they're boutta air out the scene with a glizzy.  And that was just **ONE** of the chain of free advertising videos, made sometimes and reposted often by kids who *didn't/can't/don't* even drink TT or alcohol.  \n\nAlllll kinds of search trends exploded for \"Twisted Tea\" and \"Sam Adams\".  Someone posted a week or so ago with screenshots of different explosive search trends, tried finding that post and their account but failed at both (like most things in life).  \n\nNot to mention the fact that Sam Adams is a high volume stock, trading healthily at almost exactly a grand a share, and they **fucking murdered** their last two earnings.  They crushed 2019 in sales &amp; are currently set up by meme power and alcoholics normalizing their problems to kill another earnings report, coming 2/17 after hours.  \n\nWhy is the meme power so important?  Why is this sudden late boost in sales so important? \n\n**Because the dusty old millionaire shareholders aren't on social media and have no clue about the true potential because they play sudoku on paper and thus aren't pricing in the coming action.**\n\nI'm not saying that Sam Adam's doing good is gonna be news to them; but every single time the big dollars are aware of a catalyst and possible positive price action change backed by a strong financial quarter, they price that in for options and then our lottery calls are too expensive and risky to play.  \n\nEnough bullshit, lets get down to it.  Before i open my positions, im gonna try and grab some extra money quick trading NIO calls as NIO Day is saturday and should give a small run up friday.\n\nHere are my positions; starting off by selling a short spread, taking the credit, and doubling it down into 2 poor mans calls.  If your primary language is retard i can translate---Me sell shit position and buy 2 good ones!\n\n\\-1 $SAM 2/19 1050p, +1 $SAM 2/19 1040p      \n\n\\-2 $SAM 2/19 1050c,  +2 $SAM 2/19 1040c\n\nGonna be in it for about a grand, and out for 2 in profits for a total of 3.  \n\n5% over the next 5 weeks with a strong catalyst backing it should be an easy task for the big dog to pull off &amp; it will be just in time to make my annual car payment on the 21st ;) wish a fellow retard some luck and drink some tea's for me!"
  },
  {
   "Title": "$VALE - Iron ore price is going up from here",
   "#Comments": 44,
   "Score": 1,
   "Symbols": [
    "$VALE"
   ],
   "Selftext": "I'll keep this short:\n\n[Why iron-ore prices are pinching: Prices to remain high in the near term](https://www.financialexpress.com/opinion/why-iron-ore-prices-are-pinching-prices-to-remain-high-in-the-near-term/2166641/)\n\nThe  Indian Steel Association (ISA) calls for a 6 month ban on iron ore exports. India is the fourth largest iron ore producer in the world. [Source](https://www.nsenergybusiness.com/features/top-iron-ore-producing-countries/#:~:text=Global%20iron%20ore%20production%20jumped,0.5%25%20for%20the%20following%20decade)\n\nThis is just the latest showcase of the massive iron ore shortage the world is facing in the wake of the pandemic. Governments everywhere announced/will announce massive infrastructure plans to spur on the economy.\n\nWith India possibly out of exporting, iron ore prices can only go up, meaning other iron ore producers are set to profit massively. The last time iron ore prices where this high VALE was at almost $40 (+100% upside from today)\n\n&amp;#x200B;\n\n*Processing img nez2vlopq2a61...*\n\n&amp;#x200B;\n\nVALE is also fundamentally undervalued compared to its competitors, other miners are trading at 2X the EPS of VALE, again confirming our price target of high 30's. The reason VALE stock price is suppressed is an accident last year at one of their dams. VALE is still negotiating a deal with the Brazilian government but expectations are that this will be behind them soon. [VALE Deal](https://finance.yahoo.com/news/brazil-state-eyes-least-5-184547767.html).\n\n&amp;#x200B;\n\nPositions: APR 16 '21 $20 &amp; $21 CALL"
  },
  {
   "Title": "Can it grow?? $NGA",
   "#Comments": 22,
   "Score": 1,
   "Symbols": [
    "$NGA"
   ],
   "Selftext": "Ive put about 5k down into this stock when it was at $15 and now its at $23 ive done some DD and i really liked this stock. They also just announced a partnership with amazon so that could be big yall think so??"
  },
  {
   "Title": "It's a Boomer play but it's absolutely guaranteed to print: $PRYMY (Prysmian Group), a play on upcoming infrastructure/grid upgrades",
   "#Comments": 118,
   "Score": 3,
   "Symbols": [
    "$PRYMY",
    "$GE"
   ],
   "Selftext": "I am amending my post two weeks advocating for $GE leaps in order to take advantage of upcoming electrical grid upgrades. I talked to a ton of people, spent two weeks doing nonstop reading, am **narrowing the play to the Prysmian Group ($PRYMY, an ADR**). Please see an amended DD below. **This DD isn't TA.** It is a series of political, market, and energy trend facts/assumptions, within the technical realities of grid management. \n\n* **WARNING**: this post is long. By necessity, one has to flesh out linear chains of reasoning in long form. I'll give you the one-paragraph **TLDR** at the end. No rockets. \n* **Context:** This is a 10 bagger play but it'll take time, possibly 2-3 years. There aren't any options available for this. Prysmian is guaranteed to print, but slowly, but it is literally guaranteed to print. It think it'll double by EOY at least. \n\n&amp;#x200B;\n\n\\---------------------------------------------------------------------------------\n\n&amp;#x200B;\n\nBelow is a series of **linear** chain of reasoning with known facts that lead to an outcome that is guaranteed but not priced in. The market isn't carrying the implications of known-trends to their logical conclusion (the material provider--Prysmian) and is currently undervaluing Prysmian Group. Imagine this as a chain of dominos. I will lay each one down consecutively, showing a near-future reality in which a company is set to quintuple if not 10x it's revenue over the next 10 years. \n\n&amp;#x200B;\n\n1. **EVs are going to see mass adoption**. Every automaker + Apple is trying to get in on this. BEV advantages are simply too great. It is highly likely that by 2025, 25-35% or more of new car sales will be electric. This will only continue to 2030. The average car life is [12 years](https://www.aarp.org/auto/trends-lifestyle/info-2018/how-long-do-cars-last.html#:~:text=A%20typical%20passenger%20car%20should,Lyman%2C%20chief%20analyst%20at%20TrueCar). It is likely that by 2033-2035, a majority of U.S cars are electric. \n2. **This will cause big increases in demand on the grid**. [This](https://www.energy.gov/sites/prod/files/2019/12/f69/GITT%20ISATT%20EVs%20at%20Scale%20Grid%20Summary%20Report%20FINAL%20Nov2019.pdf) **is a fantastic read--the \"high\" (EV adoption) scenario doesn't show 90% EVs till 2040...which smaller than what is currently happening with new EV models / State/Country bans on ICE vehicles**. The average American home uses \\~33 kWh of energy per day. I own a model 3 (75kWh battery), BARELY drive (no commute) and still charge 6-7 times a month (from 20% to 80%), averaging around 13 kWh per day.  A commuter may use around 30-35 kWh per day just to drive, especially when heating the car. **For a non-commuter thats a 30-40% increase, for a daily commuter that's almost a 100% increase.** By 2025, if \\~30% of the U.S. fleet is electric, that'll cause a significant increase in grid demand. More important, though, is that energy generation planning, permitting, and construction takes a long time. They have to front run this big time because generation facilities (wind/solar) take time to plan, permit, build, and hook-in (HVDC). We're already seeing an absolute renaissance in wind and its only going to keep accelerating along with the EV adoption curve. \n   1. (2B) Additionally, there are other factors behind growing grid demand: California is considering banning gas heating in new homes (Electric heating and anti-gas legislation will increase electric demand for thermal units), an increased interest in hydrogen (via electrosis, for aviation / industry)\n   2. (2C) Some people think that added capacity will be curtailed because everyone will charge at night where there is bandwidth for capacity boosts from existing generation facilities. **These people are wrong**. While night-charging will *assuage* total added generation capacity requirements, there isn't enough current night (natural gas) generation capacity to meet the demand of 40-50% EVs, and (see below) its unlikely Natural Gas is gonna keep as fast as it has been, for political reasons. Additionally (1) Not everyone is going to have home charging (apartment buildings, street parking rowhomes) and thus will supercharge at work/while commuting, (2) many people aren't that disciplined to save $3-4 on a charge, (3) people will live their lives normally--charging when they need, often during the day. **A ton of added capacity is needed.** \n3. **Added capacity is likely to be green**. As of yesterday, /r/Energy had an [article](https://renewablesnow.com/news/renewables-make-71-of-new-us-power-capacity-in-11-mo-2020-727014/) showing how 71% of the added energy (8000mW wind, 6500mW solar) capacity in 2020 was renewables. This phenomenon has two causes. **(1)** Finance: Coal isn't cost competitive with solar and wind anymore. Solar is getting very, very cheap and more and more efficient. Offshore wind is having a renaissance. Nuclear is greener, but more expensive (\\~$4,200 per kW), and NIMBYism will prevail. Solar/wind is FAR cheaper than $4,200 per kW right now. Banks are scared of liberals: Alaskan oil can't even get bank financing now (Just this week, Trump opened up those Alaskan areas for bidding and nobody bidded, literally), and Coal isn't expanding. People see the end of oil (and, honestly, nuclear) is near. **(2)** Politics. Dem administration for the next 4 years, and green energy isn't the political football it was 10 years ago. Fighting renewables isn't the focus of the right anymore. Additionally, Democrats resist natural gas expansion (as noted above). Natural gas isn't that green (big methane problems) and while it's cheap af, its not everywhere (pipeline limits), and I deem it unlikely that population centers (NE Corridor, Cali, Chicago, etc etc), which are ALL liberal, are going to be OK with more and more natural gas plants. I deem it unlikely that we're gonna be a 50%+ natural gas country. Don't believe me? Go read up on California banning natural gas. Yea, Cali can be crazy, but it is almost ALWAYS the harbinger of progressive thinking. Expect that to carry forward. \n4. **Biden will do an infrastructure bill**. This will happen. Its popular, its needed, and its perfect for his huge desire to be seen as a bipartisan president. Its an amazing kick off to his first year in office. He needs to find a way to boost employment before 2022 in order to have a growth-narrative for the midterms. 2022 midterms don't look good for democrats, and if he doesn't have a strong 2021 year (or at least, optically) he'll get lame ducked in 2023-2024. He's not running in 2024, he's too fucking old. So, how does he go into the twilight of his career with the narrative of a 'Unifier'? He does something everyone can get behind: infrastructure. With the recent Trump supporter capital storming, Biden has some great political bandwidth to hit the ground running. \n5. **Biden will try and include moderate green elements in this bill because he knows he won't get green policies otherwise**. Even with the two blue Georgia seats, there is \\*\\*ZERO\\*\\* chance the Dems blow the filibuster. You have (1) a president that won by a narrow margin, that (2) isn't that popular, (3) who has a bad-looking 2022 midterm, that (4) won't run in 2024 cause he's ancient, with (5) a not-too-popular VP, can't afford to run roughshod over norms and weaken their 2022 prospects. No-filibuster 50-50 plus Kamala casting the deciding vote? Please. Not happening. Yet, Biden does need to cater to his liberal supporters and fire up the DNC base in 2022. A great way to get people onboard is to blend an infrastructure bill with elements of the Green New Deal. He has to do this. Its the only way to sneak green policies into implementation to cater to the Left. Standalone 'Green New Deal' isn't happening and McConnell isn't going to let something named that pass, but may let green elements be sluffed into a general infrastructure bill. All this aside, infrastructure is *NEEDED.* Everyone and their mother knows this. It's pushing on an open door, at precisely the right time. \n6. **Green elements in an infrastructure bill will have to benefit Red states** in order to get passed. We're not gonna get a carbon tax / cap and trade system. We're not gonna get massive oil taxes. Yeah, he'll help EV adoption, but that's pretty limited to subsidies (the $7,500 subsidy expansion for Tesla and GM just failed as a line item) and research subsidies. Not good enough for the Left. \n7. **A lot of Red states are RICH in renewables**. Look at the maps below for for U.S. solar and Wind geographic advantages. What do you notice? For the most part, there are huge wind opportunities in the Midwest, Great Lakes, and NE Offshore region. There is huge solar potential across Texas and the South. Outside of California and Northeast Corridor/Great Lakes offshore wind, renewables are concentrated in the Midwest and South. **If you want to do a Green Energy bill that also serves as a bipartisan stimulus, there are geographic comparative advantages that give you a compelling reason to create green energy in Red states.** \n\n[Solar Irradiance Map \\(2018\\)](https://preview.redd.it/uilz3fxoc0a61.jpg?width=5101&amp;format=pjpg&amp;auto=webp&amp;s=25925051c0038ace93d3cd47392b88a231f1af0c)\n\n[Wind Power Map--Note the Great Lakes, Midwest, and NE Corridor Offshore](https://preview.redd.it/dwhto5huc0a61.png?width=1087&amp;format=png&amp;auto=webp&amp;s=7f5b15711a5dbf1ee5454007d153d0504dad168a)\n\n&amp;#x200B;\n\n**However, the Grid currently isn't configured to transport the level of green energy needed to meet the heightened demand environment in 2030-2040. Guess what links huge solar fields and onshore/offshore wind to population centers? HVDC does. The HVDC network to pipe \"local\" (regional) renewable hotspots to population centers doesn't exist. See the below map of the U.S. HVDC Grid, and compare it to Europe and China's:**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/g5cn24w2h0a61.png?width=560&amp;format=png&amp;auto=webp&amp;s=8fcd18d57aea8a5ad24b080d9f5dc6e77e48d34a\n\n&amp;#x200B;\n\n[Note all the Offshore Wind to the North Sea, and the connections between Renewable hot spots \\(Iceland, etc\\) to population centers](https://i.redd.it/hmijqzkxh0a61.gif)\n\n[This won't be surprising. The Chinese do big infrastructure, and half the Party back in the 90s were hydrologic engineers. ](https://preview.redd.it/9ycsi1d5i0a61.jpg?width=1240&amp;format=pjpg&amp;auto=webp&amp;s=fafd25e782fbd27964d1b1f958e80ea46fc855d6)\n\nIn addition to these maps, look at the [**global list of HVDC projects Wikipedia page**](https://en.wikipedia.org/wiki/List_of_HVDC_projects)**. Observe how many are in Asia/Euro vs the U.S.** It's not our fault, in the past grid owners could easily locate generation facilities near enough to minimize high voltage lines. However, things are changing--wind and solar take space, aren't as location-independent as gas/coal/nuclear. \n\n&amp;#x200B;\n\n* (8) **Microgrids won't solve the issue.** Obviously Tesla city-level distributed powerpacks will happen, but this isn't an either-or situation. **The speed of EV adoption and the heightened demand environment are going to vastly outpace the adoption of rooftop solar (what many microgrid proponents suggest can fully-deal with grid demand)**. Grid-level wind/solar is still needed, and those sources need to be connected in, so again, a regionalized HVDC connection system from renewable --&gt; population center is still needed. \n* (9) **The more HVDC connections that are installed, the more compelling it will be to form longer-linkages (more HVDC) between population centers (and therefore, storage).** Connected regional grids (think--Minnesota, Wisconsin, Michigan and Pennsylvania connected mutually via Great Lakes Wind farms that are, in turn, connected to the NE Corridor) marginally decrease the amount of total net storage needed in the system, as \"the wind is always blowing/sun is always shining somewhere\". This process will continue until we eventually have a 'Supergrid'--but NOT one by original purpose--which is what people usually argue against when people mention that word, but convenience--alongside thousands of microgrids. \n   * If this seems extreme to you, sit back, consider the 2nd point of this post, then imagine 80% of Cars are EVs within 15 years. A vast majority of Semi-trucks are electric. Advances in batteries mean that Planes, shipping, and tons of military applications now all use huge amounts of power. Grid demand is way, WAY higher than it was when the biggest demand source were light bulbs and your shitty AC unit. \n* (10) **The way to play this is by going to the manufacturer / installer**. **Prysmian Group ($PRYMY, an ADR) is the largest HVDC provider in the world. It's also a pure play.** It is based in Milan, but its a union of 3 companies--one of which is General Cable (American), which produces HVDC domestically. See the below image, which is from Prysmian's 2019 annual report. The green dots are energy cable (HVDC) manufacturing facilities. See a trend? They're almost all in Red states (again--renewables largely in Red States, HVDC manufacturing in Red states...)\n\nhttps://preview.redd.it/m5vyb46so0a61.png?width=601&amp;format=png&amp;auto=webp&amp;s=202e61a596fcac6e73c1584e3a5eeec9059dec58\n\n* (11) **45% of Prysmian's revenue is Grid work. It has a P/E of 44. What happens when Prysmian's revenue goes up by 3x over the next 5 years, and 10x by 2030?** There is SO much work to be done modernizing the U.S. grid, but then on to the rest of the world. The realities I am describing--EVs--&gt; heightened demand --&gt; green is cheap --&gt; it needs to be hooked in --&gt; regional grid connections lower net amount of storage needed in aggregate, etc etc etc, aren't unique to the first world. Other countries will follow suit. \n\n# Conclusion\n\nI do not believe this reality is baked into the price. Although everyone knows grid upgrades are coming (hence 44 P/E), I don't think that people are taking these large-phenomenon down to their lower level logical-conclusions. The gradual, inadvertent development of the Supergrid is inevitable, necessary, and politically convenient for a guy so desperate to bridge the political divide. Prysmian is well suited to take full advantage of American infrastructure as well as the rest of the world. \n\n\\------------------\n\nTL/DR:\n\n**EVs adoption curves are getting faster and faster, and are going to drive higher electrical demands from the Grid, which will be met with Green Energy. This will require a huge increase in HVDC installations. This is occurring at exactly the time Biden needs a big infrastructure plan for political-economic reasons, and the realities of Green energy in the U.S. actually benefit Red States pretty bigly. Gradually, HVDC networks will reach a point where a macro-regional 'Supergrids' become a reality (in order to lower aggregate storage requirements and add more safety/redundancy). $PRYMY (Prysmian Group) is the worlds largest HVDC provider and they manufacture HVDC in the U.S. They are primed to benefit from this trend, and it is currently vastly undervalued.** \n\nSorry no rockets. Also, there aren't options available, so you'll have to slow boat this."
  },
  {
   "Title": "$CMC - another increase - another reason to buy - 🚀🚀🚀",
   "#Comments": 96,
   "Score": 9,
   "Symbols": [
    "$CMC"
   ],
   "Selftext": "As I had been alluding to in previous posts, I was waiting for scrap moves and here is one of the first dominos to fall to start the month.  \n\nhttps://emma-assets.s3.amazonaws.com/luycb/3f8de298a37cd8f951aba5daf5a49f91/CMC_Steel_Central_Price_Increase__50_01-07-2021__Rebar_.pdf\n\nI expect there to be further increases once China comes into the market for scrap this month. \n\nLast month we saw 3 increases - for a total of $135 - a record. \n\nI believe we will see scrap move up $80-100/ton for January deals. \n\nClosing in on 2008 levels. \n\nGood evening to all. \n\n🦾🦾🦾\n\n🚀🚀🚀"
  }
 ]
}