{
 "Data": [
  {
   "Title": "What are your current positions and expectations for them?",
   "#Comments": 16,
   "Score": 1,
   "Symbols": [
    "$GME",
    "$BABA",
    "$CRM",
    "$PLTR",
    "$AMZN",
    "$FB",
    "$PFE"
   ],
   "Selftext": "I know everyone is already holding $GME and $PLTR until they lands on the moon but maybe we can find out what new tickers everyone is holding, why and what are their expectations.\n\nHere is a list of my current positions;\n\n* 70 shares of $BABA at an average of $245 with a price target of $265, where I'll liquidate unless the political environment gets better.\n   * COVID proof\n   * Solid financials, much more liquid than Amazon\n   * China is bound to become the largest economy\n   * Political uncertainties are exaggerated\n* 70 shares of $CRM at $221 with a price target of $230. Have made this same play quite a few times in the last 2 months.\n   * COVID proof\n   * A solid company run by a solid CEO with good growth and financials\n   * Slack was purchased for $28b but the market has wiped 26% of its market cap off, which is more than $50b so at the very least the overreaction is extended by at least $22b (a 10% increase in market cap from current levels)\n   * Short-term PT of $230 but have no doubt this can break above $275 in 2021. A 24% upside.\n* 24 shares of $FB at $273 with a price target of $280. Have also done this multiple times during the last few months.\n   * COVID proof\n   * Earnings coming up near the end of January.\n   * Zuck might be a lizard, but those IG \"influencers\" you follow from your fake account so your girlfriend doesn't find out will only keep luring you back in.\n   * Political risks surrounding breakup are exaggerated and seem to be an optic play to gain public confidence. Even if this is not the case, the first hearing is years away.\n   * Has the potential to breach $325 during 2021. An upside of 20%.\n* 4 shares of $AMZN at $3250 with a price target of $3350 at least. Have made a bit over $5k only trading swings between $3000 and $3350.\n   * COVID proof\n   * Earnings coming up near the end of January.\n   * Possible to reach ATH which is around $3500 near earnings.\n   * Possible to breach $4000 during the year providing an upside of 23%.\n* 275 shares of $PFE at average $38.62 with a price target of $41-42, not sure how this will go. Have made this play once before when I cashed out at $42.75 just a few weeks ago.\n   * Only speculative play in my portfolio\n   * Not a hold in the long run as this stock is as limp as they come but a reasonable dividend yield. So, not really worried about losing money.\n\nPretty boring shit, no $GME or $PLTR here but looking forward to seeing what other tickers the community is holding on to."
  },
  {
   "Title": "Alternatives to Bloomberg Live or CNN",
   "#Comments": 5,
   "Score": 1,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "I don’t know if any of you feel the same way but I feel like the Bloomberg Live stream or CNN are really only useful for when the markets open for the first 20 mins and then the it gets switched to all boomer programming with interviews. Is there any alternatives that that report strictly numbers, price movements or sectors that are on the move without the fluff? Also $TSLA 🚀🚀"
  },
  {
   "Title": "What is an alternative to Robinhood in switzerland?",
   "#Comments": 15,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "I've started trading one month ago on DEGIRO with shares only. After one or two weeks i found this shithole of a forum. Of course, like the other degenerates on this website, i recognized the potential of $GME and started to buy shares of those. I have 80@23 shares. I think $GME will rise up to at least 30 in the max time span of 3 months  ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 , but honestly i don't have a clue what i'm doing. That means by a bu-in on 23, i'll get 7 per share.  Since i'm a retard, i want to invest more in it and maximize my winnings as much as possible. So i started looking into options. The most popular app here is Robinhood apparently, but it isn't avaiable outside of the USA. So what are the best brokers for call options in switzerland?\n\nRockets for trust:  \n ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 ‍🚀 \n\nTL;DR Looking to maximize $GME winnings with options, what are the best brokers in switzerland?"
  },
  {
   "Title": "Short poker case for long $GME",
   "#Comments": 53,
   "Score": 1,
   "Symbols": [
    "$GME",
    "$GME"
   ],
   "Selftext": "$GME my short case for long $gme\n1. Huge EV+ risk that is largely uncorrelated to market risk (short squeeze).  Even low probability of outcome makes more effort and capital worth it.  Piling on the trade actually increases its likelihood.\n2. Fundamentals and activist investor (Cohen) give, at minimum, a plausible semi-bluff on turnaround.  May make errors but error will not be Blockbuster one.\n3. Chart technicals are incredible.  5x move but still largely invisible except to /wsb.  1.35B market cap gives face validity to 10x return even with move that already happened.   \n4. Perception of silliness and dismissal around threat have made short sellers prone to errors and more likely to pay off big.\n\nFor poker folks, it reminds me of holding a big flush draw.    It may not come through, but the possibility allows us to bet aggressively and potentially take the pot even without the hand.  If it hits, we can potentially entice our opponent to pay off big later.   Plus our opponent doesn't take us seriously, increasing their chance of overvaluing their ability to bluff us out."
  },
  {
   "Title": "Barkbox, Hims and Hers and Butterfly",
   "#Comments": 11,
   "Score": 1,
   "Symbols": [
    "$LGVW"
   ],
   "Selftext": "I'm a big believer in Barkbox ($STIC) since it's a growing consumer subscription based stock for pets (easy to see it used in the future for a long term play) with nice margins. Also, big believer in Hims and Hers ($OAC); great margins again, great stay at home tele health product. Both also project to have a great YoY growth too. What do you guys think? \n\nAlso, what are your thoughts on $LGVW (big fan of the tech and its future). Would love to get feedback on these 3 SPACs and others that I have missed too. \n\n*Disclaimer: I own some other SPACs, but did not want a TLDR situation lol*"
  },
  {
   "Title": "I want Autist Advice",
   "#Comments": 18,
   "Score": 1,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "I really really wanna buy $TSLA calls with my last 10k life savings so I can make up my 20k recent loss (check my post history) and I been watching for two months ass we all know it will have a massive pull back, I am worried if I buy 10k worth of calls it will crash massively, I want this post to serve as a proof that my worst fears came true and as soon as I bought the direction changed."
  },
  {
   "Title": "'Black Mirror' Index.",
   "#Comments": 52,
   "Score": 1,
   "Symbols": [
    "$NEURALINK",
    "$PTON",
    "$HYNDAI",
    "$PLTR",
    "$FB",
    "$GOOG",
    "$SNAP",
    "$IAC",
    "$U"
   ],
   "Selftext": "Tracking stonks which enable a future as depicted in various seasons of Black Mirror. Got any additions?\n\n$U (powering the metaverse)\n$PLTR (government surveillance)\n$FB (social scoring) \n$PTON (cycle for energy)\n$SNAP (glasses powering a digital diary)\n$Hyndai motor group (robotics through Boston Dynamics subsidiary)\n$GOOG (general AI / via Deepmind subsidiary)\n$IAC (social comparability through various dating/ matching platforms \n$Neuralink once Papa Elon gets on with it.\n\n🚀\n\nWhat else"
  },
  {
   "Title": "Use your stimmy to buy $GME",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "If we all combine our powers we can easily trigger the short squeeze. \n\nThere are over 1 million degenerates in this community. Let’s say 1 million of them are eligible for stimulus.\n\nThat’s 1 million * €600 = €600 million \n\nCurrent market cap is 1,31B / 600 mil = ~46%\n\nWE CAN ALL GET TO TENDIES TOWN.\n\n\nTl;dr Use stimmy to buy $GME shares triggering short squeeze."
  },
  {
   "Title": "You guys are truly retards with no finesse when it comes to the markets. $GME",
   "#Comments": 45,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "Ok retards I’m going to give it to you str8 you guys are truly retarded to the point that I know for a sure fact that most you are sheep who are gladly walking into the slaughter house just because a stock is cheap and someone told you to buy something.. no no this is truly a financially retarded move that cost you to blow up your account and cause your girlfriends boyfriend to fuck her right in front of you and make you pay him money for it.. look I understand GameStop had a great year but truth be told who actually made more money because of ps5 and Xbox’s? Fucking Sony, Microsoft and AMD but no you retards think it’s GameStop and failing third party vendor who clearly makes money by selling you used games at a ridiculous higher price just to make their money back... really truly retarded and you guys deserve a pat on the back for your efforts. I’m just saying do the fucking research on how the company makes money before you Hail Mary your money into nothing and then cry bout how the gay bears 🌈 🐻 fuck you everyday of course they cuz the people with a brain already got out and leaving you retards to scramble for a profit. \n\nNow if you any of you wanna tell me I belong on r/investing I want you to do me a favor.... tie a tight string around your balls in a few weeks your balls will fall off ultimately castrating yourselves.... Thank you"
  },
  {
   "Title": "PLTR at a $40B market cap is a steal",
   "#Comments": 34,
   "Score": 1,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "Most on here are trying to time a breakout with FD’s. Wait for momentum then buy some slightly OTM calls 4-6 weeks out (preferably longer but I know that’s against the rules here). \n\nOr you can buy $TSLA calls at $670B and 1400 P/E (not hating it’ll probably go higher....) \n\nLet me know what you think."
  },
  {
   "Title": "GME careers as a reflection of their roadmap",
   "#Comments": 41,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "I always find interesting how companies' available jobs could hint at the future state of the execution of their roadmap. In the case of $gme you can find a few interesting things to observe:\n\n\\- eCommerce investments (keyword Omnichannel): [https://careers.gamestop.com/en-US/search?facetcategory=ecommerce](https://careers.gamestop.com/en-US/search?facetcategory=ecommerce) . Although it is in my opinion a very poor initial effort (only 2 job postings), it could be the start of the effort to hire the core leadership team first.\n\n\\- Technology: [https://careers.gamestop.com/en-US/search?facetcategory=information%20technology%2Fecommerce%20technology](https://careers.gamestop.com/en-US/search?facetcategory=information%20technology%2Fecommerce%20technology) . As can be seen here (also only 2 job postings).\n\nIt is clear that $gme lacks the engineering caliber to execute RC's vision and the board; as of today, is not quite showing that they are taking the necessary steps to pursue reinventing the business. Looking forward to the upcoming events and announcements in 2021 Q1 and Q2.\n\n&amp;#x200B;\n\nPS - 10,500 shares | Seriously thinking about quitting my engineering/product leadership role in the Valley in order to help RC build his vision this coming year."
  }
 ]
}{
 "$GME": 257,
 "$BABA": 20,
 "$CRM": 20,
 "$PLTR": 76,
 "$AMZN": 20,
 "$FB": 76,
 "$PFE": 20,
 "$TSLA": 69,
 "$LGVW": 15,
 "$NEURALINK": 56,
 "$PTON": 56,
 "$HYNDAI": 56,
 "$GOOG": 56,
 "$SNAP": 56,
 "$IAC": 56,
 "$U": 56
}