{
 "Data": [
  {
   "Title": "DD: SBUX ☕️👱🏻‍♀️: White girls are going out in the world and frappe sales are going to the roof 📈",
   "#Comments": 59,
   "Score": 1,
   "Symbols": [
    "$SBUX"
   ],
   "Selftext": "When I look back at last year I wonder what was so obvious that I missed. Some businesses were super obvious like cleaning supplies and gaming. But there were secondary effect businesses. For example Home Depot was a good buy when the virus hit because bored dads at home had to find something to get busy and avoid seeing their daughters recording for their OnlyFans page.\n\n&amp;#x200B;\n\nNow that vaccine is here, there is gonna be businesses that are going to benefit from a secondary effect. We all know travel is gonna boom with vaccine but what's gonna be like Home Depot this time?\n\n&amp;#x200B;\n\nI propose Starbucks. People (mostly white girls) are going to spend a lot of time outside of home because they fucking hate their family at this point. I can even imagine Starbucks themed TikTok dances that are done with a latte in hand in front of Starbucks.\n\nI bought stocks like a loser but I'm holding onto 200 coffee flavored $SBUX\n\n&amp;#x200B;\n\nBuy the dip when it happens. Latte power is real"
  },
  {
   "Title": "Two words: Velodyne Lidar $VLDR",
   "#Comments": 23,
   "Score": 1,
   "Symbols": [
    "$VLDR"
   ],
   "Selftext": "Ok regards, last time I predicted PLTR would go to the moon, VLDR is next. Their LiDaR sensors Technology include autonomous vehicles, advanced driver assistance systems, mapping, security and unmanned aerial vehicles.\n\nIt’s rumored that a major drone company will include their sensors in the next generation of drones. Also rumored Apple Car may include them.\n\nZoox (by amazon) will come equipped with their lidar sensors.\n\n\nTl;dr: dope and exciting technology; to the moon  retards 🚀🚀🚀🚀"
  },
  {
   "Title": "Why you should buy $LIT",
   "#Comments": 22,
   "Score": 1,
   "Symbols": [
    "$LIT",
    "$TSLA"
   ],
   "Selftext": "Hello again fellow retards, I am here to preach the good word of profit to all who would listen. \n\nAs we all (should) know, the hype in China and Japan for electric vehicles is off the charts, with gasoline vehicle sales being banned in coming years and a strong push for cleaner travel, along with any and all $TSLA hype, EV stocks and energy ETFs across the board have fucking soared recently. \n\nA lot of you retards here struggle with FOMO so I’m telling you this now rather than later. Buy $LIT. Almost all EVs all use lithium batteries for Christ’s sake. The demand for it in the coming future will be nuts until more efficient energy storage is introduced. $LIT had blown up 17% in a fucking week, and the moon ain’t over (until the next bit of market correction at least). Don’t buy calls at the moon, wait for the next weekly dip it takes and enter a position then. \n\nSincerely, \n\nA  prior 1/15/21 $55c holder\n\nCurrent positions:\n\n5 shares, x7 4/16/21 $75c"
  },
  {
   "Title": "$PLTR co founder John Lonsdale 8VC firm owns a yolo amount of $WISH",
   "#Comments": 23,
   "Score": 1,
   "Symbols": [
    "$PLTR",
    "$WISH"
   ],
   "Selftext": "So they totally aped into $WISH with 30m plus stocks ownership. $WISH is currently trading at around 19.8$ which is under IPO price of 24$. It is an ecommerce that has tons of users buying tons of shit cheap products. This stock has the potential to fly high, it sits at a very reasonable entry. It is good to note that this company has no debt! \n\nFinal note is this TechCrunch interview with $PLTR investor Justin Fishner from 137 Ventures about his $WISH investment.\n\n[https://techcrunch.com/2020/12/19/wish-and-airbnb-and-palantir-investor-justin-fishner-wolfson-doesnt-care-about-first-day-pops/](https://techcrunch.com/2020/12/19/wish-and-airbnb-and-palantir-investor-justin-fishner-wolfson-doesnt-care-about-first-day-pops/)"
  },
  {
   "Title": "$QS : check our my DD",
   "#Comments": 30,
   "Score": 1,
   "Symbols": [
    "$QS"
   ],
   "Selftext": "Bill gates did his DD before investing in \\[QS\\](https://finance.yahoo.com/quote/QS), why should we do our own DD?\n\nIt  went down 50% yesterday cause \"someone\" spread rumors saying they're  diluting shares. CEO came out said that's not true. If we buy now we get 100% returns if it goes back up to  previous target.\n\nWhy am I sharing this? Checkout there financials\n\n0 revenue over 10 years but it's still not bankrupt. Now that is a solid management   \n\n\n[0 revenue after 10 years](https://preview.redd.it/8sumpl1gyk961.png?width=328&amp;format=png&amp;auto=webp&amp;s=3af0b8f4fdb2486047ba94dd88532c6f55d0e2fa)"
  },
  {
   "Title": "Trump helps out $MT",
   "#Comments": 54,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "Interesting development where trump is sanctioning steel producers in,  and suppliers to Iran- taking that chess piece off the board creating more demand. Feeling much better about my calls today. \n\nUS Treasury announces new sanctions on Iran's steel industry\n\nhttps://www.foxbusiness.com/markets/us-treasury-new-sanctions-iran-steel"
  },
  {
   "Title": "Type LEAPS for cheats",
   "#Comments": 55,
   "Score": 1,
   "Symbols": [
    "$PLTR",
    "$AAPL",
    "$BB"
   ],
   "Selftext": "My fellow peeps,\n\nThis is an old strategy but it’s hot right now so I figure I’d share some low delta finds to consider for those looking to be millionaires in a year or two:\n\n$BB 1/21/22 15c @ ~0.2 Delta : I’d buy this if you feel they can edge their way into EV computer systems and automated driving\n\n$AAPL 1/21/22 250c @ ~0.08 Delta : I firmly believe that come summer with Foxconn’s new partnership we should see EV vehicle concepts being advertised that should boost the price and print those tendies\n\n$PLTR 1/21/22 45c @ ~0.4 Delta : a little higher but still fairly low for being so far out but of course the price target is also high. Lots of PLTR cucks on WSB right now plus they do have the potential to take the lead on EV automated driving systems\n\nFeel free to bash my choices and share with fellow autists your LEAPS plays.\n\nTLDR : LEAPS are essentially low delta plays (anything below .5 is good) that are more than 3 months out though also usually ITM but on speculation can include OTM"
  },
  {
   "Title": "$LMND is the ONLY stock you should own NOW!!!!",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$TSLA",
    "$LMND"
   ],
   "Selftext": "Listen fuckers, \n\nI'm gonna give it to you very simply because I know not all of us are geniuses like me. You see there's a company called Lemonade and they do mostly some shit that nobody cares about. But something that all you retards do care about is money $$$$$. THE BIG DOLLAR BILLS IS WHAT YOU WANT AND ITS WHAT YOULL GET.\n\nSo listen up, the stock will go up, then it will go down, then it will go back up again. Let me explain to you autists my genius reasoning behind this. Because the earth is flat, it's summer right now in French, and do you know what the French like to drink in summer???? THATS RIGHT. LEMONADE. \n\nAnd why should we trust you, well my friend, I have watched this stock for a total of 3, yes THREE days. Every day, the stock has moved either up or down, BY CRAZY AMOUNTS. TAKE A LOOK AT THIS OFFICIAL LOOKING PICTURE FROM A WEBSITE I FOUND OFF GOOGLE.\n\n*Processing img 9u48u7mppk961...*\n\nAs you can see, the stock went up 8% today!!! Wow! This is crazy! And incredible! I'm ready to sell my kidney to purchase stock options for this stock! To add more proof, the \"experts\" at this website believe that the stock is overvalued. That is just completely preposterous and incorrect! They said the same thing about $TSLA when it just split! And now it is worth way more. \n\nIn conclusion, all signs are pointing to $LMND going to the moon! Join me next week as I will explain to you why my next stock pick (it's a secret) IS GOING TO GO UP 1200% IN THE NEXT YEAR. \n\n&amp;#x200B;\n\nTLDR: Sell the house, the kids, the wife (lol you don't have one we know), the relatives, the dog, and BUY A SHIT TON OF OPTIONS THAT YOU MAKE MONEY OFF OF WHEN IT GOES UP (whatever those are \"called\")"
  },
  {
   "Title": "$AQMS",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$AQMS"
   ],
   "Selftext": "Up to 10K in on AQMS longs 📈"
  },
  {
   "Title": "$GUSH green dildo making me gush",
   "#Comments": 32,
   "Score": 1,
   "Symbols": [
    "$GUSH",
    "$MT"
   ],
   "Selftext": "(Having to repost because one guy didn’t like my $MT insult; you can cock ride both if you want)\n\nMy position: a $55c for February (I’m poor)\n\nThis leveraged index fund is gonna moon.🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀  Why? you may say; it’s simple retards, the boomers are finally starting to realize that COVID is dying.  Listen, travel restrictions are being lifted internationally, people are getting there second dose of Pfizer, and it’s being proven that the vaccines are effective against this “scary” new strain.\n\nNow, while you all have been cock riding $MT making your 2% gains, you have forgot about a more important part of what a reversion back to preCOVID norms is going to look like.  What do I mean?  It’s simple, as people are flying more, driving more, or building more, most of them are going to consume oil.\n\nBut why this index fund you may ask?  Because it’s twice leveraged, and sells options, it couldn’t get more autistic.  Also it was over a thousand pre-corona.\n\nLike I said earlier, now that the boomers realize that the world will start traveling more (although maybe slightly less so) they will be investing in things like Marathon and Murphy oil.  As they do so over the next 2 or 3 months, a retard should be buying calls on this twice leveraged fund.\n\nMy advice to buyers: you can tell the days trend in the first 2 minutes after the market opens for GUSH, and the biggest draw back is the low volume for OTM options.  So if you see the stock go up within a minute or two of tomorrow’s open for those who get here late, then it’s probably a good time to buy, but if you see it go down, buy about a half hour before close for a discount.\n\nTLDR: buy the February through June calls, no strike piece is too expensive (in my opinion) oil consumption/oil stocks are gonna moon 🚀🚀🚀🚀, and this index fund is gonna double moon🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$GUSH green dildo making me gush",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$GUSH",
    "$MT"
   ],
   "Selftext": "My position: [link](https://imgur.com/gallery/8Q5uv3X)  (I’m poor btw)\n\nThis leveraged index fund is gonna moon.🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀  Why? you may say; it’s simple retards, the boomers are finally starting to realize that COVID is dying.  Listen, travel restrictions are being lifted internationally, people are getting there second dose of Pfizer, and it’s being proven that the vaccines are effective against this “scary” new strain.\n\nNow, while you all have been cock riding $MT making your 2% gains, you have forgot about a more important part of what a reversion back to preCOVID norms is going to look like.  What do I mean?  It’s simple, as people are flying more, driving more, or building more, most of them are going to consume oil.\n\nBut why this index fund you may ask?  Because it’s twice leveraged, and sells options, it couldn’t get more autistic.  Also it was over a thousand pre-corona.\n\nLike I said earlier, now that the boomers realize that the world will start traveling more (although maybe slightly less so) they will be investing in things like Marathon and Murphy oil.  As they do so over the next 2 or 3 months, a retard should be buying calls on this twice leveraged fund.\n\nMy advice to buyers: you can tell the days trend in the first 2 minutes after the market opens for GUSH, and the biggest draw back is the low volume for OTM options.  So if you see the stock go up within a minute or two of tomorrow’s open for those who get here late, then it’s probably a good time to buy, but if you see it go down, buy about a half hour before close for a discount.\n\nTLDR: buy the February through June calls, no strike piece is too expensive (in my opinion) oil consumption/oil stocks are gonna moon 🚀🚀🚀🚀, and this index fund is gonna double moon🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$TLRY Update- 🚀🚀🚀🚀🚀",
   "#Comments": 234,
   "Score": 1,
   "Symbols": [
    "$TLRY"
   ],
   "Selftext": "**TLDR: Buy TLRY calls and shares. 🚀🚀🚀🚀🚀**\n\nI hope you guys listened to me, TLRY is up around 10% since I posted my first DD yesterday. My calls are up 200%. 🚀🚀🚀🚀🚀\n\nBest part? **There's still time to get in.** 🚀🚀🚀🚀🚀\n\nI'm here today to focus in on the Georgia senate runoff results and their effect on TLRY's stock price.\n\nFirst, to go back to my last post, you might be wondering: **Why TLRY?**\n\nI believe in all of the major weed stocks, however TLRY's merger with APHA has created a **powerhouse**  of a company. The premium APHA will pay for the TLRY reverse acquisition will be a huge help to TLRY's balance sheet. The new company will have a 17.3% market share in Canada, by far the largest. The combined resources of TLRY and APHA will make the merged company a dominant force in the fledgling American pot industry. It did not surprise me why at the time of this post **TLRY has performed the best out of all the major pot stocks in the last couple days. 🚀🚀🚀🚀🚀**\n\n**TLRY is undervalued.** I'll link my first DD post but to sum it up, TLRY's value, even without a blue wave, is **undervalued.** Morningstar has given them a fair value of $14 per share, Put/Call ratio on the company is .13. **Regardless of what happens in the Georgia Senate election, Wall Street is bullish on TLRY. Technicals and Fundamentals are aligned for a MOONSHOT IN 2021 🚀🚀🚀🚀🚀**\n\n**Why are the Georgia Senate runoffs so important?** \n\nThe Georgia senate runoffs are the first step of the process. If Dems win (which I will link some good evidence as to why they will) the Senate majority will be enough to get Wall Street giddy. Just look at the moonshot TLRY took after the election of Biden. That was with **no Senate majority.** Imagine the moonshot when the blue wave is complete and the path to legalized pot becomes **much more realistic**. 🚀🚀🚀🚀🚀\n\n**What are the chances of the Democrats winning Georgia?**\n\nMomentum for the Democrats has picked up a lot. Voters are excited over Democrat promises for larger stimulus, and moderate Republican voters are turned off to the party after Trump's refusal to accept to the election results. \n\n**Positions**\n\nTLRY 13c 1/22 \n\n**Sources**\n\n[https://www.npr.org/2020/12/21/948172589/trump-drives-a-wedge-among-georgia-republicans-risking-a-larger-gop-split](https://www.npr.org/2020/12/21/948172589/trump-drives-a-wedge-among-georgia-republicans-risking-a-larger-gop-split)\n\n[https://www.nbcnews.com/politics/congress/georgia-democrats-close-populist-pitch-vowing-2-000-stimulus-checks-n1252805](https://www.nbcnews.com/politics/congress/georgia-democrats-close-populist-pitch-vowing-2-000-stimulus-checks-n1252805)\n\n&amp;#x200B;\n\nI'll link you with my first DD post yesterday for info on why this is only the start for TLRY and my bull case for why it will moon in the short term AND long term 🚀🚀🚀🚀🚀\n\n[https://www.reddit.com/r/wallstreetbets/comments/kqd5w2/tlry\\_will\\_be\\_the\\_first\\_moon\\_trip\\_of\\_2021/](https://www.reddit.com/r/wallstreetbets/comments/kqd5w2/tlry_will_be_the_first_moon_trip_of_2021/)\n\n\"FORTUNE FAVORS THE BOLD\""
  },
  {
   "Title": "Buy EV or Green Energy stocks for the Georgia runoffs because Democrats will win",
   "#Comments": 108,
   "Score": 1,
   "Symbols": [
    "$FSR",
    "$PLUG"
   ],
   "Selftext": "There is a lot of data that suggests Democrats will win the senate and green energy stocks like $FSR and $PLUG will moon if Dems get the senate.\n\nFirst off, I did correlation analysis between Biden vote share and early turnout in the runoff as a percentage of November 2020 early vote. The correlation is strong, approximately .45. In other words, the early voting has been remarkably favorable towards the Democrats. I got my data from [georgiavotes.com](https://georgiavotes.com). Here is the link to the google sheet I put the data in. [https://docs.google.com/spreadsheets/d/1pBDLDZZRPSzhqE1nU6t98mY1wfkOtuOftlQUiY8msOw/edit#gid=0](https://docs.google.com/spreadsheets/d/1pBDLDZZRPSzhqE1nU6t98mY1wfkOtuOftlQUiY8msOw/edit#gid=0)\n\nSecondly, this is small but anecdotal evidences shows rural polling places have not been busy today. The only way Republicans win the Georgia runoff is with huge election day turnout. That is very unlikely in a runoff election without Trump on the ballot.\n\nLastly, there is polling that shows a wide swath of Republican voters feel like they should boycott the runoff. [https://twitter.com/cstewartiii/status/1346296064572321792](https://twitter.com/cstewartiii/status/1346296064572321792)\n\nSeems like the market has not priced this in so I'm going HAM on calls.\n\nPLUG 40c 1/8/2021\n\nFSR 17c 1/8/2021"
  },
  {
   "Title": "$PINS - Unusual Option Flow Activity",
   "#Comments": 13,
   "Score": 1,
   "Symbols": [
    "$PINS"
   ],
   "Selftext": "For all of those wanting some nice tendies for the new year 2021 look at $PINS 65c 2/19  \n\n\nThere has been unusual option flow activity on that certain strike and the strikes around it and on that particular date. Looking at the charting, it has a good position for buying on the StochasticSlow. I'm already loaded in today, but it is still not too late. A lot of institutions are betting big money on this going up before Feb, so get in while you can!\n\nAlso there is a huge DP (DarkPool) at $68 and seems to be a very nice support. I would consider watching it to get in. Stocks or Options, both will pay off in time."
  },
  {
   "Title": "$OPEN to $35 🚀",
   "#Comments": 31,
   "Score": 1,
   "Symbols": [
    "$OPEN"
   ],
   "Selftext": "$OPEN has been going through the typical post-SPAC dump (-13% over last week; ATH $32, now $24), but seems to have turned the tide starting yesterday (+5.6% while the rest of the market dumped)\n\nCathie Wood keeps adding $OPEN to ARKW &amp; ARKF \n\n[https:\\/\\/cathiesark.com\\/ark-combined-holdings-of-open](https://preview.redd.it/a4581lxoji961.png?width=1128&amp;format=png&amp;auto=webp&amp;s=cbfd29d968fc2c93f8d3a0d69ceb53c0160f0966)\n\nExpecting this to get to $35 by end of Q1  **🚀**  **🚀**  **🚀** \n\nPositions: $35C Mar 19"
  },
  {
   "Title": "When you buy 50,500 GME shares at $22 because you are retarded you start to get really worried when you see current prices. Do you HONESTLY think it will go up to $22 within 3 months?",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "My broker will not let me sell covered calls as $GME is high risk (category 6) anything above 5 is a no go. Doesn't make sense to me but what to do"
  },
  {
   "Title": "Why $WISH has the potential to go to the moon and beyond",
   "#Comments": 83,
   "Score": 1,
   "Symbols": [
    "$WISH"
   ],
   "Selftext": "This post is in no way financial advice. I’m no expert, I’m just here to explain why I have yolo’d my account into Wish.com shares and calls. I encourage everyone to do their own due diligence. \n\nPart 1: The Basics\n\nWish.com went public on December 16th and nosedived from $23 to $17.45 over the course of about 2 weeks. Wish has rallied over the past two trading days despite the market being red overall. I think the stock is way oversold and potentially hit its bottom last Thursday. Let me spit some quick facts about the company:\n\n- Amazon and Alibaba both offered $10 billion to acquire Wish in 2015. This is obviously prior to the boom e-commerce has received from Covid. Wish’s annual revenue was $300 million at this point. \n- Revenue in 2019 was $2.3 billion, about $800 million more than Shopify in 2019 for reference. \n- Founded by former Google and Yahoo programmers and recently appointed a former Square exec to their board of directors\n- Wish had over 90 million monthly users in 2019, and I believe that number has gone up considerably by now. \n- Most downloaded shopping app of all time with over 500 million downloads.\n- Serves over 100 countries with 3 million transactions a day.\n- No debt and over 1-2 billion in cash\n- In spite of further lockdown news today, Wish went up. I believe this stock is now being recognized as a stay-at-home stock, yet should perform well post-covid due to the longevity of the e-commerce industry as a whole. \n- Although Wish is an American company, many of its merchants are Chinese. I believe Wish might gain in the short term in response to uncertainty over Alibaba’s monopoly investigation. \n- If none of the above has gotten your cock hard yet, Palantir Co-Founder, John Lonsdale, owns 59 million shares of Wish.   \n\nPart 2: Data\n\nData is the new oil bitches. Wish has an absolute fuckton of users, and what sticks out to me is that the majority of purchases made on wish are items that weren’t searched for by the buyer.  These are items recommended by Wish’s algorithm. Only about 15%-20% of purchases made on wish are made through the buyer performing a search. Wish is very effectively using the data they collect to recommend the right products to the right people. If you don’t see the value in that, then fuck you.\n\nAnd may I remind you that John Lonsdale, Data God and Palantir Co-Founder, owns 59 million shares of Wish. \n\nPart 3: The Cons\n\nThe biggest criticisms I’ve seen of Wish is that the product quality can be poor and the shipping time can be poor. These are valid points, however I believe the leadership of this company will make strides in improving upon those two problems, especially when you consider that they just raised a billion dollars in their IPO. Additionally, I’ve seen positive reviews regarding their refund policy. This obviously does not excuse poor product quality and shopping time, but the numbers don’t lie. People are buying shit on Wish. There is a market for cheap, low quality shit and Wish is capitalizing on it hard. If you think Wish is a garbage company, just remember that amazon and alibaba both saw massive value prior to all the growth Wish has had in the last 5 years. \n\nOnce the quiet period is over and Wish releases its first earnings report since they’ve gone public, I’m anticipating a huge run. \n\nPositions: Loaded to the fucking gills with shares and July 16 $25 calls"
  },
  {
   "Title": "$SAM - TEA THAT SLAPS! (Twisted Tea)",
   "#Comments": 25,
   "Score": 1,
   "Symbols": [
    "$SAM",
    "$GME",
    "$PLTR"
   ],
   "Selftext": "Dear gay bears and autists, the next $GME and $PLTR mooner is here. Tea that fcking slaps.  \n**Everyone** has seen this viral video of a guy getting smacked by a twisted tea can. If not check the link. [Twisted Tea Smack Meme Original Video](https://youtu.be/i3o_6dFPyy8?t=41)  \n\n\n*Processing img 42ch8v3u8h961...*\n\nPeople are buying a lot of these since this became a viral meme. Boston Beer company owns the twisted tea brand. Next earnings date are Feb 17 and sales numbers should be insanely surprising in the earnings report.\n\n# Google Trends:\n\n*Processing img rje2q1t29h961...*\n\n# Meme Economy: Tiktok\n\n*Processing img 9bdj1xp79h961...*\n\nEndless meme’s on tiktok and other social media platforms. Diversified. Saw someone throw a CAN at a protest on the news.  \n\n\nhttps://preview.redd.it/5krpv3fc9h961.png?width=480&amp;format=png&amp;auto=webp&amp;s=9425d476dc1bf839f709542e6db1342412667fda\n\n# More Google Trends\n\nhttps://preview.redd.it/69oreauf9h961.png?width=454&amp;format=png&amp;auto=webp&amp;s=e473a404c19989bfb120fed25882d7e7f356c15d\n\n*Processing img tsjwrw71ah961...*\n\n# Market Share\n\nTwisted tea is going to gain market share a few quarters earlier than wall street expectations. It was already expected to grow by double digits and become the star of 2021.\n\n*Processing img dsbg83py9h961...*\n\nPeople searching for twisted tea to buy is also up. \n\n*Processing img 7r7z8n35ah961...*\n\n# Sales: CANS SOLD OUT!\n\nhttps://preview.redd.it/wplavg09ah961.png?width=590&amp;format=png&amp;auto=webp&amp;s=9fd78aa9c97dd411237d3e3e8c8c0934ef54fb6c\n\nSimilar posts on FB and reddit.   \nCheck if your local area has “CANs” available! [https://www.twistedtea.com/locations](https://www.twistedtea.com/locations)\n\nhttps://preview.redd.it/l1fidqvcah961.png?width=594&amp;format=png&amp;auto=webp&amp;s=dc1725f1f81e35d4c7d69fec3c2111b2e22b0857\n\nhttps://preview.redd.it/o6wtywxhah961.png?width=557&amp;format=png&amp;auto=webp&amp;s=2611f31fbc5b57be96ffcb951a2fffbee05a7f1f\n\nhttps://preview.redd.it/5jgeen3lah961.png?width=584&amp;format=png&amp;auto=webp&amp;s=fe3c884f0d189b3d14e560c0a13ffb8b0b839b88\n\nDont miss out on this opportunity! Dont let Bernie get mad!\n\nhttps://preview.redd.it/nnem1nyrah961.png?width=457&amp;format=png&amp;auto=webp&amp;s=9cab1bf9ee19bc2d927c23b5e41c7ea79a767035"
  },
  {
   "Title": "$MT !! Just slow down for a sec boys",
   "#Comments": 22,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "Seriously, I'm the most autistic there is and I'm not trying to be condescending here, but honestly take a look at $MT. Actually sit down for 45 minutes, read the previous posts on here and the surrounding news in the industry. This is, in my humble autistic opinion, the most cohesive and logical play that I've (only me maybe other people have seen better) ever seen suggested on here. I tend to get into this cycle of not taking my time in this sub and missing some gems so if this is speaking to you then, sit down and give it a chance. \n\nIf you skipped that entire paragraph then I love you, you beautiful retard. In short: $MT = 🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$GOEV IS FORGOTTEN?",
   "#Comments": 55,
   "Score": 1,
   "Symbols": [
    "$PLTR",
    "$GOEV"
   ],
   "Selftext": "I have been lurking here since late November. I never expected to be here, but I found myself in an awkward position as an individual who went all-in on $PLTR at its IPO in September. I did some 'research' after the huge run up and ended up here, with the meme stocks. Apperently, my senses happen to coincide with complete and utter autism. \n\nSince then, I have found the investor presentation from August for '$HCAC' aka '$GOEV' aka Canoo. I went in hard on the company, as I believe in the vision and direction, but I must admit I am discouraged with the recent downturn.\n\nDoes anyone have a solid reason for the downturn? Or have any input on thier own beliefs? I still believe in this company, but I have no idea why the crash happened, other than paper hands taking short-term profits.\n\nTldr: Why GOEV low? Why not high? \n\nPLTR 🚀🚀🚀🚀\n\nGOEV 💎🖐🚀🚀🚀🚀"
  },
  {
   "Title": "$MT GANG MULTI BAGGER",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "And indian guy on youtube telling us to buy $MT for multi bagger THE ONLY DD WE NEED!\n\n[https://www.youtube.com/watch?v=snEqDnCRE-w](https://www.youtube.com/watch?v=snEqDnCRE-w)"
  },
  {
   "Title": "$PLTR Just keeps getting money",
   "#Comments": 9,
   "Score": 1,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "Alright you Lovely people, check this out. [https://investors.palantir.com/news-details/2021/Palantir-Technologies-Expands-Japan-Business-with-New-22.5-Million-Contract/default.aspx](https://investors.palantir.com/news-details/2021/Palantir-Technologies-Expands-Japan-Business-with-New-22.5-Million-Contract/default.aspx)  \n\n\nMore fucken money being THROWN TO PLTR, no reason this doesnt fly within a few days. I know yall love options, but just consider the possibility of grabbing shares.  Its at $23.35 and holding. I am already in call which I wont elaborate on ( due to the position to ban rule) but I am really considering picking up shares on this. Anyway, this is for the crew."
  },
  {
   "Title": "$MAC - undervalued and being accumulated",
   "#Comments": 141,
   "Score": 1,
   "Symbols": [
    "$CMC",
    "$GME",
    "$MAC"
   ],
   "Selftext": "Anyone that follows my posts know me as a steel aficionado and knows I love $MT, $VALE, $CMC &amp; $STLD.  I’m bullish on steel now, even more so than I was on tech pulling us out of the March/April lows.  \n\nI wanted to share another stock with UPSIDE that has been beaten down and is a vaccine and recovery play - $MAC. \n\nhttps://www-marketbeat-com.cdn.ampproject.org/i/s/www.marketbeat.com/scripts/EarningsEstimatesChart.ashx?Prefix=NYSE&amp;Symbol=MAC\n\n389 institutions hold shares in The Macerich Company. \n\nInstitutional investors and hedge funds have recently made changes to their positions in the business. Aperio Group LLC boosted its position in shares of The Macerich by 48.8% in the third quarter. Aperio Group LLC now owns 407,430 shares of the real estate investment trust's stock valued at $2,766,000 after acquiring an additional 133,601 shares during the period. Advisor Group Holdings Inc. increased its stake in shares of The Macerich by 75.7% in the second quarter. Advisor Group Holdings Inc. now owns 149,133 shares of the real estate investment trust's stock valued at $1,338,000 after buying an additional 64,243 shares during the period. Vanguard Group Inc. increased its stake in shares of The Macerich by 2.3% in the second quarter. Vanguard Group Inc. now owns 19,822,696 shares of the real estate investment trust's stock valued at $177,811,000 after buying an additional 447,029 shares during the period. Mitsubishi UFJ Trust &amp; Banking Corp increased its stake in shares of The Macerich by 102.5% in the second quarter. Mitsubishi UFJ Trust &amp; Banking Corp now owns 62,834 shares of the real estate investment trust's stock valued at $564,000 after buying an additional 31,807 shares during the period. Finally, Bank of New York Mellon Corp increased its stake in shares of The Macerich by 1.2% in the second quarter. Bank of New York Mellon Corp now owns 2,164,136 shares of the real estate investment trust's stock valued at $19,411,000 after buying an additional 24,664 shares during the period. Institutional investors own 83.77% of the company's stock.\n\nThe top institutional shareholder in the company is Ontario Teachers’ Pension Plan Board with over 24.56 million shares valued at $166.78 million. The investor’s holdings represent 16.43% of the MAC Shares outstanding. As of Sep 29, 2020, the second largest holder is Blackrock Inc. with 18.09 million shares valued at $122.8 million to account for 12.10% of the shares outstanding. The other top investors are Vanguard Group, Inc. (The) which holds 16.27 million shares representing 10.88% and valued at over $110.44 million, while State Street Corporation holds 4.77% of the shares totaling 7.13 million with a market value of $48.4 million.\n\nThe biggest takeaway for me is Blackrock ownership - BlackRock is the world's largest asset manager, with $7.81 trillion in assets under management as of end-Q4 2020 - these guys know value. \n\nIf you don’t know who $MAC is:\n\nMacerich is a fully integrated, self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. Macerich currently owns 51 million square feet of real estate consisting primarily of interests in 47 regional shopping centers.  Macerich owns some of the nation’s highest-earning malls, including Tysons Corner Center in Northern Virginia.\n\nhttps://wamu.org/story/20/12/18/despite-the-pandemic-and-popularity-of-online-retail-shoppers-are-still-flocking-to-tysons-mall/\n\n$MAC is an owner of a multitude of well-positioned, high-end shopping centers. \n\nWe aren’t talking about your local mall that is half vacant and has been for years, their properties are high-end, destination attractions:\n\nhttps://www.macerich.com/Leasing/Find \n\nThe low interest rates benefit REIT’s and allow $MAC to do deals like this:\n\nhttps://www.google.com/amp/s/www.inquirer.com/real-estate/commercial/preit-macerich-fashion-district-control-bankruptcy-gallery-20201217.html%3foutputType=amp\n\nI know what you are thinking, malls are closed, no one is going to bricks and mortar, but as you saw above at Tyson’s Corner, people are out and shopping. \n\nPent up demand + stimulus = profits.  \n\nAs of October 7th all 47 of the Company's major retail properties nationwide were fully open for business, now that LA County has approved indoor mall reopenings. \n\nIn LA as of 12/27:\n\nhttp://publichealth.lacounty.gov/media/coronavirus/docs/protocols/Reopening_ShoppingCenters.pdf\n\nREIT’s - Real Estate Investment Trusts - some of the most beaten down stocks by the pandemic and this one, I believe has significant upside from its current price level.\n\nWhat I like about $MAC is this:\n\nRent collections continued to improve, with collection rates increasing to approximately 81% in October of 2020 and 80% in the third quarter of 2020, up from approximately 61% in the second quarter of 2020.\n\nMall portfolio occupancy, including closed centers, was 90.8% at September 30, 2020, compared to 91.3% at June 30, 2020.   \n\nMall tenant annual sales per square foot for the portfolio was $718 for the twelve months ended September 30, 2020, compared to $800 for the twelve months ended September 30, 2019. This sales metric excludes the period of COVID-19 closure for each tenant.\n\nAverage rent per square foot increased 1.8% to $62.29 at September 30, 2020, compared to $61.16 at September 30, 2019.\n\nApproximately 93% of the square footage that was open prior to COVID-19 is now open and operating. \n\nCash receipts continued to improve, increasing to approximately 80% in the third quarter of 2020 from approximately 61% in the second quarter of 2020. \n\nAs of November 2, 2020, the Company has collected approximately 81% of rent for October. \n\nWith continued improvement in operating cash flow, liquidity also continued to improve. \n\nCash and cash equivalents increased from $573 million at June 30, 2020 to $630 million as of September 30, 2020.\n\nBottom line, this company is getting healthier and owns prime real-estate, with stimulus and vaccines upon us - the animal spirits are ready to be unleashed. \n\nWhat I like THE MOST above the value is the potential short squeeze that is coming (re: $GME and dare I say $TSLA). \n\nShort Interest (Shares Short)\n80,670,000\n\nShort Interest Ratio (Days To Cover)\n14.7\n\nShort Percent of Float\n58.46 %\n\nShares Float\n137,990,000\n\nLastly, I put this together for everyone that has said I’m just a “steel pumper”.\n\nI’m anything but. \n\nI believe Tech has had its year in 2020. \n\n2021 will be the year of finding value with all of the current stretched valuations. \n\nCommodities, travel, shopping, real estate - they will all benefit from a weakened dollar, vaccines, stimulus and low interest/borrowing rates. \n\nGood luck and do your own research."
  },
  {
   "Title": "$MP mega-DD -- MP Materials: The Money Printer --EV/Renewable Infrastructure and REEEEEEEEEE's",
   "#Comments": 109,
   "Score": 1,
   "Symbols": [
    "$QS",
    "$MP",
    "$NIO",
    "$TSLA",
    "$FVAC",
    "$HD"
   ],
   "Selftext": "WARNING: 8TH GRADE READING LEVEL REQUIRED FOR MATERIAL\n\n# Intro/Disclaimer\n\nyeah its long as fuck, but read for tendies. If its too long suck a bear dick and move on. This is real analysis of the business model, not just a bunch of emojis. It is so long because of the niche field it is operating in and how a lot of key points are not understood well by the WSB community. This company really is a diamond in the rough and a great way to play future trends with less risk as you're not picking winners. Its the \"picks and shovels\" play of electrification and renewable energies. I'll explain the realistic case for how this company is soon going to be running the best tendie mine for decades to come.\n\nThis is my second DD post on now $MP, formerly $FVAC, and i'm back to discuss the developments of the company since my pre-merger post and add some further analysis about the valuation of the company and its future. **There has been too much really shitty DD** from both bulls and bears **on this company**where very few people on here have a real understanding of this company, their business model, and the future.\n\nFirst - read my original DD post in order to have a decent understanding of the backstory cause I'm not about to type out all that shit again or explain what I've already written. Read that first then come back:\n\n[https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac\\_dd\\_evchina\\_tension\\_play/](https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac_dd_evchina_tension_play/)\n\nThat post discusses mainly international tensions and the role REE's but this one i'll speak more on the business case of this company and how even without geopolitical tensions it is a true tendie mine.\n\nSecond - no I'm not a bag holder Ive been in since it was a pre-merged SPAC my average on my shares is about $14 and my LEAP is far far ITM and no I'm not selling any of them. Also, as i referenced in the post I work in a very similar field and interned in college at a mineral mine in the refining aspect as a chemical engineer, so while I'm not an expert at this I have more insight than the average retard and I am trying to give out tendies before the boomers take them from us. I will try my best to explain the business model of a mining company and why this company is the most unique and interesting way to get tech company level growth with the associated free cash flow while not having to be anywhere near as innovative. Ill discuss a lot of the bear arguments for this company as well and try to de-bunk them as most don't really hold water once you look into them the slightest bit.\n\n# Background of NdPr\n\nWhile the company produces as basket of Rare Earth, the plant is aiming to focus on NdPr and other permanent magnet materials in order to play the trend of EV's and electrification. These magnets are extremely important for so many technologies due to how Electric motors work. To put it simply, at current technology the only way to convert electricity to motion or the only way to convert motion to electricity relies on permanent magnets. Im not gonna try to explain more than that because I too am retarded but if you don't believe me or want to learn how watch this  [video](https://www.youtube.com/watch?v=CWulQ1ZSE3c):\n\nyeah i know you didn't watch that video, but just imagine you did and now believe me.\n\nHowever, because it works both ways BOTH electric motors AND electric generators rely on this technology. This is key for understanding how NdPr is the best way to play both the trends of electrification AND renewables. First, electrification is most embodied by the rise in EV's in the future, and while that is predicted to be the fastest growing segment of NdPr demand it is foolish to not to account for other evolving technologies reliant on electric motors as well. Robotics will be a huge growth market and electrification of other industries will rely on NdPr permanent magnets. The other massive growth opportunity for permanent magnets is through renewable energies. Wind energy (and possible future motion based energy harvesting tech like tidal energy) work through harvesting mechanical motion and turning a generator to create electricity. Wind power doesn't work without electric generators which don't work without magnets. In addition, wind tech is advancing down a path to require even more magnets due to improvements is Permanent Magnet Direct-Drive (PMDD) technology from the current Gearbox doubly-fed induction Generator (DFIG). Essentially what that means is the new technology will take out the gearbox currently used in wind mills and replacing them with more efficient direct driving technology allowing more mechanical motion into electricity. These new generators require stronger magnets, thus more magnetic material. Read more about that [here](https://www.goldwindamericas.com/pmdd):\n\n**TLDR**: They mine mainly permanent magnet materials that at current scientific understanding CANNOT be replaced due to their unique electromagnetic properties.\n\n**TLDR on the TLDR**: Special Rocks no replacing. Need special rocks.\n\n# $MP's expansion plans\n\nA lot of bears like to bring up the fact that $MP is still reliant on China to do their refining and they're correct... for now. Currently they mine on site and refine to REE concentrates which they then send to china to refine into Rare Earth Oxides (REO's), which then get send to become metal alloys and then finally to magnets. Currently is the only location in the world to refine past concentrate material so $MP is forced to send their material there, but that is why the went public. The intent of them going public was to raise funds in order build an on-site REO facitility, which is scheduled for completion in 2022 and is already started. They already have enough cash on hand to furnish this upgrade as they had over $500M on hand at the end of Q3, and they also are a cash flow positive company already before even moving downstream. There are EV infrastructure plays with much worse valuations and years away from breaking even on cash flow, yes I'm talking to you $QS bagholders... that tech is unproven and there are so many battery competitors in a field where there WILL be a winner\n\nWhy would they want to move downstream when they're already profitable??? Because the further downstream they go the higher margins they earn and the more tendies they can mine for us. Refining raw materials to useful materials is a value adding process and thus creates more value for the company that does it. Once they complete this expansion they plan on going to stage 3 of their business model, the ability to build magnets and other final products of REE's in America. They have not decided/disclosed their plans for this, whether it is through construction of an onsite facility, an acquisition, or a joint venture, but it is in the plans. This is expected to come online around 2025 and when the insane cash flow can begin for the company. I don't have any reason to doubt the validity of their intention as its just a continuation of the business model they are currently implementing and the majority of the corporate rhetoric is related to \"mine-to-magnet\" and \"restoring the REE supply chain to America.\"\n\nWhat does this mean for the company? as they move further and further downstream they will increase their margins from this action alone, but it gets even better. This can be shown in their in-house calculations of their 2023 adj. EBITDA target of $252M\n\n&amp;#x200B;\n\n*Processing img 7eiobfp84f961...*\n\nit is important to note that those numbers are from the current step they are taking right now in building the REO refining facility. Adding further downstream capabilities will only cause that EBITDA value to grow as margins improve, but next I'll discuss where their margins will improve from EVEN MORE.\n\n**TLDR**: downstream expansion is a way to increase margins and therefore free cash flow for the company.\n\n**TLDR of TLDR**: Special rock get more special. Get more tendies for special rock.\n\n# Business model of mining companies and why $MP has insane growth potential\n\n*\\*\\*\\*This is the most important part of this long ass post, if you read one section, then read this\\*\\**\n\nA big disconnect on a lot of DD in this sub and analysis elsewhere is the economics of how a mining company works. A mine is by definition a COMMODITY PLAY, which I know is not as exciting as a tech company, BUT it will experience tech sector growth for a period of time and then experience a period of time in which develop into a cash cow business reaping huge dividends for shareholders.\n\nWhat i mean by a commodity play is through the economics of how a mine operates. Given a mine at a fixed production volume, the costs on a year in year out basis are relatively similar. What i mean by this is the cost $MP to mine and refine into concentrate will be the same no matter the price of their product. However, the revenue they receive is dependent on the market price of their product, which is what varies the most. An easy way to describe this is through taking a look at their Q3 2020 financial results presentation:\n\n&amp;#x200B;\n\n*Processing img ijzcpgmc4f961...*\n\nThat value of Production cost (at the current stage of just creating REE concentrates) will realistically stay the same as that value is from the cost of labor, energy for machinery, administrative costs, etc. While these numbers will vary from quarter to quarter these are costs not predicted to experience rapid growth and this is what is important to realize. It costs roughly the same amount of money to pay someone to blast ore, dig it into dump trucks, pay operators to refine into ore, etc. Don't trust me, look into how steel companies operate, like this sub's favorite $MT. The revenue they receive is dependent on the price of REE's, which is NOT PREDICTED TO BE FLAT. Here is the historic graph of Neodymium from 2011-current:\n\n&amp;#x200B;\n\n*Processing img q1ytv5ch4f961...*\n\n\\*\\*If you are an investor in $MP (which you should be) this is an important website to pay attention to because understanding the market dynamics of their product is important to understanding the valuation of this company. \\*\\*\n\nAllow me to disect that graph a little bit:\n\n1st Peak: From the aftermath of the supply shock from 2010/2011 from the Japanese Navy and Chinese fisherman story i discusses in my previous $FVAC post i linked above. China lowered exports by 40% and the price shot up drastically as industries across the world tried to gobble up as much NdPr as fast as possible in order to ensure their production lines. That was then followed by china flooding the market and selling back that backlog. that caused prices to fall off a cliff and ended up taking molyorp out of business. I'll discuss the Molycorp saga later more in depth and the differences of them and $MP.\n\n2nd Peak: This peak (late 2017) is from the Trade war trump caused with china and is another good explanation of the correlation between REE's and geopolitics i discussed in my last DD post. The middle 2019 peak is again the trade war heating up again.\n\n3rd peak: where we are now. This is from the increased tailwind of EV adoption, more from asia and Europe than the US **and** because china has been threatening to use REE's as a political tool again, which again i referenced more in my last DD post.\n\nHowever going forward if you want to predict the amount of revenue MP will earn its important to understand the market dynamic and I'd like to discuss why the price is geopolitics aside predicted to steadily increase at a very fast rate. MP, like any other commodity play, relies on the supply-demand dynamic of the sector, and REE demand growth is on track to far outstrip the supply growth. This will result increased prices per ton, but MP's costs stay the same. This is the beauty of the company, as the price goes up their margins go up too! MP and market analysts predicted over a 100% growth in NdPr magnets in the next 10 years:\n\n&amp;#x200B;\n\n*Processing img v0ta2r1l4f961...*\n\nDon't believe that metric? check this more in depth one:\n\n&amp;#x200B;\n\n*Processing img 7kjnncgn4f961...*\n\nThis graph shows most important metric as it shows that the world at current rate is not scaling up to meet demand. THIS GRAPH INCLUDES CURRENT PLANNED EXPANSIONS INCLUDING INCREASED RECYCLING. What does this mean?? There is a huge mismatch in projected demand and supply and if you don't know what that will mean then ask your wife's boyfriend about supply-demand graphs from their economics class. The result will be massively increased prices of permanent magnet materials because the world will not be able to mine and refine enough to satisfy demand, so they will be able to increase their prices. BUT AS I SAID EARLIER, MP'S COSTS PER TON WILL REMAIN THE SAME. So what is the gist of this coupled with MP moving toward downstream expansion? MP's margins will increase incredibly from a double whammy of moving downstream AND supply-demand imbalance. Now what does that mean for you?? that means $MP has a very realistic and conservative path toward becoming a company with RIDICULOUS free cash flow.\n\nWhat does that mean for MP? That means that the company will be raking in cash and will be extremely flexible due to their balance sheet. They will be able to expand operations or acquire competitors in order to increase their market share and production volumes OR they will be able to transition into a boomer dividend company that will pay you tendies each year. They could do either of those very easily because the company HAS NO DEBT. In fact, $MP ended Q3 2020 with $507M CASH on hand to finance their future expansions. Okay, i know dividends are boring but the market will begin to price in that future dividend potential and give your calls many tendies along the path to pricing in their dividend power.\n\n**TLDR**: Supply demand imbalance (with geopolitical tensions as a wild card) will result in insane free cash flow in the future for this company.\n\n**TLDR of the TLDR**: People want more special rock more than can make special rock. People give you more tendies for special rocks.\n\n# Why Supply won't be able to scale up as fast\n\nA very important assumption in my analysis is the inability for supply to scale up as fast as demand and I'd like to explain this more in depth as it is the crux of this DD. This is where my experience in mineral refining is valuable as I can weigh in on this aspect. Over time there will be more suppliers that come into the business and we are seeing that already, however this is where the timetables of that come into play. Simply put supply can't go up because companies will be slowed greatly due to the time it will take to get up and running and the incredible amount of upfront capital needed before even starting up the mine. If a company is interested in getting into the field there isn't a fast path in because the companies can't just decide to go into the business and then go to the \"REE refining machinery store\" and buy the equipment and have them get set up. All the machinery in chemical manufacturing plants (REE refining counts as chemical engineering so hear me out) has a long path in order to reach the optimum design. Ill outline the gist of this here:\n\n1. Lab Scale Testing: This is laboratory scale testing in which very small batches are prepared testing different procedures and methods in order to find the optimum refining process for the goals of the operation. This is when the deciding of the catalysts, solvents, additive chemicals, etc is done in order to decide **what to do** to the ore to get the best product.\n2. Pilot Plant Design and Testing: This step in the design process is designing and building a small scale model of machinery to run the process decided upon in lab scale testing in order to determine different operating conditions, determine control points, etc. This is when different tests and procedures are determined and also a proof of concept to begin economic calculations for designing the next step.\n3. Full scale design and building: This is when the full size, real-deal machinery is designed and constructed. But again, there is not \"REE refining manufacturing store\" to get much of this machinery. Refining plants are custom designed (minus certain machinery like pumps and basic ass shit like that) and custom built. These are custom designed, custom fabricated large scale machinery designed in every aspect from material, area, volume, and depth in order to lower manufacturing costs while also allowing for 24/7 continuous operation. The 24/7 operation aspect is important because it is why the machinery is designed so meticulously. The most economic operations are ones that require little down time and little maintenance and a lot of work is put in to optimize this aspect. That means it takes even more time to produce.\n4. Permitting and Certification: Now at this point the company is years into the development of REE refining, but they still can't start operating despite the entire operation up and running. In the US, now the lovely and very fast government gets to come in. Mining and refining operations don't operate under OSHA rules and procedures, they get to operate under OSHA's much meaner, expensive, and safety prone brother, the Mining Safety and Health Administration (MSHA). Government inspectors have to come in and permit and certify EVERY PIECE OF MACHINERY, inspect every single moving part and permit them, and do a shit ton of other stuff for the government to allow you to begin operations. Now due to the stimulus bill's provisions toward stimulating REE capabilities in the United states I assume that MSHA will be (or already has been) told to prioritize REE companies and they will probably be fast tracked, but even fast tracking them will take a lot of time. In addition EPA has to come in and sign off on the environmental plans of the company and probably even more government entities will have to come in to sign off on stuff that was past my exposure when I interned in the field.\n\nNow you've seen how long it would take to get up and running, but another constraint worth mentioning is who does these? Larger Chemical or mining companies (Dow, DuPont, Chemours, BASF, etc) looking to enter the field probably have their own design teams that would be able to do it in house. Smaller, non-conglomerate entities would have to hire a chemical engineering design/consulting firm to come in and do the designing, write the procedures, and train the production engineers and operators. That means there is some decent intellectual constraints as to how many people have the know-how to design at the rate needed to scale up.\n\n**Here is what is important,** any entity trying to enter the sector will have enormous upfront costs in buying the land, designing the plant, buying the machinery like excavators, dump trucks, pipelines, pay employees well before starting due to training on the machinery. Im not sure the exact amounts of money needed but it would easily be in the 100s of millions at least. Then once all that upfront capital is sourced, plant designed, people trained, etc the operation would take YEARS to get out of all that debt and achieve meaningful positive cash flow. It is only a matter of time for $MP to have significant domestic competition, but by the time these operations could begin operating $MP will be so far ahead in production and have a significantly stronger balance sheet than these companies could have. **$MP will remain years ahead of any other domestic competitors**, even though competition will come.\n\n**TLDR**: At current outlook supply growth won't match demand growth and even if more competitors pop up to compete it'll take years to start operating and even more years to match $MP's ability.\n\n**TLDR on the TLDR**: Not enough people finding special rock. More people want special rock than can get special rock. They pay more for special rock.\n\n# $MP's competitors, both domestic and international\n\nA large argument that bears like to make is that competition is coming in the US, and they are 100% correct.... but it won't matter because AGAIN this is a commodity play, not a tech company. They make magnets, their revenue will depend on the price of their product. Buyers from this are not looking at $MP like you would look at $TSLA vs. $NIO or apple vs android where you could argue one is better than the other or consumers will adopt one over the other. There isn't brand recognition, increased utility, or consumer favorites in magnets, they're fucking magnets. Think about it like another commodity, lumber. If you go to $HD to buy some wood you aren't staring at two different planks of the same type of tree and picking one because of which timber company felled it or which milling company milled it. You just buy lumber and go home because it is wood. A timber company isn't outright threatened by another timber company popping up, as long as the demand-supply dynamic in the market stays the same the first timber company is unaffected. That is why it won't matter WHEN more domestic and international competitors pop up. As long as demand outstrips supply then commodity companies will make more and more money. Now I am not trying to bullshit people so I'll discuss the international and domestic competition, but Ill explain more in depth why i don't give a shit about them.\n\nDomestic: The ticker that cannot be named due to it being banned. If you take a look at that company it is a Uranium producer that is going to re-purpose machinery onsite from uranium production to REE production and they have successfully done pilot plant level processing. However if you analyze their production numbers you'll see that the scale they plan on producing is not quite at the level $MP will. They plan on refining 15,000 tons of ore per year with an estimated 55% REE concentration, which leaves an estimated 8,250 tons of REE per year, of which 22% is NdP (all their numbers not mine), which leaves annual production of 1,815 tons/yr. These numbers are pretty good and I do own a stake in this company because I like the potential, but its scale is not quite the scale of $MP. $MP is predicting a run rate of 6,075 tons/yr of NdPr, so yes the banned ticker is a decent competitor but its only predicting to be 1/3 the size of $MP annual production volume. A downside of the banned ticker is that they still are focusing on Uranium production so its not a pure REE play, but Uranium has a pretty decent bull case for the future so i don't want to slander that ticker too much. However, again, these are commodity plays, $MP having competition, even domestic, doest really affect their business plans or bull case. Additionally, the banned ticker is sourcing its ore rom Chemours' location in GA, but getting milled in Utah, so this is a long term inefficiency to consider as well that $MP won't have to worry about once their stage 2 REO mill is complete. the banned tickers financial health is pretty decent, but its market cap is $516M at close 1/4 which is just slightly above amount of cash on hand $MP had at the end of Q3 2020, $502M. That company is more of an investment opportunity than a competitor, if its even worth investing in.\n\nOther emerging domestic competitors: [link to article explaining them all](https://www.reuters.com/article/us-usa-rareearths-projects-factbox/factbox-rare-earths-projects-under-development-in-u-s-idUSKCN2241L6) Im not going to go deep into each one but you can see that many are slowed down to the process I explained above about how expensive and time consuming it is to reach operational status. These companies will be coming online, but won't be profitable for a while and won't be able to provide the same returns to investors for even longer.\n\nInternational competitors: Lynas Corp. This is an Australian mining company that has also received pentagon funds to improve the non-China production capacity. They trade over the counter and are a real deal competitor and also worth investing in but their growth potential isn't as clear or easy as in the US. They have pentagon funding more so out of desperation by the pentagon to get more production in the western world than loving to invest in an Australian company. In the future I would imagine a lot of this government support will go toward US based companies.\n\nInternational competitors: all the china ones. yes they produce the largest amount of material in the world and do it the cheapest but this is the result of none to very little environmental protection. Once the supply chain can go \"mine to magnet\" many companies will look to diminish their exposure to chinese companies to ensure their supply chains are not at the whims of the Chinese government. In addition, $MP is the cleanest REE mine in the world and a lot of environmentally conscious companies will want to support clean mined REE's and once domestic production is high enough there could be regulations passed to further incentivize purchasing domestically produced REE's.\n\n**All these companies were included in the forecast of supply in 2030. Even with these companies coming online $MP is still positioned for incredible returns.**\n\n**TLDR**: Yes competition is coming, but there is already competition. Its also a commodity play so its not facing replacement or redundancy like many other growth markets\n\n**TLDR on the TLDR**: Others find special rock. Your special rock still worth many tendies. You still get many tendies.\n\n# Why this is NOT molycorp 2.0\n\nThe most common point of argument against this company is that people bring up the fact that the mine $MP operates used to be run by Molycorp, which went bankrupt. However if you read into that transaction it really isn't that scary. Molycorp did go under but this was in a period of price instability and they were not running as good of an operation. Molycorp operated during the 2010-2011 peak of REE's when china restricted supply. Molycorp stock went up a ton in addition to their revenue and thus they decided to invest in milling capabilities to create REO's (I know this is $MP's plan but don't get scared yet). Because of US EPA restrictions it was wildly expensive and at bankruptcy they had $1.7B in investments into capital projects to improve their refining capability, but the subsequent REE price collapse when china \"turned the taps back on\" to the world supply caused them to not afford operation. The site then changed hands back and forth until it was [bought by $MP's current management for $40M](https://en.wikipedia.org/wiki/Molycorp). They then invested in it after literally buying for less than pennies on the dollar and got it up and running more efficiently than before. Last quarter Q3 2020 they ran 3.2x the REE concentrate production volume than Molycorp ever did:\n\n&amp;#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/c53c5a8w4f961.png?width=704&amp;format=png&amp;auto=webp&amp;s=5a5d9f65cad202807588fe516b399ca954cef08a)\n\nThey got to buy over $1.7B worth of investments for $40M and have proven they have turned those investments into operating profit. In addition, previous operations prioritized Cerium production for FCC catalysts. $MP has transitioned the goal product to be NdPr as it has much better growth potential to give it long term possibility. In addition, the market climate Molycorp operated under was not as forgiving as now. Back then there wasn't the tailwind of increasing EV adoption, or the rise of other high tech growth sector reliant on REE's. Molycorp was too early and inefficient to win in the market and didn't have anywhere close to the amount of governmental support for the industry. There is bipartisan support on all levels, i mentioned this a bit in my last DD post, but since then - and this is big and shows the scale of gov support- [THE LAST STIMULUS BILL HAD $800M IN SUPPORT OF INCREASING DOMESTIC REE PRODUCTION](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/miners-laud-800m-rare-earth-fund-in-omnibus-bill-61939620)! Molycorp didn't have anywhere close to this level of government support. And again, the pentagon invested $9M into $MP to help fund their REO mill because the pentagon views the ability to refine REO's as a matter of national security.\n\n# Discussing Concerns about Biden Presidency\n\nPeople who say this shit clearly have no idea what they are talking about. Biden (or his puppet masters but who cares money is all green) has said he supports REE mining multiple times [source](https://www.reuters.com/article/usa-election-mining/exclusive-biden-campaign-tells-miners-it-supports-domestic-production-of-ev-metals-idUSKBN27808B). His team knows their big environmental initiatives rely on REE production and that domestic production is important to keep American industry at the whims of China. Yeah Trump was more hawkish with china but lets not act like a democratic presidency is going to let china walk all over the US or that Biden and other democrats will stop their push for EV's and clean energy. REE's are a cornerstone piece to so many of Biden's plans there is no way he turns his back on this company.\n\n# Discussion of Shenghe Resources and China and their relationships with $MP\n\nThe one real concern that people have is their partnership with Shenghe Resources where Shenghe has agreed to buy all $MP concentrate through 2021 and shenghe is a stakeholder in $MP. Many view this as a negative, but i think it should be seen as a good way to ensure survival in the gap between now and the final magnet production. A big issue would be if China chose to stop importing the MP concentrate, which would give MP no customers. Since this would adversely affect Shenge it makes it less likely and also the fact that MP produces 15% of the world's REE concentrate it would hurt the supply in china, which is huge. In fact, China removed their 25% tariff on importing REE material, read this [source](https://www.argusmedia.com/en/news/2104418-china-to-remove-import-tariff-on-us-rare-earth-ores) as it also shows how china is buying up all the concentrate they can. Japan has the capability to go from REO to NdPr magnet as well so if china ends up fucking MP, starting in 2022 when their REO site is in operation then they will be able to sell their REO to Japanese companies to bridge the gap before they have their own magnet making capability.\n\n&amp;#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/fnvxv8415f961.png?width=2494&amp;format=png&amp;auto=webp&amp;s=67a5db04a13d3e1c32d0f20de57b0f291e5b841a)\n\nChina is not likely to fuck MP and stop buying their concentrate as it will hurt china's wallet and ability to produce goods while only increasing the US government support for going mine to magnet domestically. China realistically views their dominance as ending at some point now, but they know they will still be able to control the market because of their scale regardless of whether they buy MP concentrates or not.\n\nAlso, if Shenghe doesn't buy their concentrates then they forfeit their stake in MP. they wouldn't be allowed to sell them on the market, the shares would just disappear, so it would effectively be a massive stock buyback and as long as the REO mill is complete then they just sell to Japanese magnet makers.\n\n# Mine Life discussion\n\nTheir S-1 states that at current proven reserves they have about 47 years of mine life left. That can be grown from drilling and exploration of more mineable material, which they stated they plan on doing. in addition, if they for some reason don't find more mineable ore on their land and don't buy more land with ore, then they could simply refine ore from other mines as the real cost barrier isn't the digging out of the ground, it is the milling.\n\n# TLDR\n\n$MP will to the moon over the next few years.\n\nPostions: shares for virgins and LEAPs for chads."
  },
  {
   "Title": "$MP mega-DD -- MP Materials: The Money Printer --EV/Renewable Infrastructure and REEEEEEEEEE's",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$QS",
    "$MP",
    "$NIO",
    "$TSLA",
    "$FVAC",
    "$HD"
   ],
   "Selftext": "WARNING: 8TH GRADE READING LEVEL REQUIRED FOR MATERIAL\n\n# Intro/Disclaimer\n\nyeah its long as fuck, but read for tendies. If its too long suck a bear dick and move on. This is real analysis of the business model, not just a bunch of emojis. It is so long because of the niche field it is operating in and how a lot of key points are not understood well by the WSB community. This company really is a diamond in the rough and a great way to play future trends with less risk as you're not picking winners. Its the \"picks and shovels\" play of electrification and renewable energies. I'll explain the realistic case for how this company is soon going to be running the best tendie mine for decades to come. \n\n&amp;#x200B;\n\nThis is my second DD post on now $MP, formerly $FVAC, and i'm back to discuss the developments of the company since my pre-merger post and add some further analysis about the valuation of the company and its future. **There has been too much really shitty DD** from both bulls and bears **on this company** where very few people on here have a real understanding of this company, their business model, and the future. \n\nFirst - read my original DD post in order to have a decent understanding of the backstory cause I'm not about to type out all that shit again or explain what I've already written. Read that first then come back:\n\n[https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac\\_dd\\_evchina\\_tension\\_play/](https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac_dd_evchina_tension_play/)\n\nThat post discusses mainly international tensions and the role REE's but this one i'll speak more on the business case of this company and how even without geopolitical tensions it is a true tendie mine.\n\nSecond - no I'm not a bag holder Ive been in since it was a pre-merged SPAC my average on my shares is about $14 and my LEAP is far far ITM and no I'm not selling any of them. Also, as i referenced in the post I work in a very similar field and interned in college at a mineral mine in the refining aspect as a chemical engineer, so while I'm not an expert at this I have more insight than the average retard and I am trying to give out tendies before the boomers take them from us. I will try my best to explain the business model of a mining company and why this company is the most unique and interesting way to get tech company level growth with the associated free cash flow while not having to be anywhere near as innovative. Ill discuss a lot of the bear arguments for this company as well and try to de-bunk them as most don't really hold water once you look into them the slightest bit.\n\n# Background of NdPr\n\nWhile the company produces as basket of Rare Earth, the plant is aiming to focus on NdPr and other permanent magnet materials in order to play the trend of EV's and electrification. These magnets are extremely important for so many technologies due to how Electric motors work. To put it simply, at current technology the only way to convert electricity to motion or the only way to convert motion to electricity relies on permanent magnets. Im not gonna try to explain more than that because I too am retarded but if you don't believe me or want to learn how watch this  [video](https://www.youtube.com/watch?v=CWulQ1ZSE3c):\n\nyeah i know you didn't watch that video, but just imagine you did and now believe me.\n\n However, because it works both ways BOTH electric motors AND electric generators rely on this technology. This is key for understanding how NdPr is the best way to play both the trends of electrification AND renewables. First, electrification is most embodied by the rise in EV's in the future, and while that is predicted to be the fastest growing segment of NdPr demand it is foolish to not to account for other evolving technologies reliant on electric motors as well. Robotics will be a huge growth market and electrification of other industries will rely on NdPr permanent magnets. The other massive growth opportunity for permanent magnets is through renewable energies. Wind energy (and possible future motion based energy harvesting tech like tidal energy) work through harvesting mechanical motion and turning a generator to create electricity. Wind power doesn't work without electric generators which don't work without magnets. In addition, wind tech is advancing down a path to require even more magnets due to improvements is Permanent Magnet Direct-Drive (PMDD) technology from the current Gearbox doubly-fed induction Generator (DFIG). Essentially what that means is the new technology will take out the gearbox currently used in wind mills and replacing them with more efficient direct driving technology allowing more mechanical motion into electricity. These new generators require stronger magnets, thus more magnetic material. Read more about that [here](https://www.goldwindamericas.com/pmdd):\n\n**TLDR**: They mine mainly permanent magnet materials that at current scientific understanding CANNOT be replaced due to their unique electromagnetic properties.\n\n**TLDR on the TLDR**: Special Rocks no replacing. Need special rocks.\n\n# $MP's expansion plans\n\nA lot of bears like to bring up the fact that $MP is still reliant on China to do their refining and they're correct... for now. Currently they mine on site and refine to REE concentrates which they then send to china to refine into Rare Earth Oxides (REO's), which then get send to become metal alloys and then finally to magnets. Currently is the only location in the world to refine past concentrate material so $MP is forced to send their material there, but that is why the went public. The intent of them going public was to raise funds in order build an on-site REO facitility, which is scheduled for completion in 2022 and is already started. They already have enough cash on hand to furnish this upgrade as they had over $500M on hand at the end of Q3, and they also are a cash flow positive company already before even moving downstream. There are EV infrastructure plays with much worse valuations and years away from breaking even on cash flow, yes I'm talking to you $QS bagholders... that tech is unproven and there are so many battery competitors in a field where there WILL be a winner\n\nWhy would they want to move downstream when they're already profitable??? Because the further downstream they go the higher margins they earn and the more tendies they can mine for us. Refining raw materials to useful materials is a value adding process and thus creates more value for the company that does it. Once they complete this expansion they plan on going to stage 3 of their business model, the ability  to build magnets and other final products of REE's in America. They have not decided/disclosed their plans for this, whether it is through construction of an onsite facility, an acquisition, or a joint venture, but it is in the plans. This is expected to come online around 2025 and when the insane cash flow can begin for the company. I don't have any reason to doubt the validity of their intention as its just a continuation of the business model they are currently implementing and the majority of the corporate rhetoric is related to \"mine-to-magnet\" and \"restoring the REE supply chain to America.\" \n\nWhat does this mean for the company? as they move further and further downstream they will increase their margins from this action alone, but it gets even better. This can be shown in their in-house calculations of their 2023 adj. EBITDA target of $252M\n\n&amp;#x200B;\n\n[Q3 Investors Presentation: https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/ro8md6f9wd961.png?width=1258&amp;format=png&amp;auto=webp&amp;s=c91a7f6f274b9b479bf68dce9310b29149ec7ced)\n\nit is important to note that those numbers are from the current step they are taking right now in building the REO refining facility. Adding further downstream capabilities will only cause that EBITDA value to grow as margins improve, but next I'll discuss where their margins will improve from EVEN MORE. \n\n**TLDR**: downstream expansion is a way to increase margins and therefore free cash flow for the company.\n\n**TLDR of TLDR**: Special rock get more special. Get more tendies for special rock.\n\n# Business model of mining companies and why $MP has insane growth potential\n\n*\\*\\*\\*This is the most important part of this long ass post, if you read one section, then read this\\*\\**\n\nA big disconnect on a lot of DD in this sub and analysis elsewhere is the economics of how a mining company works. A mine is by definition a COMMODITY PLAY, which I know is not as exciting as a tech company, BUT it will experience tech sector growth for a period of time and then experience a period of time in which develop into a cash cow business reaping huge dividends for shareholders. \n\nWhat i mean by a commodity play is through the economics of how a mine operates. Given a mine at a fixed production volume, the costs on a year in year out basis are relatively similar. What i mean by this is the cost $MP to mine and refine into concentrate will be the same no matter the price of their product. However, the revenue they receive is dependent on the market price of their product, which is what varies the most. An easy way to describe this is through taking a look at their Q3 2020 financial results presentation:\n\n&amp;#x200B;\n\n[Q3 Investors Presentation: https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/yjhiqbafxd961.png?width=760&amp;format=png&amp;auto=webp&amp;s=6c1420d95601e889a18b79d43e5a07e177d03165)\n\nThat value of Production cost (at the current stage of just creating REE concentrates) will realistically stay the same as that value is from the cost of labor, energy for machinery, administrative costs, etc. While these numbers will vary from quarter to quarter these are costs not predicted to experience rapid growth and this is what is important to realize. It costs roughly the same amount of money  to pay someone to blast ore, dig it into dump trucks, pay operators to refine into ore, etc. Don't trust me, look into how steel companies operate, like this sub's favorite $MT. The revenue they receive is dependent on the price of REE's, which is NOT PREDICTED TO BE FLAT. Here is the historic graph of Neodymium from 2011-current: \n\n&amp;#x200B;\n\n*Processing img yjvqqeb5yd961...*\n\n\\*\\*If you are an investor in $MP (which you should be) this is an important website to pay attention to because understanding the market dynamics of their product is important to understanding the valuation of this company. \\*\\*\n\nAllow me to disect that graph a little bit:\n\n1st Peak: From the aftermath of the supply shock from 2010/2011 from the Japanese Navy and Chinese fisherman story i discusses in my previous $FVAC post i linked above. China lowered exports by 40% and the price shot up drastically as industries across the world tried to gobble up as much NdPr as fast as possible in order to ensure their production lines. That was then followed by china flooding the market and selling back that backlog. that caused prices to fall off a cliff and ended up taking molyorp out of business. I'll discuss the Molycorp saga later more in depth and the differences of them and $MP. \n\n2nd Peak: This peak (late 2017) is from the Trade war trump caused with china and is another good explanation of the correlation between REE's and geopolitics i discussed in my last DD post. The middle 2019 peak is again the trade war heating up again.\n\n3rd peak: where we are now. This is from the increased tailwind of EV adoption, more from asia and Europe than the US **and** because china has been threatening to use REE's as a political tool again, which again i referenced more in my last DD post.\n\nHowever going forward if you want to predict the amount of revenue MP will earn its important to understand the market dynamic and I'd like to discuss why the price is geopolitics aside predicted to steadily increase at a very fast rate. MP, like any other commodity play, relies on the supply-demand dynamic of the sector, and REE demand growth is on track to far outstrip the supply growth. This will result increased prices per ton, but MP's costs stay the same. This is the beauty of the company, as the price goes up their margins go up too! MP and market analysts predicted over a 100% growth in NdPr magnets in the next 10 years:\n\n&amp;#x200B;\n\n*Processing img 1q97aczw1e961...*\n\nDon't believe that metric? check this more in depth one:  \n\n\n[source: https:\\/\\/www.arultd.com\\/products\\/supply-and-demand.html](https://preview.redd.it/i9ekm3vh2e961.jpg?width=6279&amp;format=pjpg&amp;auto=webp&amp;s=add6e8adf823297fa701d25d31319422b7ab5696)\n\nThis graph shows most important metric as it shows that the world at current rate is not scaling up to meet demand. THIS GRAPH INCLUDES CURRENT PLANNED EXPANSIONS INCLUDING INCREASED RECYCLING. What does this mean?? There is a huge mismatch in projected demand and supply and if you don't know what that will mean then ask your wife's boyfriend about supply-demand graphs from their economics class. The result will be massively increased prices of permanent magnet materials because the world will not be able to mine and refine enough to satisfy demand, so they will be able to increase their prices. BUT AS I SAID EARLIER, MP'S COSTS PER TON WILL REMAIN THE SAME. So what is the gist of this coupled with MP moving toward downstream expansion? MP's margins will increase incredibly from a double whammy of moving downstream AND supply-demand imbalance. Now what does that mean for you?? that means $MP has a very realistic and conservative path toward becoming a company with RIDICULOUS free cash flow. \n\nWhat does that mean for MP? That means that the company will be raking in cash and will be extremely flexible due to their balance sheet. They will be able to expand operations or acquire competitors in order to increase their market share and production volumes OR they will be able to transition into a boomer dividend company that will pay you tendies each year. They could do either of those very easily because the company HAS NO DEBT. In fact, $MP ended Q3 2020 with $507M CASH on hand to finance their future expansions. Okay, i know dividends are boring but the market will begin to price in that future dividend potential and give your calls many  tendies along the path to pricing in their dividend power. \n\n**TLDR**: Supply demand imbalance (with geopolitical tensions as a wild card) will result in insane free cash flow in the future for this company.\n\n**TLDR of the TLDR**: People want more special rock more than can make special rock. People give you more tendies for special rocks.\n\n# Why Supply won't be able to scale up as fast\n\nA very important assumption in my analysis is the inability for supply to scale up as fast as demand and I'd like to explain this more in depth as it is the crux of this DD. This is where my experience in mineral refining is valuable as I can weigh in on this aspect. Over time there will be more suppliers that come into the business and we are seeing that already, however this is where the timetables of that come into play. Simply put supply can't go up because companies will be slowed greatly due to the time it will take to get up and running and the incredible amount of upfront capital needed before even starting up the mine. If a company is interested in getting into the field there isn't a fast path in because the companies can't just decide to go into the business and then go to the \"REE refining machinery store\" and buy the equipment and have them get set up. All the machinery in chemical manufacturing plants (REE refining counts as chemical engineering so hear me out) has a long path in order to reach the optimum design. Ill outline the gist of this here: \n\n1) Lab Scale Testing: This is laboratory scale testing in which very small batches are prepared testing different procedures and methods in order to find the optimum refining process for the goals of the operation. This is when the deciding of the catalysts, solvents, additive chemicals, etc is done in order to decide **what to do** to the ore to get the best product.\n\n2) Pilot Plant Design and  Testing: This step in the design process is designing and building a small scale model of machinery to run the process decided upon in lab scale testing in order to determine different operating conditions, determine control points, etc. This is when different tests and procedures are determined and also a proof of concept to begin economic calculations for designing the next step.\n\n3) Full scale design and building: This is when the full size, real-deal machinery is designed and constructed. But again, there is not \"REE refining manufacturing store\" to get much of this machinery. Refining plants are custom designed (minus certain machinery like pumps and basic ass shit like that) and custom built. These are custom designed, custom fabricated large scale machinery designed in every aspect from material, area, volume, and depth in order to lower manufacturing costs while also allowing for 24/7 continuous operation. The 24/7 operation aspect is important because it is why the machinery is designed so meticulously. The most economic operations are ones that require little down time and little maintenance and a lot of work is put in to optimize this aspect. That means it takes even more time to produce. \n\n4) Permitting and Certification: Now at this point the company is years into the development of REE refining, but they still can't start operating despite the entire operation up and running. In the US, now the lovely and very fast government gets to come in. Mining and refining operations don't operate under OSHA rules and procedures, they get to operate under OSHA's much meaner, expensive, and safety prone brother, the Mining Safety and Health Administration (MSHA). Government inspectors have to come in and permit and certify EVERY PIECE OF MACHINERY, inspect every single moving part and permit them, and do a shit ton of other stuff for the government to allow you to begin operations. Now due to the stimulus bill's provisions toward stimulating REE capabilities in the United states I assume that MSHA will be (or already has been) told to prioritize REE companies and they will probably be fast tracked, but even fast tracking them will take a lot of time. In addition EPA has to come in and sign off on the environmental plans of the company and probably even more government entities will have to come in to sign off on stuff that was past my exposure when I interned in the field. \n\nNow you've seen how long it would take to get up and running, but another constraint worth mentioning is who does these? Larger Chemical or mining companies (Dow, DuPont, Chemours, BASF, etc) looking to enter the field probably have their own design teams that would be able to do it in house. Smaller, non-conglomerate entities would have to hire a chemical engineering design/consulting firm to come in and do the designing, write the procedures, and train the production engineers and operators. That means there is some decent intellectual constraints as to how many people have the know-how to design at the rate needed to scale up.\n\n&amp;#x200B;\n\n**Here is what is important,** any entity trying to enter the sector will have enormous upfront costs in buying the land, designing the plant, buying the machinery like excavators, dump trucks, pipelines, pay employees well before starting due to training on the machinery. Im not sure the exact amounts of money needed but it would easily be in the 100s of millions at least. Then once all that upfront capital is sourced, plant designed, people trained, etc the operation would take YEARS to get out of all that debt and achieve meaningful positive cash flow. It is only a matter of time for $MP to have significant domestic competition, but by the time these operations could begin operating $MP will be so far ahead in production and have a significantly stronger balance sheet than these companies could have. **$MP will remain years ahead of any other domestic competitors**, even though competition will come. \n\n**TLDR**: At current outlook supply growth won't match demand growth and even if more competitors pop up to compete it'll take years to start operating and even more years to match $MP's ability.\n\n**TLDR on the TLDR**: Not enough people finding special rock. More people want special rock than can get special rock. They pay more for special rock.\n\n# $MP's competitors, both domestic and international \n\nA large argument that bears like to make is that competition is coming in the US, and they are 100% correct.... but it won't matter because AGAIN this is a commodity play, not a tech company. They make magnets, their revenue will depend on the price of their product. Buyers from this are not looking at $MP like you would look at $TSLA vs. $NIO or apple vs android where you could argue one is better than the other or consumers will adopt one over the other. There isn't brand recognition, increased utility, or consumer favorites in magnets, they're fucking magnets. Think about it like another commodity, lumber. If you go to $HD to buy some wood you aren't staring at two different planks of the same type of tree and picking one because of which timber company felled it or which milling company milled it. You just buy lumber and go home because it is wood. A timber company isn't outright threatened by another timber company popping up, as long as the demand-supply dynamic in the market stays the same the first timber company is unaffected. That is why it won't matter WHEN more domestic and international competitors pop up. As long as demand outstrips supply then commodity companies will make more and more money. Now I am not trying to bullshit people so I'll discuss the international and domestic competition, but Ill explain more in depth why i don't give a shit about them. \n\nDomestic: The ticker that cannot be named due to it being banned. Hint it is 4 letters long and the only letter in the ticker is U. Put those hints together and its pretty easy to find it. This is the one I've sparred the most with people about in DD posts and I would like to explain how it is a complement play, not a competitor. Here is a link discussing this company's [plans](https://www.streetinsider.com/Corporate+News/Energy+Fuels+%28UUUU%29+Set+to+Enter+Commercial+Rare+Earth+Business+in+Q1/17713617.html). If you take a look at that company it is a Uranium producer that is going to re-purpose machinery onsite from uranium production to REE production and they have successfully done pilot plant level processing. However if you analyze their production numbers you'll see that the scale they plan on producing is not quite at the level $MP will. They plan on refining 15,000 tons of ore per year with an estimated 55% REE concentration, which leaves an estimated 8,250 tons of REE per year, of which 22% is NdP (all their numbers not mine), which leaves annual production of 1,815 tons/yr. These numbers are pretty good and I do own a stake in this company because I like the potential, but its scale is not quite the scale of $MP. $MP is predicting a run rate of 6,075 tons/yr of NdPr, so yes the banned ticker is a decent competitor but its only predicting to be 1/3 the size of $MP annual production volume. A downside of the banned ticker is that they still are focusing on Uranium production so its not a pure REE play, but Uranium has a pretty decent bull case for the future so i don't want to slander that ticker too much. However, again, these are commodity plays, $MP having competition, even domestic, doest really affect their business plans or bull case. Additionally, the banned ticker is sourcing its ore rom Chemours' location in GA, but getting milled in Utah, so this is a long term inefficiency to consider as well that $MP won't have to worry about once their stage 2 REO mill is complete. the banned tickers financial health is pretty decent, but its market cap is $516M at close 1/4 which is just slightly above amount of cash on hand $MP had at the end of Q3 2020, $502M. That company is more of an investment opportunity than a competitor, if its even worth investing in.\n\nOther emerging domestic competitors: [link to article explaining them all](https://www.reuters.com/article/us-usa-rareearths-projects-factbox/factbox-rare-earths-projects-under-development-in-u-s-idUSKCN2241L6) Im not going to go deep into each one but you can see that many are slowed down to the process I explained above about how expensive and time consuming it is to reach operational status. These companies will be coming online, but won't be profitable for a while and won't be able to provide the same returns to investors for even longer. \n\nInternational competitors: Lynas Corp. This is an Australian mining company that has also received pentagon funds to improve the non-China production capacity. They trade over the counter and are a real deal competitor and also worth investing in but their growth potential isn't as clear or easy as in the US. They have pentagon funding more so out of desperation by the pentagon to get more production in the western world than loving to invest in an Australian company. In the future I would imagine a lot of this government support will go toward US based companies. \n\nInternational competitors: all the china ones. yes they produce the largest amount of material in the world and do it the cheapest but this is the result of none to very little environmental protection. Once the supply chain can go \"mine to magnet\" many companies will look to diminish their exposure to chinese companies to ensure their supply chains are not at the whims of the Chinese government. In addition, $MP is the cleanest REE mine in the world and a lot of environmentally conscious companies will want to support clean mined REE's and once domestic production is high enough there could be regulations passed to further incentivize purchasing domestically produced REE's. \n\n**All these companies were included in the forecast of supply in 2030. Even with these companies coming online $MP is still positioned for incredible returns.**\n\n**TLDR**: Yes competition is coming, but there is already competition. Its also a commodity play so its not facing replacement or redundancy like many other growth markets\n\n**TLDR on the TLDR**: Others find special rock. Your special rock still worth many tendies. You still get many tendies.\n\n# Why this is NOT molycorp 2.0\n\nThe most common point of argument against this company is that people bring up the fact that the mine $MP operates used to be run by Molycorp, which went bankrupt. However if you read into that transaction it really isn't that scary. Molycorp did go under but this was in a period of price instability and they were not running as good of an operation. Molycorp operated during the 2010-2011 peak of REE's when china restricted supply. Molycorp stock went up a ton in addition to their revenue and thus they decided to invest in milling capabilities to create REO's (I know this is $MP's plan but don't get scared yet). Because of US EPA restrictions it was wildly expensive and at bankruptcy they had $1.7B in investments into capital projects to improve their refining capability, but the subsequent REE price collapse when china \"turned the taps back on\" to the world supply caused them to not afford operation. The site then changed hands back and forth until it was [bought by $MP's current management for $40M](https://en.wikipedia.org/wiki/Molycorp). They then invested in it after literally buying for less than pennies on the dollar and got it up and running more efficiently than before. Last quarter Q3 2020 they ran 3.2x the REE concentrate production volume than Molycorp ever did:\n\n&amp;#x200B;\n\n[Q3 Investors Presentation: https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/6khrc6vmte961.png?width=704&amp;format=png&amp;auto=webp&amp;s=eec70f41ee053a5251602ced361eb7abd181019e)\n\n&amp;#x200B;\n\nThey got to buy over $1.7B worth of investments for $40M and have proven they have turned those investments into operating profit. In addition, previous operations prioritized Cerium production for FCC catalysts. $MP has transitioned the goal product to be NdPr as it has much better growth potential to give it long term possibility. In addition, the market climate Molycorp operated under was not as forgiving as now. Back then there wasn't the tailwind of increasing EV adoption, or the rise of other high tech growth sector reliant on REE's. Molycorp was too early and inefficient to win in the market and didn't have anywhere close to the amount of governmental support for the industry. There is bipartisan support on all levels, i mentioned this a bit in my last DD post, but since then - and this is big and shows the scale of gov support- [THE LAST STIMULUS BILL HAD $800M IN SUPPORT OF INCREASING DOMESTIC REE PRODUCTION](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/miners-laud-800m-rare-earth-fund-in-omnibus-bill-61939620)! Molycorp didn't have anywhere close to this level of government support. And again, the pentagon invested $9M into $MP to help fund their REO mill because the pentagon views the ability to refine REO's as a matter of national security. \n\n# Discussing Concerns about Biden Presidency\n\nPeople who say this shit clearly have no idea what they are talking about. Biden (or his puppet masters but who cares money is all green)  has said he supports REE mining multiple times [source](https://www.reuters.com/article/usa-election-mining/exclusive-biden-campaign-tells-miners-it-supports-domestic-production-of-ev-metals-idUSKBN27808B). His team knows their big environmental initiatives rely on REE production and that domestic production is important to keep American industry at the whims of China. Yeah Trump was more hawkish with china but lets not act like a democratic presidency is going to let china walk all over the US or that Biden and other democrats will stop their push for EV's and clean energy. REE's are a cornerstone piece to so many of Biden's plans there is no way he turns his back on this company.\n\n# Discussion of Shenghe Resources and China and their relationships with $MP\n\nThe one real concern that people have is their partnership with Shenghe Resources where Shenghe has agreed to buy all $MP concentrate through 2021 and shenghe is a stakeholder in $MP. Many view this as a negative, but i think it should be seen as a good way to ensure survival in the gap between now and the final magnet production. A big issue would be if China chose to stop importing the MP concentrate, which would give MP no customers. Since this would adversely affect Shenge it makes it less likely and also the fact that MP produces 15% of the world's REE concentrate it would hurt the supply in china, which is huge. In fact, China removed their 25% tariff on importing REE material, read this [source](https://www.argusmedia.com/en/news/2104418-china-to-remove-import-tariff-on-us-rare-earth-ores) as it also shows how china is buying up all the concentrate they can. Japan has the capability to go from REO to NdPr magnet as well so if china ends up fucking MP, starting in 2022 when their REO site is in operation then they will be able to sell their REO to Japanese companies to bridge the gap before they have their own magnet making capability.\n\n&amp;#x200B;\n\n[Q3 Investors Presentation: https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/z43kajhrze961.png?width=2494&amp;format=png&amp;auto=webp&amp;s=b54d336e4ce5e34c9b72e60bd3506cfae1c8abe9)\n\n&amp;#x200B;\n\nChina is not likely to fuck MP and stop buying their concentrate as it will hurt china's wallet and ability to produce goods while only increasing the US government support for going mine to magnet domestically. China realistically views their dominance as ending at some point now, but they know they will still be able to control the market because of their scale regardless of whether they buy MP concentrates or not. \n\nAlso, if Shenghe doesn't buy their concentrates then they forfeit their stake in MP. they wouldn't be allowed to sell them on the market, the shares would just disappear, so it would effectively be a massive stock buyback and as long as the REO mill is complete then they just sell to Japanese magnet makers.\n\n# Mine Life discussion\n\nTheir S-1 states that at current proven reserves they have about 47 years of mine life left. That can be grown from drilling and exploration of more mineable material, which they stated they plan on doing. in addition, if they for some reason don't find more mineable ore on their land and don't buy more land with ore, then they could simply refine ore from other mines as the real cost barrier isn't  the digging out of the ground, it is the milling.\n\n&amp;#x200B;\n\n# TLDR\n\n$MP will  to the moon over the next few years. \n\nPostions: shares for virgins and LEAPs for chads."
  },
  {
   "Title": "Commodity Club - Daily Iron Supplements",
   "#Comments": 43,
   "Score": 1,
   "Symbols": [
    "$TECK",
    "$VALE"
   ],
   "Selftext": "Welcome back you autistic miners. Time for your daily vitamins - here's a bit of iron for you. \n\nFirst - let's check in on Iron Ore spot prices: \n\n* US Futures - [Link](https://www.investing.com/commodities/iron-ore-62-cfr-futures)\n   * Look at Contracts - $164/ton for January and holding $150/ton through May\n* Shipping Rates - [Link](https://twitter.com/HELLENICSHIP/status/1346134717607849997?s=20)\n   * Hitting $167/ton at the port\n* Yearly Outlook - [Link](https://twitter.com/AnaliseEnergia/status/1346053710397452289?s=20)\n   * Here we can see that May and September have the most volume and OI - they will drive Q2 and Q3\n   * Prices are holding over CNY1,000/ton through May and CNY950/ton through September. That's an incredible price for any miner. \n\nSecond - let's check in on relevant news: \n\n* Shipping/Exports - [Link](https://www.mining.com/iron-ore-shipments-from-brazil-and-australia-set-record-high/)\n   * Exports from Brazil/Australia are near ATH despite high prices\n   * For context - $VALE shipped about 6m tons of iron for the last week of December. At $160/ton, that's nearly $1b in revenue for a week. VALE is expected to have about $11b in revenue for the quarter, which also takes into consideration all their other commodities (e.g. Nickel, which was up 5% today on spot). \n   * Shipping prices (Baltic Dry Index) are also near ATH despite heavy volume\n* India - [Link](https://www.mysteel.net/article/5020628/Indian-Steel-Association-writes-to-PM-defending-price-hike.html)\n   * Not priced in, and shouldn't be, but local Indian companies are complaining about the price hikes that China is causing on a global scale. India is a huge exporter of iron, and are proposing a 6 month ban on iron exports to stabilize domestic prices. \n* China - [Link](https://www.mysteel.net/article/5020661/China-resumes-imports-of-steel-scrap-meeting-new-standards.html)\n   * Couple things going on here:\n\n1. China recently allowed for importing scrap steel to help shore up the lacking supply\n2. China steel plants are running at full capacity despite high input prices for both met coal and iron ore - surprisingly prices are being pushed to consumers instead of steel producers. The customer in this case is the Chinese government \n3. China relations with India and Australia are soured - China is beating out Indian companies for contracts by selling at ridiculously low prices and China/Australia have an ongoing price war\n\nThings to look out for: \n\n1. Changes in the May/September futures for Iron Ore (input #1) \n2. Changes in Met Coal prices (input #2) \n3. Changes shipping prices (input #3) \n\nRight now I'm playing $VALE for Iron Ore and $TECK for Met Coal. I've posted about $TECK in other posts - know they have 11% ownership by the China Investment Corporation. If it isn't obvious - China is driving prices globally for steel, iron, coal, and dry bulk rates. \n\nPositions: \n\n\\- $40k in equity split between TECK and VALE\n\n\\- $22c for April on VALE\n\n\\- $22c for May on TECK"
  }
 ]
}