{
 "Data": [
  {
   "Title": "American Cannabis: The Perfect Storm",
   "#Comments": 269,
   "Score": 10,
   "Symbols": [
    "$MSOS"
   ],
   "Selftext": "In 2018, Canopy Growth made more millionaires than any other stock. Legislative change, uplisting to major exchanges (NYSE), and huge institutional investment created the perfect storm and it was a bunch of unsophisticated investors (read: **degenerates**) that got rich off of it.\n\nToday, a similar story is evolving in US Cannabis in real-time, with a total addressable market that absolutely DOMINATES Canada's, and the emergence of unique tailwinds (e.g. COVID, social justice) to drive acceleration of and acceptance of Cannabis far beyond what Canada achieved.\n\n**The core of the investment thesis is dead simple.** Cannabis is federally illegal. This has **prevented large institutions** from investing in American Cannabis companies and provided a once in a generation opportunity for retail to make real money. The democratic sweep of the house, senate, presidency will lead to cannabis reform. Even if the absence of federal legalization, the conditions that led to meteoric rise of Canadian cannabis are being replicated south of the border. Read the Q&amp;A for more.\n\n**Why will cannabis legislation change?**\n\nThere is unprecedented momentum for cannabis reform at all levels of government.\n\n* [Senate Majority Leader said Marijuana legalization will be prioritized in a Democratic Senate](https://www.marijuanamoment.net/chuck-schumer-says-marijuana-legalization-will-be-prioritized-if-democrats-retake-senate/)\n* [Vice President Kamala Harris co-sponsors the MORE act to Federally and Tax Marijuana](https://www.rollingstone.com/culture/culture-news/kamala-harris-marijuana-bill-legalize-tax-weed-pot-862192/)\n* [In historic vote, House passes Marijuana banking bill with bipartisan support](https://mjbizdaily.com/historic-day-us-house-passes-cannabis-banking-bill-with-strong-bipartisan-support/)\n* [Language for the critical SAFE banking has previously been included in stimulus bills and will likely make it to execution with senate majority ](https://www.insurancejournal.com/news/west/2020/05/14/568608.htm)(this bill gives US cannabis operators access to banks to GREATLY lower their cost of capital, and is critical to having them uplist onto major exchanges -&gt; institutional investment)\n* [Removal of anti-cannabis Attorney General, and additional of Cannabis neutral AG Garland](https://www.cannabisbusinesstimes.com/article/attorney-general-william-barr-resigns/), and [addition of Pro-Cannabis Secretary of Health and Human Services](https://www.marijuanamoment.net/bidens-health-secretary-pick-could-help-reclassify-marijuana/)\n* The demographics are undeniable. Young people and people of colour support cannabis reform, and they turned out for the democrats in the general election and Georgia runoff.\n\n**Why will this happen now?**\n\n* [States are losing out on DESPERATELY needed tax revenue](https://normlfl.org/much-tax-revenue-legal-cannabis-generate/)(e.g. [Colorado](https://www.cnbc.com/2019/06/12/colorado-passes-1-billion-in-marijuana-state-revenue.html). [Illinois](https://chicago.suntimes.com/cannabis/2020/12/15/22174987/marijuana-cannabis-taxes-illinois-dispensaries-alcohol-booze-budget))\n* [Cannabis legalization and expungement is a pillar of racial justice](https://www.aclu.org/blog/criminal-law-reform/drug-law-reform/marijuana-legalization-racial-justice-issue), and has never been hotter with nation wide protests this year\n* [Public support for Legal Cannabis is higher than it's ever been](https://news.gallup.com/poll/323582/support-legal-marijuana-inches-new-high.aspx) (\\~90% for medical, \\~70% for adult recreational use)\n* [The majority of states already have some form of legal cannabis](https://www.businessinsider.com/legal-marijuana-states-2018-1), medical in 34 states, adult recreational in 11, but large institutions still can't invest, and AMERICAN cannabis companies can list on large exchanges\n* [There was a pro-cannabis sweep during the election, with 5 out of 5 states approving Cannabis measures](https://finance.yahoo.com/news/2020-elections-marijuana-on-the-ballot-in-these-5-states-173753954.html)\n* [New York has already announced a proposal to legalize](https://www.governor.ny.gov/news/governor-cuomo-announces-proposal-legalize-and-create-equitable-adult-use-cannabis-program-part)(New York is the jewel of the East, and many think with legalization in New York and New Jersey, the rest of the nation will follow)\n* [Use of cannabis has absolutely surged during the pandemic, accelerating adoption](https://www.forbes.com/sites/irisdorbian/2020/09/18/cannabis-consumption-surges-during-pandemic-as-sleep-issues-and-anxieties-mount-says-new-poll/?sh=3957110843d5) \\-- in anxious and uncertain times, alcohol and cannabis flourish; sin stocks do well in recessions\n* Cannabis is taking market share from alcohol: [US alcohol consumption decreases as cannabis use increases](https://www.healtheuropa.eu/alcohol-consumption-falling-cannabis-use-increases/94421/)\n\n**Who should I invest in?**\n\n* Hint: **it's not Aurora, Tilray or Canopy** (they don't sell ANY cannabis in the US) -- they will have a hard time making effective entry if and when they EVENTUALLY get access as many states have limited license programs that will require very expensive M&amp;A\n* Unlikely Canada in its growth phase, the US actually has stellar companies who already have established businesses, with excellent revenue growth\n* [Curaleaf is the biggest](https://mjbizdaily.com/curaleaf-rises-to-the-top-of-us-marijuana-industry-with-footprint-covering-about-two-dozen-states/) (CEO is a billionaire, biggest footprint, largest revenues) -- OTC ($CURLF), CSE ($CURA)\n* [Trulieve has the best overall financials](https://thedeepdive.ca/trulieve-five-analysts-raise-price-targets-following-stellar-earnings/) (most profitable, juggernaut in Florida, amazing reputation among investors) -- OTC ($TCNNF), CSE ($TRUL)\n* [Green Thumb Industries](https://www.newcannabisventures.com/gti-rises-in-the-cannabis-industry-with-focus-on-brand-building-and-prudent-capital-allocation/) is a branding and execution monster (great positioning in newly legalized states, loved among analysts, great track record of execution) -- OTC ($GTBIF), CSE ($GTII)\n\n**But these companies aren't on the NYSE and NASDAQ**\n\n* Yes, and that's exactly the point. Retail has a chance to get in before large institutions get the opportunity in a few weeks, months. Once the uplist happens, your already playing catch up. Sound too good to be true? Google it, take 5 minutes and do the DD. Here's where you can start: [CB1 Capital](https://www.cb1cap.com/blog/2020/8/17/barbarians-at-the-gate)\n\n**This guy sounds like linked shit so he probably knows what he's talking about -- just give me a ticker.**\n\n* Consider $MSOS on the NYSE. It's an ETF with holdings in all the top AMERICAN cannabis companies and have optionality. They've grown to about \\~300-400 million in assets under management. They will be a billion within a few months. Ban me if they aren't."
  },
  {
   "Title": "$YY ready to Blast Off into an Infinity Squeeze.",
   "#Comments": 46,
   "Score": 6,
   "Symbols": [
    "$GSX",
    "$YY"
   ],
   "Selftext": "From reading what you degenerates write on this god forsaken subreddit, it’s safe to say that you guys are fans of squeezing the living shit out of short sellers, right? Well I have a stock for you that will accomplish just that. Moreover I strongly believe it looks primed up for the oh so coveted Infinity Squeeze that we all strive to take a ride on. This company is called Joyy, trading under ticker $YY. \n\n$YY is under attack from our favorite neighborhood short seller Carson Block of Muddy Waters. You may remember him from the report he released on Luckin Coffee (which wasn’t his work) and more recently the report on $GSX (which I agree with and is actually a complete fraud). While I respect Carson, he is dead wrong on $YY and I can tell you with an *extremely* high degree of confidence that he used the bullshit short report to tank the stock and cover a short position he has been long underwater on. I will get into the details in just a minute.\n\nSo WTF is $YY? $YY or Joyy is an extremely popular video streaming platform that owns the apps YY Live, Bigo Live and Huya (which they spun out and sold to Tencent). $YY recently announced that they came to an agreement with Baidu to sell YY Live to them for $3.6 bn. This would leave the company with Bigo Live as the remaining asset and a nice big fat cash balance of $7.1 bn. At a market cap of $7.5 bn, you are basically getting Bigo Live for free. Bigo Live is growing revenues 130%+ per year and is basically the Only Fans of Asia. Tik Tok is worth 20x sales and growing slower. If we even give $YY 1/5th the valuation, this stock will quickly 3X from here. Notice I didn’t say just China...because after they sell YY Live, the company has no China exposure and is headquartered in Singapore. Bigo Live is consistently in the Top 10 grossing apps on Google and Apple App Store globally. \n\n$YY management came out and refuted MWs fraud claims wholeheartedly saying:\n-the report contains errors, unsubstantiated statements and misleading conclusions/interpretations.\n-the company is open to cash verification and diligence to be conducted by competent third-party advisers.\n-announced a $300 mln buyback and massive dividend (FIND ME A FRAUD THAT PAYS ITS SHAREHOLDERS DIVIDENDS...ILL WAIT)\n\nMuddy Waters is stretching to make an insane call. You’re telling me that $YY’s core asset is completely fraudulent and they were able to trick Baidu AND Tencent due diligence teams into buying assets from them for EXTREMELY large sums of money? AND trick GOOGLE AND APPLE TOO!?!? Come the fuck on. We have spoken with countless former employees and competitors who all have said the company is totally legitimate. You’re telling me $YY has planted ex-executives (who have no reason to lie) with expert networks to make false claims? Come the fuck on again. Finally, my MOST IMPORTANT POINT - if you are a top grossing app on the Google or Apple App Store, you are paying a tax of 30% to Google or Apple for all in-app purchases. Muddy waters is claiming 80% of the revenues are false and coming from round tripping/bots of the company. WHY WOULD A COMPANY COMMIT FRAUD BY PAYING THEMSELVES FAKE REVENUE ONLY TO GIVE AWAY 30% OF THIS REVENUE TO GOOGLE AND APPLE!!! COME THE FUCK ON PEOPLE. \n\nAfter the Muddy Waters hit job, Snow Lake Capital’s Ma Ziming revealed in an interview that he was awakened in the early morning to understand the situation, and immediately increased his holdings of $YY stock by $100 million USD. Who is Snow Lake Capital you may ask? Maybe you guys might remember the short report that Muddy Waters put out on Luckin Coffee. This short report was not the work of Muddy Waters but in fact was the work of Ma Ziming’s fund Snow Lake Capital and Muddy Waters simply released it on their behalf. Which makes this $100 million buy of $YY EVEN MORE JUICY.\n\nhttps://xueqiu.com/3582153332/163835924\n\nZhu Xiaohu said in the circle of friends,\"Muddy Waters only dared to short $YY in the second half of the night. Otherwise, you will definitely get beaten up.” Funny enough, Carson Block always releases short reports on Chinese stocks between 3-5am Shanghai time when it’s a position that he covers up quickly.\n\nLast thing I will leave you with is the #1 shareholder of $YY is Lei Jun who is the founder of Xiaomi. He is worth $25bn USD and a top 10 richest guy in China and owns close to $2Bn of $YY stock. He tried to BUY THE ENTIRE COMPANY...All of $YY...at around $70/share a couple years ago. He was the Chairman of the Board. WHY WOULD AN INSIDER TAKE A FRAUD PRIVATE WHEN HE COULD SELL HIS STAKE TO IDIOT U.S. INVESTORS LIKE YOU. This is what normal frauds would do. INSTEAD $YY is paying out dividends and buying back tons of stock from their (according to Muddy Waters) “fake cash pile.” WAKE UP MARKET, Muddy Waters wrote this report in February (that’s when it is dated) and is now releasing it FOR THE FIRST TIME because they have been under water for months on the position and realize this is their chance to get out with Baidu about to buy the company. They needed a quick hit job to cover their position and now they are out. \n\nThe next catalyst here is the Baidu deal. When the deal formally closes (expected to in Q1 of this year), this will start squeezing really hard as the market somehow thinks a MW report will prevent Baidu from closing. Those of you who think the deal is in question - Baidu is already promoting/integrating YY Live on its platforms to provide additional traffic thereby corroborating previous reports from Chinese media that the sale of the domestic business of YY Live to Baidu isn't in jeopardy due to short reports. \n\nConclusion - We will get an infinity squeeze of epic proportion. Thank me later."
  },
  {
   "Title": "$LEU: Literally Free Money 🚀🚀🚀",
   "#Comments": 30,
   "Score": 4,
   "Symbols": [
    "$LEU"
   ],
   "Selftext": "Centrus Energy ($LEU) is a uranium enrichment company. CEO has major connections in Washington having previously served as the Deputy Secretary of Energy prior to his current role.\n\nNewest product is HALEU (High-assay low enriched uranium) - necessary for newer advanced reactor designs. \n\nOne such design is used by TerraPower, the Gates-backed nuclear energy firm. In September, the company announced a partnership with Centrus Energy to supply HALEU in order to ensure domestic supply.\n\nUnder contract with the US Department of Energy, Centrus Energy is building the only US facility that will be licensed to produce HALEU.\n\nWith Joe Biden elected and a blue wave, more investment into clean energy is highly likely. One can imagine that Bill Gates himself will have many ears following his warnings about preparing for a pandemic, however he is even more vocal about reducing greenhouse gas emissions. His book “How to Avoid a Climate Disaster” will be released in February and will no doubt talk about Nuclear energy being a key factor given his stance on the issue through his various media appearances (and private investments).\n\nNuclear energy has many tailwinds but $LEU is a lower-risk (and high upside) way to gain exposure given its government contracts and partnerships given their deep pockets. The thesis is long-term given plants are being built now to prove the concept, but the way markets anticipate, there will be a lot of enthusiasm for these companies in the near future.\n\nFinancial stuff for the nerds:\n\n$32mn TTM EBITDA (less than 10x EV/EBITDA for a company that’s growing and has all the right tailwinds in the political sphere) thats cheap for an industry thats set to multiply over the next few years when other speculative areas are trading at triple digit multiples.\n\nBeing overlooked because they have negative book value after coming out of bankruptcy IMO, however, retained earnings are making them more and more positive. ~$43mn of their debt in post-retirement benefits is under review to have it paid by the DOE under the terms of their contract as work done by $LEU would share costs with the DOE.\n\nStock will be volatile due to the limited float, but that just means moon opportunity to me. Stock is down 20% from its recent highs presenting a buying opportunity.\n\nDisclaimer: I am long $LEU"
  },
  {
   "Title": "I’ve been saying this for months but WKHS finally getting the recognition it deserves",
   "#Comments": 41,
   "Score": 8,
   "Symbols": [
    "$ROPE"
   ],
   "Selftext": "WKHS has been on a rollercoaster since it’s initial parabolic move late June. Everyone knows the “major catalyst” is the USPS contract and that’s been a shitshow cuz why wouldn’t anything government run be...while the contract has been delayed to this current fiscal quarter, they’ve been getting orders from other companies and have also been providing test trucks to some big names. IKEA, which plans to go fully electric delivery by 2025 just received a few test trucks from WKHS and if all goes well, that’s one big name to add to the order log. More recently though, WKHS received a 6,000 truck order from the pride group worth between 2-3B. While many believe that the only thing that will make this company is that 8b USPS contract, I beg to differ although I do think that they are receiving most if not all of it. \n\nAbout a week before thanksgiving, Biden said he wanted to electrify the federal fleet. WKHS is the ONLY 100% EV company to submit an RFD for the bid. Bae AKA Cathie Woods also now owns more than 2.1 million shares and we know how good her track record is. This company simply can’t be ignored and I’ve been a bull since last January. If the USPS delays this contract again I’ll go long $ROPE but I just don’t see it happening. This proposal has been in the works for five years and more and more states are mandating EV in their guidelines and goals. Fun fact, WKHS is the only LMDV that has been certified in all 50 states for their electric capabilities. \n\nPositions: 1.1k shares and 4/16 $45c. \n\nTo Valhalla or the breadlines we go folks 🤝"
  },
  {
   "Title": "OAC – A Sleeping Giant. Kylie Jenner promoted their product her Instagram",
   "#Comments": 48,
   "Score": 5,
   "Symbols": [
    "$SNAP"
   ],
   "Selftext": "  \n\nOkay, I admit, I originally dismissed this stock because of the terrible DD’s previously posted about this. OAC is a blank cheque company that will be merging with HIMS &amp; HERS.\n\nA lot of the other DD’s have mistakenly categorized HIMS as a company that specializes in selling erectile disfunction pills, which ironically, I found as a turn off and dismissed it completely. However, I decided to give this company a second look because of the recent price action on the stock and what I found was a sleeping giant in the making. Yes, it’s true that they do sell ‘boner pills’, but that’s just one product among many others (i.e. hair loss treatment, birth control, acne, etc.). What caught my attention wasn’t what they were selling, but HOW they were selling it. Take Amazon for example, which was a company that sold books originally, and expanded into other products as it grew. What made Amazon successful wasn’t what they were selling, but HOW they were selling it. \n\nHIMS is looking to position themselves as a Telehealth disruptor in the Healthcare space. How they are unique from any other e-commerce platform that simply sells medication is the fact that they have a unique network of physicians that will address consumer concerns. For example, a person that has concerns about their hair loss might be too self-conscious to go into a doctor’s office to get a prescription and then must take that prescription to get fulfilled at a pharmacy. The whole process is embarrassing and intimidating, and as a result, the customer might just not seek a solution all together. However, with HIMS, the customer can consult a doctor remotely, get a prescription, order his medication, and have it delivered to him all through his phone and in the comfort of his own home. This in a nutshell is what give HIMS their unique competitive advantage. \n\nWhat really attracted me to HIMS were their financials. The company has been in operation for 3 years and the company is almost generating net positive EBITDA and will be in the next year or two (think about what happened to $SNAP when they were finally able to turn a profit and the stock price blew up). In their latest S4 Amendment, it shows their Q3 results in 2020 vs. their Q3 results in 2019. They were able to generate almost twice as much Revenue (from $57 Million into $107 Million) and was able to reduce their marketing expense (from $49 million into $39 million) at the same time. Not only that, but they were also able to increase their gross margins from 51% into 72%. As a result of their increased revenue, gross margins and decrease marketing expense, they were able to improve their EBITDA by $49 Million Year over year in 2020. They will mostly likely be EBITDA positive in 2021 when they finish their merger with OAC. Keep in mind that the company is only 3 years old and still have lots and lots of run room. Their growth potential is exponential. \n\nSo far, I have demonstrated that the company has an amazing business model and amazing financials, but what about their social media presence? The HIMS account has 99.9K followers and the HERS account has 100K followers, for a total combined following of 199.9K followers. Their closet competitor is Lemonaid Health, and they only have a total combined following of 8.3K. So clearly HIMS has a lot more social influence than their competitor and once again keep in mind the company is only 3 years old. Having a strong social media influence is part of the reason why they were able to generate more revenue while spending less in marketing in the year of 2020. Most recently, Kylie Jenner (The world’s youngest self-made billionaire with 208m followers on Instagram) posted an Instagram story of her buying HERS product and tagging Jennifer Lopez (who is a primary business partner and investor of HIMS &amp; HERS). Having strong social media influencers like Kylie Jenner and Jennifer Lopez allows HIMS &amp; HERS to bypass and save money on traditional marketing (like billboards and magazines) and allows the company to directly advertise to their primary target market (a generation of users that prioritize their mental and physical health, and prefer to conduct their business online)\n\nSo, they have a great business model, financials, and social media presence, but what about their management team and investors? Andrew Dudum, is the CEO of HIMS &amp; HERS, but before that he was the co-found of ATOMIC, a company that specializes in start-up. The guy literately started a start-up company that focuses on start-ups. This means he knows a thing or two about company valuations and reaching out to venture capitalist to generate funding and increase valuations. As a result, he was able to receive funding from notable investors such as Peter Theil (the guy that invested in FB, PLTR, and many other blow out companies in the early stages).\n\nOkay, so the company has a great business model, financials, social media and leadership, but how much can I expect on my return on investment? The OAC merger gives HIMS a valuation of $1.6 Billion at $10 per share. Currently OAC is trading at around $15, which gives HIMS an implied valuation that is greater than $2 Billion now. However, the CEO, Andrew Dudum, is suggesting the company has a potential to reach $20 Billion, which is a 10X bagger from $15 to $150 per share in the future after the merger. The merger with OAC is expected to be completed by the end of January, afterwards the ticker symbol will start trading as HIMS.\n\nPosition: 1K shares\n\nTLDR: OAC Merging with HIMS - The company has a great business model, financials, social media presence, leadership team, and future valuation. Merger expected to be completed by end of month.\n\nEdit: proof of OAC position https://imgur.com/gallery/D3rn6ZS\n\nEdit 2: Adding 🚀🚀🚀🚀 for dramatic effect 🚀🚀🚀"
  },
  {
   "Title": "Continued Tesla bull case?",
   "#Comments": 13,
   "Score": 6,
   "Symbols": [
    "$AMZN",
    "$TSLA"
   ],
   "Selftext": "Long time lurker here, I currently don’t have a position in Tesla but maybe it’s not a bad time to yolo all of my savings still?\n\nAccording to my extensive DD $AMZN capped at a p/e of 3732.43 in 2012.\n\nGiven that fact, $TSLA p/e seems very low relatively at only 1758 today.\n\nSo by these metrics, my calculations show a 212% increase. \n\nTesla 2k eow?? 🚀🚀"
  },
  {
   "Title": "Autistic Train Fan finds Progress Rail (Caterpillar) and Vale collaboration 🚀🚀",
   "#Comments": 5,
   "Score": 6,
   "Symbols": [
    "$CAT",
    "$VALE"
   ],
   "Selftext": "My brother and I are retarded rail fans like many of you autists secretly are but won’t admit. He sent me an article on a Progress Rail and Vale collaboration that will begin testing their new zero emission electric locomotive on Pacific Harbor Line (PHL) in california in the next month or two, likely attracting the attention of Elon and he may be inclined to deal with Vale. Vale will begin using electric locomotives from mines to ports as well. $VALE 🚀🚀🚀 and $CAT 🚀🚀 but CAT has been bullish for decades. \nVale $22c 4/16 btw"
  },
  {
   "Title": "A word of warning for anyone buying $NIO FD's this week!",
   "#Comments": 38,
   "Score": 0,
   "Symbols": [
    "$NIO"
   ],
   "Selftext": "All it takes is one dumbass comment from 🥭 Man this week about \"Delisting Gina better than any president ever\" to (temporarily) tank it. Big Cheeto is unpredictable when he's mad and nothing gets his angry rocks off more than some good old fashioned market manipulation. I'm not saying it's not mooning, all I'm saying is be prepared for the roller coaster.\n\n&amp;#x200B;\n\nTL;DR: $NIO 🚀🚀🚀🚀🚀🚀🚀🚀🚀. BUT 🥭 = 😠 = 📉."
  },
  {
   "Title": "Apple + Hyundai = Canoo $GOEV Excuse my sweet paint skills.. but connect the dots. $GOEV calls be printing this week...",
   "#Comments": 14,
   "Score": 4,
   "Symbols": [
    "$GOEV"
   ],
   "Selftext": " Canoo ($GOEV) and Hyundai already have a partnership for Hyundai to use their exclusive skateboard design... Apple &amp; Hyundai now in cahoots for a vehicle for 2024... CANOO+HYUNDAI+APPLE= ??? Keep your eyes peeled, but I'm expecting a bombshell PR from Canoo being tied in on this deal! \n\nhttps://preview.redd.it/di8g1xeufja61.jpg?width=1565&amp;format=pjpg&amp;auto=webp&amp;s=e7746a939425fe184682898ada520ac6a1a85634"
  },
  {
   "Title": "$SNOW play",
   "#Comments": 24,
   "Score": 1,
   "Symbols": [
    "$SNOW"
   ],
   "Selftext": "A while ago I submitted this post:\nhttps://old.reddit.com/r/wallstreetbets/comments/k0bo5b/short_squeeze_on_snow/\n\nObviously this play failed catastrophically. Fortunately enough for me I didn't get completely burnt as I got some 350 puts when it hits 400. So I am still up a bit from snow plays.\n\nI got burnt again second time for the second lock up, which was on Thursday last week. Funny enough I did sort of see it coming, because the second lock up was from pre-ipo investors. Not the snowflake employees who would dump every share at the market open. They probably would sell off slowly to not cause a panic.\n\nI panicked a bit when it hit above 310 last Friday as it looks like it is about to go back to test 340s. But it showed a lot of weakness mid day, so it does appears that pre-ipo investors are slowly dumping their stakes.\n\nI am wondering where would the mm find liquidity. There were definitely liquidity at around 300 level, not sure if there are much at 350 price level, since there are bag holders up there so they would face some selling pressure as well. Based on the movement friday, I felt like the liquidity is running dry above 300s, and it is probably going to 250s very soon or 230 where there should be plenty of people who are willing to hold their bags.\n\nMy question is that do you own any stake in snowflake? Why would anyone buy or not sell at this price range? I don't see a lot of hype here or on other reddit subs. I did see some hypes on stocktwits and twitter. Some people pointed out unusual call option buying activity at $360. But that happened when the stock price was at 320s, the premium quickly faded. Not sure what to think about that."
  },
  {
   "Title": "$GME 🚀🚀🚀🚀Sum of the Parts and Credit Anal",
   "#Comments": 94,
   "Score": 1,
   "Symbols": [
    "$GME",
    "$W"
   ],
   "Selftext": "This is solely entertainment and not investment advice. Do your own due diligence.\n\n**Sum of the Parts Analysis**\n\nLots of Wall Street firms do what’s called a sum of the parts (SOTP) analysis when companies seem to be trading at a discount to true intrinsic value. Think of it as selling an old car for good parts or harvesting a dead body for good organs. There’s value to be had in the parts.\n\nIf we estimate that there are $1.25-1.64B of annual online / e-commerce revenues in GameStop in 2020 and look at $MELI, which trades at 25x EV/Sales, $W which trades at 2.07x EV/Sales, and even the shittiest e-commerce co out there $CNXN, which trades at 0.51 EV/Sales just on the online business alone, GameStop should be worth $637.5m-3.39B or $9.44-$50.22 per share.\n\nMoreover, the company spends $65m a year on marketing. With 55m PowerUp members (is this a low count given how many people who shop but don’t enroll?) the cost of customer acquisition is $1.18 per customer. Chewy’s was $65 in 2019. Wayfair’s is in the 60s.\n\nWhat’s $5B of retail revenue worth? Even at 2% margins it should be worth 4-5x EBITDA right? So $500m or $7.17 per share? \n\nMeaning, if Ryan took the co over tomorrow and sold off all of retail, $GME should be alone worth **$16.61** ($7.17 retail cadaver + $9.44 e-commerce company or even $50.44 e-commerce company) per share if he did literally nothing with online, which we know isn’t the case. But apply a little bit of that Chewy stank (6.16x EV/Sales) and it’s easily a $30 stock even if the market gives us next to zero credit for the turnaround. Ryan knows this. It’s time you retards did too.\n\n**Bond Prices**\n\nBond markets are smarter than equity markets. Mostly because there aren’t retail retard autists investing there. If $GME was heading to BK, bond prices would fall. Instead they’re trading at 101-102 (means above full value) and 52% of its bondholders were happy enough with $GME’s potential to roll the dice out by 2 years to a 2023 maturity date. Moreover, if the company was really distressed, Ryan would’ve bought the bonds and put it into what’s called a prepackaged bankruptcy. Indeed, arguably Melvin Capital could’ve pulled the same play but didn’t do because they’re more interested in shorting the stock for a short term play because in the long run even they know Cohen has a high chance of turning the business around.\n\nTLDR: e-commerce company / harvested organ + physical retail cadaver alone is worth $16.61-57.39 per share and the bond market knows what you already know, mainly $GME 🚀🚀🚀🚀. Melvin doesn’t really believe in the bankruptcy thesis or they would have owned bonds."
  },
  {
   "Title": "If Tesla isn't going to crash this month, i wanna see some 🌈🐻 $ROPE themselves.",
   "#Comments": 7,
   "Score": 1,
   "Symbols": [
    "$ROPE"
   ],
   "Selftext": "\\#IF WE'RE REALLY AT THE PEAK THEN IT **HAS TO** BUST LIKE YOUR NUTS NEXT WEEK\n\nIf it doesn't -&gt;  🌈🐻 $ROPE please.\n\nTSLA stocks &amp; calls are like free money lying on the street right now, bend over and pick it up you  🌈🐻 .\n\n\\*\\*It's literally a no-brainer.\\*\\* I was retarded enough to not buy TSLA when it was up +200%, now it's up at +1200% and i could only take 200% of that home. TSLA is the best performing stock on the market atm you 🌈🐻 .\n\nNow TSLA has a P/E ratio of 1600+, which is completely meaningless. All the money buttered into TSLA is still in TSLA. The only reason why TSLA could crash is, if all hyperfrequency-trading commercial banks short TSLA at the same time. But why should they?\n\nWorst thing going to happen is TSLA falls back to 400$.\n\nThis isn't 1929 where every retard could double his investment **WITHIN ONE WEEK**, just by *buying shit, garbage pennystocks.*\n\nOther companies are going down atm, which is unlike something happing in a everything-bubble.\n\nNot a 1999 tech-bubble either, since some tech companies are going down too.\n\nExample: GM &amp; GE are handing out free $ROPE with every dollar you put into their stock atm.\n\nTSLA 2000$, 2022 lets go."
  },
  {
   "Title": "Saturday Night Steel Teaser - someone asked me if steel would crash, sure it will - on Mars🚀🚀🚀 $MT",
   "#Comments": 350,
   "Score": 1,
   "Symbols": [
    "$CMC",
    "$MT"
   ],
   "Selftext": "The question asked (like many of you have DM’ed me about):\n\nDo you think a steel crash is coming?\n\nMy response:\n\nI could give you another DD on micro and macroeconomics and explain exactly why we are not even near a crash. \n\nFor a crash to happen, there would need to be a nuclear bomb to take us all off the map. \n\nThen in a billion years when whoever is rebuilding the world, I’d be bullish on steel. \n\nLong story, short - when the MULTI-TRILLION US infrastructure drops and the rest of the world follows (and some already have - like China) anyone that is making steel will be printing faster than J-Powell. \n\nI haven’t even gotten into the LUCRATIVE nature of government contracts some of these US steel manufacturers will get. Remember in the 80’s when the US government was building and paying $400 for toilet seats?  They will come up with projects and contracts with mills to supply steel. \n\nThere will be a short supply and US businesses will be looking for import material that will come from the largest steel maker in the world - $MT.  Well positioned in Canada and Mexico. \n\nOh, and I’m just giving you the US situation. \n\nImagine the same around the globe in all developed nations. \n\nNot a lot of people realize that government is big business - the biggest when they want to be.  \n\nThrow all the global tension in there as well with all major country’s expanding their military’s - do you know how much steel goes into building naval vessels?  Tanks?  This is why there was a section 232 enacted - steel production is necessary for our safety and self-defense.  Lastly, I once sold steel as part of a nuclear reactor project.  Do you know how many truckloads of steel alone went into the building of one nuclear reactor?  1,600 - 24 ton trucks. 40,000T. To build one aircraft carrier?  60,000T.  \n\nCheck this out:  https://www.defense.gov/Newsroom/Releases/Release/Article/2442969/statement-from-deputy-secretary-of-defense-david-l-norquist-on-the-department-o/\n\nWanted to share as a lot of you keep asking. \n\nI’m bullish on steel. \n\nMy first post said this was a short term play - to trade out in 6 months or when steel prices go sideways for 60 days straight. \n\nI’m starting to believe this is a LONGER TERM PLAY. \n\nI’m pushing out to August at this point.  \n\nBased on what Biden announces and will get passed - this may be a 2021 play into 2022. \n\nDon’t get crazy yet.  \n\nWait for the Vito blessing. \n\nHope Saturday night has been good.  \n\nMore NFL tomorrow - bet the STEELERS TO COVER. \n\nThey win by 25 - guessing that will also be the price of $CMC after earnings pre-market. \n\n-Vito"
  },
  {
   "Title": "$TSLA BUBBLE?!⛔ $TSLA TENDIES?! ✅",
   "#Comments": 49,
   "Score": 1,
   "Symbols": [
    "$TSLA",
    "$SPY"
   ],
   "Selftext": "Fkn autist retards, Welcome. 🚀🚀🚀🚀🚀\n\nNow that we have the pleasantries out the way; what you ppl do not understand is that the recent continuation of $TSLA's mooning has nothing to do with its technical analysis or news cycle. The $TSLA diamond handers and FOMO boomers have driven the price up so hard since inclusion to the $SPY that benchmark funds and even some major funds have yet to balance their ports and are still in process of doing so.  \n\nIm not gonna act like Im a fkn ETF's and index savant so correct my retard interpretation if I'm wrong but from what I do know--is that $TSLA is going up so hard that its already weighted at 2% in $SPY. Thus, if these benchmark funds aren't in $TSLA or properly balanced w/ $TSLA then you're essentially short $TSLA. Thus, price will continue to rise till equilibrium is achieved in the funds--allegedly. For the 5 of you that can read, the source is a twitter thread discussing these topics. \n\nSo will $TSLA have a doomsday drop as you paper-handed bitches claim? Maybe. But that can be attributed to almost any stock that meme'd in 2020. The take-away is that $TSLA is still serving tendies, and I'm definitely still in that mufuckin' line. I couldn't give a fuck about the constant fluidity of the inner workings of corporations and ETFs and shit, so if any of you autist boomers can add any insight if you aren't sleep already at 11pm on a Saturday night, go ahead.\n\nSource:  https://twitter.com/squawksquare/status/1347298061186461697?s=20 \n\nTldr; Lazy benchmark fund managers (aka Fund Managers that didn't have the makings of a varsity athlete on a real fund) are failing their classes and are now panicking to turn in late work before the semester ends. $TSLA TENDIES ARE STILL ON THE MENU CHOOOOOOO 🚀🚀🚀🚀"
  },
  {
   "Title": "$GME Monday will be a good day.",
   "#Comments": 13,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "$GME Monday will be a good day. I think the report will be good. Think about it, on Dec 8 they announced that they would give a sales update on Jan 11. They were already 2/3 of the way through the holiday quarter. They knew it was going to be good so they wanted to announce early, as opposed to waiting for the earnings call."
  },
  {
   "Title": "$900K YOLO in $BILI",
   "#Comments": 172,
   "Score": 1,
   "Symbols": [
    "$BILI"
   ],
   "Selftext": "Almost my entire portfolio is invested in BILI calls, get rich or die trying. About $900K as of today.\n\nhttps://preview.redd.it/v2y156knaea61.png?width=1743&amp;format=png&amp;auto=webp&amp;s=1eb967445b4c81dd8fdcc74fa73da879f30abf88"
  }
 ]
}