{
 "Data": [
  {
   "Title": "Ten(die) Traits of the TENBAGGER ($PLTR, $RKT, $TSLA)",
   "#Comments": 88,
   "Score": 1,
   "Symbols": [
    "$RKT",
    "$TSLA",
    "$PLTR",
    "$PTON"
   ],
   "Selftext": " Fellow smooth brains, broke boiz, and gainz girls,\n\nI've had a lot of down time this week since I'm cooped up in q-tine with the vid. Figured I'd change it up and spend time to listen and read about people who actually made money in the markets, instead of edging to EOY loss porn for 10 days straight.\n\nI found a few different hedge fund daddies to keep me company during the alt reality of rona isolation. These dudes weren't smooth brain; they read books and wrote them too. They made all their tendies in the pre-dawn era before the internet, but a lot of their concepts are the foundations of today's DD flair.\n\nOne of these hedge fund daddies is Peter Lynch; the silver fox averaged 30% returns over 13 years as manager of Fidelity's Magellan Fund. He frequently &amp; routinely states \"Stonks only go up\" and \"Buy the FKN DIP\" in pre-internet era interviews and he's got a rager for the market advantages of individuals (retail, us, idiots) vs. wall street (chads, citron, warren buffet). He actually walked away from Wall Street at relatively young age to spend more time with his family. This decision can only be interpreted one way; he made enough tendies to send his wife's boyfriend back to instructing $PTON classes and preying on other men's wives. For this, the legacy of he Silver Fox must be immortalized - he is legend.\n\nAnyway, Lynch is pretty famous for coining the characteristics (traits) of a ten bagger. Since I've got lots of time and there's no loss porn on the weekends, I thought it would be an interesting idea to back test some of these ideas on WSB favorites &amp; active bag holders like $RKT, $PLTR, and $TSLA.\n\n**10 Traits of a Ten Bagger:**\n\n**1. Name is Dull or Ridiculous: All tickers check.**\n\n· Red $RKT? Sheesh dude calm down.\n\n· $PLTR? Fool of a took!\n\n· $TSLA? That socialist electrician?\n\n**2. It does something dull: All tickers check.**\n\n· $RKT: Mortgage loan processing.\n\n· $PLTR: Data aggregation &amp; integration. wut?\n\n· $TSLA: Sells cars.\n\n**3. It Does something disagreeable: All tickers check.**\n\n· $RKT: Online loan processing is perceived as untrustworthy by institutions &amp; individuals.\n\n· $PLTR: Blah blah blah oppression, NSA &amp; data privacy\n\n· $TSLA: \"There will never be a market for EVs!\"\n\n**4. Institutions don't own &amp; analysts don't follow: Only $PLTR checks.**\n\n· $RKT: 15 analysts have coverage with an avg. PT of $24.7\n\n· $PLTR: 7 analysts have coverage with an avg. PT of $15\n\n· $TSLA: Everyone talkin' TSLA these days. Irrelevant.\n\n**5. It's depressing: All 3 tickers check with some massaging of the interpretation.**\n\n· $RKT: When I grew up, home loan refinancing was a bad thing borne from necessity. Exchanging equity for better loan terms prolongs payments and adds long-term interest. These improve affordability and increase in popularity with each recession.\n\n· $PLTR: Literally sells system solutions for crisis situations. Think COVID/Conflict/Fraud.\n\n· $TSLA: The narrative sells because the climate crisis is the defining issue of our age.\n\n**6. The industry isn't growing: All 3 check with some massaging of the interpretation.**\n\n· $RKT: Growth is not the same as appreciation. The housing market continues to spike in part because of archaic housing &amp; city planning policies that prevent new supply from entering markets.\n\n· $PLTR: New data points &amp; software solutions continue to be introduced &amp; sold, but PLTR is unique in it's integration &amp; aggregation capabilities. Nobody else is selling this particular solution; in fact, PLTR views their biggest competition as a companies' desire to internalize this solution.\n\n· $TSLA: EVs sales are in fact growing exponentially, however the sales are pulling demand from the existing market share of the automobile industry, not creating new market share. Additionally, modern transportation policy ***likely*** reduces the amount of new cars on the road as EVs are increasingly exposed as an edge case for addressing climate change. Also, ARK (momma Wood) has done a bunch of research re: the pending used-car bubble that will put further ownership equity pressure on loans, dealers, and individuals still buying used ICE cars. The combined pressures of costs associated with personal vehicle ownership, rapid asset depreciation, autonomous ride hailing, modern transpo plans focused on decreased congestion &amp; emissions, will significantly reduce the size of this industry in the near/mid term future.\n\no P.S. I &lt;3 Pete Bootycheeks, US Transpo Sec. Build all the rails &amp; bike lanes.\n\n**7. It's got a NICHE: All 3 check.**\n\n· $RKT: mobile loan processing. Speed speed speed. Ease ease ease. Cheese cheese cheese. $RKT's solutions saves time, better prepare buyers &amp; refinancers, simplifies the process, and reduces monthly expense. Rock solid like my $RKT in the mornings.\n\n· $PLTR: how many of you work at a fortune 500 (not Wendy’s) that requires you to query data for routine reports? How many logins do you have? how many systems do you need to navigate? Do you know how your co addresses this? They pay managers who can't write =sumif() excel functions, to piece together PowerPoints and workflow diagrams that communicate system enhancements to $100k+ soft devs and system architects who then Frankenstein together 10+ paid SAAS \"solutions\" in 1-3 years. $PLTR comes in hot and ready like the domineos pizza pie delivery guy ready to feed &amp; seed the shmeat lovers. $PLTR works with what you got, growers and showers, to create a highly scalable 2 way data integration &amp; aggregation system in hours.\n\n· $TSLA: Battery &amp; self driving tech are the biggest niches at this point, but don't sleep on those EV credits. Wall street industry idiots are salty that $TSLA can improve margins by selling polluter permission slips to allow polluters to pollute, but co's love to pollute so those things print.\n\n**8. Recurring Revenues: All 3 check.**\n\n· $RKT: Definition of \"Recurring\": \"occurring again periodically or repeatedly.\" $RKT reports a lot of money each quarter's earnings reports. Don't @ me.\n\n· $PLTR: the business model is designed to scale billing in tandem with gains made from solution utility.\n\n· $TSLA: At this stage, car sales are growing and we haven't hit an extended downturn in the cyclical environment. Just wait till the FSD, energy credits, insurance, ride hailing, and grid energy revenues print infinitely and indefinitely. Anticipate unrealized earnings &amp; receivables to pace with earnings growth.\n\n**-(9. Insiders are buying: $RKT &amp; $TSLA check.**\n\n· $RKT: Daddy Dan Gilbert &amp; Juicy Jay Farner were loading up on shares &lt; $20 in August\n\n· $PLTR: Mithril (a Papa Thiel fund) got clearance to buy an s-ton of $PLTR at some point last week. Basically, a buy back, but we'll see more when the lock-up period ends.\n\n· $TSLA: Denholym sold 43k shares at \\~$400 per, but Emperor Elon is diamond handing his market cap option tranches which counts IMO.\n\n**-(10. Its buying back shares: $RKT &amp; $PLTR check.**\n\n· $RKT: Announced a completed $1B buyback on the last earnings call\n\n· $PLTR: Momma Wood (ARK) has been adding $1m+ in shares each week, but it basically just went public so too early for this.\n\n· $TSLA: Issuing new funds to improve cash positions at elevated market cap.\n\nPositions:\n\nBuy the dip, LONG $RKT &amp; $PLTR until $75b market cap, then readjust thesis. $TSLA to $1T market cap, then pivot into 2% divvie stocks till' I transcend into a Silver Fox incarnate. \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀"
  },
  {
   "Title": "Bear Porn",
   "#Comments": 24,
   "Score": 1,
   "Symbols": [
    "$SPY"
   ],
   "Selftext": "$SPY Chart from 2009 for reference, the last time we were in a similar circumstance. Here: https://imgur.com/gallery/SK7dm3F \n \n\nMarkets hate the presidency, senate and house going straight ticket. They both can spend and tax at will. Gridlock is Good.  \n\nLooks like MM's drove the price up with low volume the last two weeks, the same as the chart above.  \n\n$SPY Lost 1/3 of it's Value from 1/5/09 - 3/9/09  \n\nIf we follow the same $SPY track as 2009, and you bought 3/31 255p Monday, it would cost you $88 per contract\n\nIt would print roughly 1000-2000% &amp; w/ IV kicking in; way more if we stay on the same track as the last two weeks and repeat a Georgia win.  \n\nA 10k Bet Would Net Between 100-200k\n\nHedge with another 10k in slightly OTM $SPY Calls, if I am wrong.\n\nCan be scaled up or down. I do expect tomorrow to start out, going way up, to suck up all that stimulus money first. Timing is key. This play does not work if $SPY is Anthony Stagnetti. Could shorten the length of the poots if you are risk aversive. But this is Wall Street Bets, not /r/investing"
  },
  {
   "Title": "🚀$PCG and why it CAN’T go down. 🚀",
   "#Comments": 44,
   "Score": 1,
   "Symbols": [
    "$PLTR",
    "$PCG",
    "$GME"
   ],
   "Selftext": "Alright you fucking autists, listen up. We’re sitting on an untapped fucking resource while $TSLA, $NKLA, $PLTR and $GME eat your wife’s boyfriend’s petty cash. What do all of these companies have in common? \n\nElectricity. \n\nWith California and most of the PNW being on the PG&amp;E grid and being a large chunk of the US population $PCG is INCREDIBLY undervalued as a stock. They’ve had some hiccups in the last couple years, and they’ve obviously learned from them because they’re still around. They can’t get rid of the entire electrical grid of the west coast and they don’t dare break it up during a pandemic because of the cost of such a move. $PCG is going into the new year with no new major fires in 2021, new leadership and new found reliability based purely on my own experience. \n\nNow to boring shit.\nBalance sheets are looking good post settlement and the company is more than able to recover 100% in short order. With that being said they are going to be the largest energy market in the US, so it’s about time we get while we can, the next few days should be WILD.\n\n$PCG 11/15C 🚀🚀🚀🚀🚀"
  },
  {
   "Title": "$PETS petmed express undervalued if you believe the business will persevere!",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$PETS"
   ],
   "Selftext": "I'm not even sure I'm allowed to post this just simply due to the fact it's not a 1B market cap.\n\nPros: It sells pets meds since two decades ago. No long term debt  $100+ million in cash. Gives out like $1.00+ in dividend/year.\n\nMarket cap is 650M simply because ppl no longer think there's future potential.\n\nPETS is holding pretty well by itself but probably better if some big mamba can acquire it whole.\n\nIt has the licenses to send drugs all over the US and Canada.\n\nCons: Chewy started off their own pet pharmacy in 2018.\nWalmart and Amazon kinda did as well. Chewy is still losing money but wallstreet is pricing them as a strong growth company. Not sure why Chewy didn't just spent $1 billion and incorporated petmed express in 2018.\n\n1800-petmeds website looks like a website in the 1990's.\n\nShort story: good undervalued stock that gives a dividend. Hopefully Amazon would throw their 2 pennies at it and just acquire petmed express. Easy to enter the pet market with a good track record and petmed express wouldn't need to use their crappy website anymore."
  },
  {
   "Title": "$BBBY to the Moon?",
   "#Comments": 48,
   "Score": 1,
   "Symbols": [
    "$BBBY"
   ],
   "Selftext": "$BBBY has become a coinflip.\n\nPositives:\n\n70% short float\n\nShare repurchase program increased in December. \"Both ASR programs, which will total $375 million, are expected to be completed by no later than the end of the Company’s fiscal year on February 27, 2021 \n\nMark Tritton &amp; Co have been in charge for over a year now\n\nImproved online platform\n\nGoogle trends show unusually large search numbers for Bed Bath &amp; Beyond, very promising 3Q, likely to beat estimated earnings.\n\nThe average estimated analyst price target is $24,21, 36% higher than the current price of $17,76\n\nThe stock has fallen 18% in December, 25% since last top, room for growth\n\nNegatives: \n\nFormer support at $18 is broken, and the fall of 15% to $15 is likely if shorts don't start covering in Monday/Tuesday.\n\n15 day MA has moved under 50 day MA, makes the fall more likely\n\nThe top triangle pattern has formed over the past 30 days.\n\nConclusion: Could go either way lmao. After Q2 earnings were beaten, $BBBY rose like 70%. The risk of -15% is not that terrible too. Buy shares not call options, avoid using leverage and everything should work out well. \n\nPlease share your thoughts about this."
  },
  {
   "Title": "$MT Technical and Value Analysis",
   "#Comments": 154,
   "Score": 1,
   "Symbols": [
    "$MT"
   ],
   "Selftext": "MT is a heavily traded by the institutions and hence follows institutional structures. They like to target the 125%, 150% and 200% swings of balance areas. See how they target the 2x moves areas in the chart below in the Green boxes.\n\n&amp;#x200B;\n\n*Processing img gzt5snrgx4961...*\n\nFor the latest swing we have broken above the previous high at 19 and held and has reacted to the 150% extension line. We now know that the institutions and the algos are working off this swing structure. Their target will be in the upper red box around $29- $30.\n\n&amp;#x200B;\n\n*Processing img 8myexzhgy4961...*\n\nIdeally the best place to buy would be in the green box around $19 however if we do a statistical arbitrage analysis of the stock vs the price of steel, I dont think it will go back this far.\n\nThis is a chart of MT vs Steel Futures prices. You can see the stock has a close correlation to steel prices and is trading at a significant discount to the price of steel. The last steel price peak of $900 , MT was trading at an average of $30( purple box area). Steel is now at $1000, so the $30 target is very reasonable.\n\n*Processing img 22msxzrgz4961...*\n\nFrom current price to $30 is a 30% gain for an initial target. It could blow through this area but I would expect to see some profit taking here and a short term reversal especially if steel prices start to come off. If they dont the institutions will re accumulate for the next leg up. \n\nI will look to buy at 22.20, 21.20 and around 19 if I see the right volumes coming in."
  },
  {
   "Title": "Are stocks overpriced? How much growth is required to justify a P/E of 100?",
   "#Comments": 6,
   "Score": 1,
   "Symbols": [
    "$FB"
   ],
   "Selftext": "In this post, we shall explore how the one- and two-stage Gordon Growth Models, and Dividend Discount Model, relate to growth rates, valuations, earnings, dividends, inflation, and return on investment.\n\nLet E = earnings d = dividend P = price r = discount rate g = (terminal) dividend growth rate\n\nThen y = d/P is the dividend yield Y = E/P is the earnings yield P/E = 1/Y p = d/E is dividend payout ratio\n\nAccording to the Gordon Growth Model,\n\ny = d/P = r - g.\n\nHence,\n\nY = y/p.\n\nSo, for example, if r = 10% is the required return, and the growth rate is g = 3%, then dividend yield should be y = 7%.\n\nIf also the payout ratio is 70%, then the P/E must be 10. If the payout ratio is p = 100%, then the P/E can be ~14.\n\nIt may appear counter-intuitive that higher retention requires a lower P/E. But remember that we are talking about dividend growth rates, g, not earnings growth rates.\n\nSo if a firm is able to grow dividends without retaining earnings, this likely means that it benefits from pricing power, protecting from inflation, or that it has conservative accounting.\n\nHowever, when the dividend is zero, g cannot be measured, and the model breaks down.\n\nSo we assume that earnings represent distributable cash, in the sense that if the dividend payout were 100%, the business could sustain constant earnings. And then we consider the situation where a fast-growing company wishes to retain all of its earnings for future growth. However, indefinite growth at a rate higher than the nominal GDP is implausible. And indefinite growth without dividends is, in theory, not worth anything. To be valuable, a company must eventually harvest earnings. Or it must be acquired, and its survivor must harvest earnings. So, consider the situation where a company grows quickly for a period of time and then grows more slowly while paying dividends. For this, we may apply a two-stage Gordon Growth Model, which is really just a special case of the Dividend Discount Model (DDM). For simplicity, assume the initial growth is g, and the payout ratio is zero, for a period of n years, prior to slowing to a (dividend and earnings) terminal growth rate h, and a 100% payout ratio, with dividend d.\n\nThe correct price after n years is given by the Gordon Growth Model:\n\nP_n = d / (r - h).\n\nBut in order for this price to be achieved in n years, the price today must be,\n\nP_n = d_n / [(r - h) (1 + r)n].\n\nAt time n, d_n = E_n, which will have grown:\n\nE_n = E (1 + g)n.\n\nHence,\n\nP = E (1 + g)n / [(r - h) (1 + r)n]\n\n= [(1 + g) / (1 + r)]n * E / (r - h).\n\nRearranging, we find,\n\ng = [(1 + r) * [(r - h) (P/E)]1/n - 1] * 100%\n\nAssume, for example, if the discount rate (required return) is r = 10%, and the initial P/E is 100.\n\nIf the terminal growth rate is h = 0 after n = 10 years, then the required earnings growth spurt for these 10 years will be g = 38.5% per annum, for a 26-fold increase in earnings. But, after all, r = 10% is a nominal discount rate, a mature company may be expected to grow at a rate of\n\nh = i + G,\n\nwhere i = inflation rate and G = real GDP growth rate.\n\nSo if i = 3% and G = 2%, then, h = 5% may be expected at maturity, with a 100% dividend payout policy.\n\nReviewing the formula, then, we find the following results for different periods of growth, n, where g = growth rate, and m = E_n / E, the factor by which earnings multiply:\n\nn = 10 years g = 29.2% m = 13 times\n\nn = 15 years g = 22.5% m = 21 times\n\nn = 20 years g = 19.2% m = 34 times\n\nWe see then, that a business must sustain approximately 20% earnings growth for 20 years in order for it to justify a current P/E of 100, assuming it matures at year 20. A higher hurdle rate, r, would require more aggressive assumptions about growth, and a lower hurdle rate would require less aggressive growth assumptions. Naturally, growth rates of high-growth companies tend to fall continuously, with size (law of large numbers) and competition. But this is a rough illustration of what is required. One may experiment with the formula using other P/E ratios, etc. Also, the formula does not directly apply to loss-making companies. And, in fact, some loss-making companies can become profitable and grow earnings quickly via operating leverage. $FB is one such example. When it IPO'd in 2012, it was barely profitable. However, it subsequently grew earnings one thousandfold, because revenues rose faster than costs.\n\nGrowth rates in the above examples are rare, so forecasting them should be rather difficult."
  },
  {
   "Title": "$WISH is undervalued",
   "#Comments": 27,
   "Score": 1,
   "Symbols": [
    "$WISH"
   ],
   "Selftext": "65% gross profit margin. Very low expenses in all categories except Sales and Marketing, which they are spending virtually their entire gross profit on (a sign of good management and high future growth potential). Breakneck revenue growth. Only trading at 5x sales, which is dirt cheap for an ecommerce company in today's market. Thoughts?\n\n[Link to their S-1](https://www.sec.gov/Archives/edgar/data/1822250/000119312520298630/d82777ds1.htm)"
  },
  {
   "Title": "My plan for $PLTR",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$PLTR"
   ],
   "Selftext": "&amp;#x200B;\n\n[These red lines are support zones. My plan is to buy $PLTR between $22.13 and $22.37. If that level doesn't hold i will buy again on the bounce of $18.32 and $18.55. ](https://preview.redd.it/cwfs95vs72961.png?width=1880&amp;format=png&amp;auto=webp&amp;s=6da782ddf0c7a7cb66b0343fd6b72571bd32ac4e)\n\n  \nI have a very good feeling that this is going to work."
  },
  {
   "Title": "BOY capital inflows $ICLN $TAN",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$ICLN",
    "$TAN"
   ],
   "Selftext": "Will we see beginning of year huge capital inflows this Monday and the rest of the week? Specifically into green energy? Regardless of the runoff the Biden admin has made it clear that is going to be one of their top priorities. Obviously funds will allocated into other sectors like tech etc but green energy is the most notable sector that is affected by the change in regime.\n\nthoughts?"
  },
  {
   "Title": "Laying out the Tesla bear case, a summary",
   "#Comments": 125,
   "Score": 1,
   "Symbols": [
    "$MSFT",
    "$GM",
    "$TSLA"
   ],
   "Selftext": "Before diving in, a few housekeeping items:\n\n1. **I didn't write this.** Everything below has been copied and pasted from [Chris Bloomstran](https://twitter.com/ChrisBloomstran/status/1345155266468306944)'s Twitter feed. All I've added are a few edits for brevity. If you have a Twitter account, definitely give him a follow.\n2. \"**OP is a gay bear.\"** Full disclaimer, I neither own puts nor am short Tesla (although I'm definitely considering it). In fact, if Tesla were cheaper I would almost definitely be long. I'm posting this because, beneath all of the memes and shitposting, I know that all of us want to make money. Every little bit of information/analysis helps, even if we disagree with the end-conclusion.\n3. **\"Post is too long. Ban.\"** This post isn't meant for you, please move along. I know it's wordy and there aren't any pictures, but this is meant for those in this sub who enjoy a bit of reading/research. If you aren't interested in a bit of reading, please scroll past.\n4. **If you YOLO $TSLA puts because of this post, you deserve to lose your money.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\n***A single prediction for the New Year.***\n\n*Those unfamiliar with the Federal Reserve Board’s Regulation T will hear lots about it during 2021. The rule limits the percentage of an investment in equity securities that can be borrowed with a margin loan. A wake-up call is scheduled...*\n\n*It was widely reported this week that total margin debt reached a new high of $722B. The WSJ’s 12/28 lead Business and Finance story profiled a $TSLA retail investor, a civil engineer, who had parlayed a $23k option investment in $TSLA into a $2m position. Oh boy. The gentleman is to surely and genuinely be commended for the investment. An 87x gain in a short period is extraordinary (I've never done that, nor will I). That said, a quick perusal of $TSLA twitter commentary and recommendations is terrifying.*\n\n*One can read the Journal article,* [*Investors Double Down on Stocks, Pushing Margin Debt to Record TSLA*](https://www.wsj.com/articles/investors-double-down-on-stocks-pushing-margin-debt-to-record-11609077600)*, and draw two conclusions. One, “This must be extremely dangerous,” or two, “Surely I can get rich quick too.” Human nature being what it is… For the latter, the civil engineer offers this advice on his Twitter page, “If you have no Tesla call options, you may want to do the math and consider using LEAPS as a way to accelerate your accumulation of Tesla stock. 40X in 2020. Another 50X by 2025.” Whoa.*\n\n*A series of Q&amp;A tweets ensues (thanks for the heads up* [*@RomanRubinstein*](https://twitter.com/romanrubinstein?lang=en)*) on which broker/dealers offer the most margin, the lowest interest rate on margin debt, and how to borrow the most money and obtain the maximum leverage by purchasing call options. “Maintain margin value of 50% in my portfolio and the margin borrowing rides forever,” goes the advice. Please consider the danger of heeding this advice. The engineer should risk-off and live a happy life.*\n\n*A whole bunch of people are going to lose a whole bunch of money.*\n\n*Reading through a series of tweets among the Tesla (and others) option crowd, you see little, if any, mention of maintenance margin requirements. FINRA requires investors, strike that, speculators, to maintain equity of at least 25% of the value of an account. Leverage kills. Maintenance rates can be set above the minimum threshold. The concept of posting shares in stocks like $TSLA, $TWTR, or any established company trading for 20x or 30x sales &amp; borrowing half of the value and then buying calls on the same shares posted as collateral is insanity. The only “math” a speculator should be doing is knowing at what price against the shares in the account will new equity be required. Most brokers don’t wait around for a customer to come up with new cash or securities to deposit. What do they do?*\n\n*They sell down your shares to get to equity compliance. More decline? More forced selling. Depending on maintenance margin thresholds, you can lose it all in a hurry. Red flags are abundant, beyond simply the new record high in total margin and credit market debt outstanding. You can see the bubble in the number of single-contract call options outstanding, in the number of new retail accounts being opened with margin and allowed option trading, and even in the tone of surety by speculators regarding prospects for wildly expensive shares like Tesla.*\n\n*I never thought I’d again see the kind of mania like we saw in the late 1990’s, but here we are. Memories of what can and is likely to happen are long gone. Even a number of professional investors have suspended price as a key determinant of value.  A respected and well-known retired professional investor suggested on Twitter recently that I don’t understand “$TSLA growth math or basic investment theory,” that “stocks look forward, not backward” and that “P/E’s are a function of exponential growth rates, not industry.”*\n\n*The last time an investment pro came unglued was January 2000 at a newspaper roundtable. The C.I.O/PM for one of the largest &amp; oldest growth &amp; income funds at the time took exception to the notion that $MSFT shareholders would lose money for the next 15 years, which they did. I’d written 6 pages on the prediction in my 1/1/2000 letter (on the website) and discussed it at the roundtable. My co-panelist became unhinged because he and his firm had 5% of capital in $MSFT, which was then a $620B market cap on $20B in sales, 31x sales &amp; 80x earnings.*\n\n*You can apply the same logic to $TSLA or to any number of dangerously overvalued fashionable disruptive growers today. The Tesla bull proffering margined purchase of $TSLA LEAPS expects a $1,000 share price this year, $5,000 the next and $22,000 by 2025.*\n\n*Now, a $22,000 stock price, assuming no further dilution above today’s 1.1B fully diluted shares outstanding, gets you to a $24 trillion market value, which must be reasonable given that the entire market value of the S&amp;P 500 today is only \\~$31 trillion &amp; global GDP is $88T. When your TAM (the new eyeballs) is 100% global auto market share, robotaxi, energy grid, insurance and economic population of Mars, no price is too high. No argument that Tesla has made great strides in manufacturing efficiency and are now producing a more reliable product.*\n\n*I also believe disruption of the auto industry will require an enormous amount of capital to grow and the established OEM’s won’t play dead. You can't simply separate auto margins and capital requirements from nearly infinite profitability earned by selling software upgrades. Shouldn’t the upgrades be considered part of total vehicle cost? To what extent did the Apples and Microsofts of the world thrive on a regular upgrade cycle, much of which was and is planned. How often are you compelled into a new iPhone or iPad? Prior to the subscription model, at what point did Microsoft not support an older operating system or Office suite? Will EV buyers purchase a new car every 2-3 years? How much of the world can afford a more expensive vehicle than the current global average car price?*\n\n*Regardless of one's beliefs on business quality &amp; growth prospects, paying a too-high price can destroy future investment return. #neversell? When price becomes ridiculous to the most optimistic business case you #bettersell. Price matters and the current environment is nuts. The current folly for price not mattering, or being justifiably high, reminds me of a well known sell-side report on Berkshire Hathaway in 1998 which assumed as undervalued both $BRK’s shares and its stock portfolio against an assumed “reasonable” 40x market multiple.*\n\n*Berkshire’s shares, expensive, would fall by half over the next 18 months to a February 2000 low. It’s become fashionable to explain investment process by saying price is the last consideration. Too often lately, price isn’t even a consideration, especially for holy growers. While I did not have a short position on $MSFT in 2000, I do have a very small recent short on Tesla today so take my comments w/ a grain of salt. I did buy $MSFT in '06 after it fell by \\~75% and owned it for a decade, trimming when dear and adding to the position when cheap.*\n\n*Short selling is very risky and those w/ sizable short positions on Tesla at the outset of 2020 would have suffered real damage given the 720% advance during the year. I've read that shorts lost $38B during '20 alone on their collective positions &amp; short interest is way down. I happen to think the valuation is now so large to protect against a continued runaway price, particularly now that* u/elonmusk *secured its entry in the S&amp;P 500 by engineering 4 quarters of profits by cutting R&amp;D, SG&amp;A and thanks to environmental credits courtesy $GM &amp; $FCA.*\n\n*Still, I’d never employ a large short position given unlimited downside and a max return of 100%. Margin is required against short positions. What appears to be a growing army of retail option traders, many employing sizable margin debt, is a recipe for disaster. Price and quality conscious investors get uncomfortable at times like these. I am extremely uncomfortable. I hope those that have no idea what they are doing heed growing and now very high risk and fully understand downside and what margin calls and maintenance margin mean.*\n\n*Many, many speculators will lose much and even all of their money at some point as this bubble breaks. Now is the time to reduce risk. You could feel badly for employees that were paid in non-qualified stock options and kept their shares upon exercise in the late 1990’s. When shares plummeted in the wake of the tech bubble the tax liability due on gain realized as income upon exercise was still due and payable, despite shares that were way below the exercise price. It was bad. Many lost everything but weren’t in a position to understand risk.*\n\n*Borrowing against Tesla (or any) shares and buying call options presents serious deliberately assumed risk. For perspective, a 92% decline takes the shares back to where they started 2020! With margin, it will take way less than a 92% decline to introduce wipeout.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Responding to a PM who claims that the $TSLA price target of $1,200, total EV adoption of 20%, and 5% market share in global auto-manufacturing is reasonable, Bloomstran had this to say:**\n\n*You have EV adoption rising from 3% to 20% in five years, a 6x increase (46% CAGR) and Tesla market share at 25%. 2019 global new vehicle sales totaled \\~95m units and will be way lower this year. Let's call 2020 a throwaway for the industry, and hats off to* [*$TSLA*](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click) *for growing. From the 2019 base, if we assume 4% market growth then new global units in 2025 would be 115m and at your expected 20% share Tesla would sell 29 million vehicles. Is this your assumption? Sounds aggressive given Tesla’s 500k unit run rate for 2020 and 1/2% market share.*\n\n*Now, US new vehicle prices are $38k but significantly lower worldwide, let’s say $30k per vehicle sold globally. The average Tesla looks to range from high $30k’s for the Model 3 to $55k for the Model 3 Performance to $125k for the Model X Performance fully loaded.  What do you expect for an average selling price for Tesla in 2025? I’d presume that as market share expands ASP’s will have to fall to affordable. I’m trying to get to a revenue number.*\n\n*Perhaps the governments of the world will be giving $2k per person, $8k per family of 4 in annual perpetuity, surely making new cars more affordable! If Tesla sells 29m units in 2025 @ $34.5k per unit, that gets sales to $1 trillion, a CAGR of \\~102% for five years. Reasonable?*\n\n*Moving on, you have a 2025 EPS target of $24/share. On how many shares shall we apply your expected per-share figure? Shares outstanding at 9/30 totaled 948m, up from 905m at yearend 2019. An additional $5B in shares were sold recently to the public in “at-the-market” sales.  The sales were done with no roadshow, risk disclosure or prospectus, unless Goldman’s report upgrading the shares from neutral to buy &amp; a new price target of $780, up from $455, issued days before the announced sale and Goldman’s retention as selling agent, as a “prospectus.\"*\n\n*If the shares were sold at an average of \\~$600/share, the share count would now be 8.3m shares higher, so call the total 956m. You have a price target of $1,200 for the shares, so let’s not forget to include in the count any option and RSU shares issued but not yet exercised.  Recall,* [*@elonmusk*](https://twitter.com/elonmusk) *was granted 20m option shares (now 100m thanks to the split) in 2018 by* [*@larryellison*](https://twitter.com/larryellison) *and Elon’s associates on the board. Fully diluted shares total 1.113B right now, and if the stock keeps rising we can assume all options will be exercised and outstanding.*\n\n*So, how many shares should we apply to your $24 EPS target? If we assume zero further dilution (realistic?), then using the 1.113B fully diluted shares including the recent $5b sale, we get to $26.7B in net income. On an even $1 trillion in revenues, that’s a 2.67% profit margin, just a bit higher than the auto industry average of 3% and approaching $MSFT’s 30%.*\n\n*One last missing piece of information, which I haven’t seen mentioned by the Tesla bulls or in your message to me is how much capital will be required to grow sales from 500k units to 29m over the next 5 years?  It looks like over the history of* [*$TSLA*](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click) *the company has raised $26.5B in equity capital (including the recent $5B) and $16.5B in debt and preferred equity, so a total of $43B. Tesla has a cumulative loss of $5.7B, so it hasn’t produced a positive return on capital.*\n\n*For its last 4 quarters GAAP profits totaled $5.56B, which yields a 2.5% return on capital (equity net of retained losses plus debt minus cash, all adjusted for the recent $5B sale). I fully understand companies can surely lose money or earn little profit as they scale.  With the recent sale of $5B Tesla now has \\~$20B in cash. Is this sufficient to finance its growth over the next 5 years as the company grows units by 102% per year?*\n\n*Since I don’t lean on brevity and given my lack of understanding of basic investment theory, let’s summarize the missing data points necessary to get the stock to your target of $1,200 per share, 50 times your 2025 EPS target of $24 per share. Needed: 1) Tesla unit sales in 2025? 2) Average selling price per unit? 3) Any non-auto related sales – insurance, robotaxi, insurance, energy sales? 4) Shares outstanding? 5) Total capital: Additional paid in capital, debt, preferred equity, cash?*\n\n*At your 50x $24 EPS $1,200  price target,* [*$TSLA*](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click) *returns 11.2% pa from Thursday’s $705.67 close. I happen to think shares in* [*$BRK*](https://twitter.com/search?q=%24BRK&amp;src=cashtag_click)*, my largest holding, are likely to compound at roughly that rate, assuming a 10% ROE and a terminal price at 1.3x book value, up from \\~1.2x today.*"
  },
  {
   "Title": "$TPII will explode in 2021",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$TPII"
   ],
   "Selftext": "Triad Pro Innovators ($TPII) has developed proprietary battery technology for use in multiple industries. Their battery is green, eco, and can pair with solar and never need to be plugged in. It has the potential to replace lithium batteries. They have proved their concept within the EV industry with golf carts and are set to announce further applications within the EV market, next with light trucks. Their potential with off-grid batteries and other energy storage is huge!\n\n$TPII has a ridiculously small $7 million market cap and is currently at $0.11 per share. I absolutely expect them to run to $1.00+ in January and $5.00+ easily in 2021. Other similar companies with lesser technologies and companies that own no patents have blown up in price recently. $TPII owns patents and has full control of their tech. They are barely known and once word fully gets out and people see the potential, their price will explode.\n\nI have spoken with Murray Goldenberg, President of Triad Pro Innovators. His number is available if you look for it but I can't post it here. He is aware of the recent uptick in investor interest in his company. Here is his update:\n\n • They currently have three EV products developed that use their prorpietary e-cell technology. The SPREE golf cart is just one of them and he wouldn't share what the other two are because it hasn't been made public. It is safe to assume one of them is small trucks. They have other applications for their technology developed and in development also. Updates are pending.\n\n • They are currently selling the golf cart and sales have increased recently. However they have their sights on bigger markets. The golf cart proved their concept and validated their technology. \n\n • They are in contact with several different firms to help with the funding. COVID has caused some delays but something should be sorted out very soon. They have no toxic funding currently and will not take any on.\n\n • They do plan on addressing the public soon, likely early in 2021. They started their Twitter account in December and have hinted a bit at things to come. Expect press releases in January.\n\n • He believes the technology they have created is so great that they intend to take their time and do everything correctly.\n\n • He invited me to their Arizona facility for a tour and demonstration of their technology, but I declined as that is nowhere near where I live\n\nIn short, $TPII absolutely has something. They need to finish the coordination of funding and develop a sound go-to-market strategy. This will happen and is already in the works. $TPII will soar when they make an announcement. He has spoken with counsel about doing that right. Murray came off as a genuine guy who knows they have something special. This is a real company with real, revolutionary technology. Their $7 million market cap is a function of them keeping silent while they perfect their tech. They're ready to start moving now."
  },
  {
   "Title": "To the retard who got the WSB logo tattooed on his back!",
   "#Comments": 10,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "Did you ever wonder that the $150 you just blew on a stupid fucking back tattoo could have been YOLOed on OTM $GME weeklies? No you didn’t because you are retarded and it’s people like you that make me pissed that those dollars didn’t go to loss porn that I would have much rather enjoyed looking at than that stupid fucking tattoo! \n\nPos: 01/08/21 GME $21c"
  }
 ]
}{
 "$RKT": 92,
 "$TSLA": 221,
 "$PLTR": 146,
 "$PTON": 92,
 "$SPY": 28,
 "$PCG": 48,
 "$GME": 62,
 "$PETS": 10,
 "$BBBY": 52,
 "$MT": 158,
 "$FB": 10,
 "$WISH": 31,
 "$ICLN": 4,
 "$TAN": 4,
 "$MSFT": 129,
 "$GM": 129,
 "$TPII": 6
}