{
 "Data": [
  {
   "Title": "Case for TWTR Puts",
   "#Comments": 104,
   "Score": 3,
   "Symbols": [
    "$FB"
   ],
   "Selftext": "# Twitter Puts are the logical hedge at the moment\n\n# \n\nLet me explain why:  \n\n\n**1. Twitter has just provoked the eyes of Congress in an unspeakably stupid way**  \nTwitter has for years attempted to fend off Congress by claiming that they're fundamentally neutral, and their Terms of Service don't have real ramifications to speech. By suspending hundreds of prominent conservatives, including POTUS, they've now declared a partisan war which, I can guarantee you, House Democrats are going to be asking \"why didn't you do this before?\". I think the Republican talking points are going to be obvious, but if there was ever a reason to repeal Section 230, this is it.  \n\n\n**2. Twitter's fundamentals suck, and everyone knows it**  \nThe straight fundamentals of Twitter are terrible. They've got a stagnated user base, and by kicking off Trump, they've provoked an exodus which will almost definitely show up in their Feb 9th earnings. At the moment, puts are cheap, as they've been on a bit of a tear upwards. . . but I don't see this continuing. They could lose a lot of revenue from their recent actions, but I don't see anyone hopping ***onto Twitter because they did what they did. This is a net-loss action.***   \n\n\n**3. Puts are cheap**   \n\n\nIf there was ever a good reason to go against Twitter, it's that puts are super cheap at the moment. No one could have foreseen that the Trump rally would go this way. I work at one of the social media companies (not Twitter), and trust me, it caught everyone off-guard. This decision has fundamentally reshaped the investment thesis around social media; non-US dominated versus US dominated / regulatory and anti-trust risk, etc etc etc. Puts are cheap as fuck. I recently paid for some puts (5 contracts of TWTR $48.50 Put 1/15 +  10 contracts of TWTR $40.00 Put 2/26), and it's discounted for sure.  \n\n\n**4. In summary:**  \nYa'll are smart enough to see that this recent action is bullshit. I'm willing to say that this is actually the beginning of the end for Twitter. $FB will last longer because of Instagram, WhatsApp and Oculus. Reddit has a decent trajectory, but monetization is a bit of an issue. Pinterest is actually the biggest dark-horse of the bunch, though I'm personally bullish on Indian stocks atm.   \n\n\nGood luck autists!"
  },
  {
   "Title": "Gamestop, I still can't stop. 25x (OG $GME 60x guy checking in)",
   "#Comments": 68,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "OG 60x [gain post](https://www.reddit.com/r/wallstreetbets/comments/j84154/gamestop_cant_stop_wont_stop/)  \n\nAnd here is the last of my long calls. (sold a while back)\n\nhttps://preview.redd.it/eesh3r5dcda61.png?width=640&amp;format=png&amp;auto=webp&amp;s=8a0fbbea1883be0b1345bfe34fc938baaa233531\n\n&amp;#x200B;\n\nNow long 14k shares. been writing covered calls *AFTER* the stock moons and everyone FOMOs into it at the top. \n\neasy money has been made in calls imo. I don't see \"infinity squeeze\" happening. good luck\n\n&amp;#x200B;\n\n[jan CCs](https://preview.redd.it/vav6tlancda61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=75ab0ca155ae7579635c3c004e1188acf8207da6)\n\n&amp;#x200B;\n\n*Processing img ul4j4getcda61...*"
  },
  {
   "Title": "What’s the point of investing?",
   "#Comments": 10,
   "Score": 6,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "Fellow smooth brains. Riddle me this. Why would I put my money in any of these classic $KO, $SBUX, JWN, WSM etc.? Cool yeah bro boomer gains 10% per years! But when ish crashes they crash too. These yolo plays may crash but at least I got +50% first. It’s like when playing madden always having button on turbo, switching lanes flying through this world in my $TSLA instead of chugging along on a goddamn $BUS. \nTHe bubble would t over boomer gains just as hard right? Unless boomers are putting money on puts like gay bears I don’t get it"
  },
  {
   "Title": "Xiaomi $XIACF the next stock to blow up",
   "#Comments": 47,
   "Score": 1,
   "Symbols": [
    "$XIACF"
   ],
   "Selftext": "Here me out. \n\nXiaomi Ticker $XIACF is probably one of the most undervalued companies at the moment and here is why:\n\nDespite its weak branding in the Western hemisphere, Xiaomi is one of the largest tech companies in the world. Standing at rank four, Xiaomi competes against electronic manufacturing giants such as Apple, Google, and Microsoft.\n\nAffordable pricing\n\nXiaomi offers smartphones and other electronic devices at extremely competitive prices. This is extremely important for two reasons. First off, Xiaomi’s budget-friendly pricing allows them to compete for the more budget-friendly consumers in developed regions. Secondly, it allows them to enter new, previously-untapped markets in which smartphones were previously too expensive. For example, Xiaomi is able to sell millions of devices in the Asian market, especially in China and India, which would be impossible as a luxury brand such as Apple or Samsung.\n\nSubstantial profit margins\n\nMost amazing of all, Xiaomi is able to offer quality products at affordable prices, and still make plenty of profit for themselves. Quite consistently, Xiaomi has posted profits amounting to hundreds of millions of dollars. Xiaomi can thank low manufacturing costs for their high-profit margins. These low manufacturing costs are likely due to the low cost of labor in China, as well as the significant economy of scale which arises when manufacturing so many devices.\n\nTLDR; undervalued stock with high potential waiting to blow up.\n\nLet's take this fucker to the moon: 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀"
  },
  {
   "Title": "Talk before acting...",
   "#Comments": 18,
   "Score": 1,
   "Symbols": [
    "$TSLA"
   ],
   "Selftext": "In recently if been reading more often on this subreddit. There are obvious smiliarities between some Ppls sentiment concerning $TSLA and religious adherents.  I dont want to hate on Tesla, but nothing is more important than your mental and physical health. Life is not a fucking game...\n\nBefore you commit to life changing decisions after the inevitable downfall of $TSLA, call this number:\n\n1-800-273-8255\n\nRemember its only money.\n\nStay Healthy. \n\nAktshually your penis or respectively your vagina is capable of producing future Elons, for free plus you have fun. Extreme good cost to return ratio. Plus you guys might learn something called empathy. But who am i talking to, a bunch of fucking autists will still try call reptile overlord papa elon to the moon or mars or whatever, LIFE IS ON EARTH and its NOW..."
  },
  {
   "Title": "Even a retard like me can make money. You should be ashamed of yourself.",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$SUNE"
   ],
   "Selftext": "There I said it, I'm poppin some of these $SUNE certificates and riding off into the suneset with my psychobitch to Cinderella Castle. \n\nOnce again. Fuck you."
  },
  {
   "Title": "$51000 in a weekly Lithium mining play $LAC",
   "#Comments": 131,
   "Score": 1,
   "Symbols": [
    "$LAC"
   ],
   "Selftext": "What a week **$LAC** had this week. I rode my $12.5 calls expiring in February until the market open this morning and immediately transferred them into $20 calls expiring the 15th, next Friday.\n\n**News:**\n\n[https://www.reuters.com/article/us-usa-mining-resolution-trump/trump-moves-to-loosen-mining-regulations-approve-projects-as-he-exits-idUSKBN29D1AD](https://www.reuters.com/article/us-usa-mining-resolution-trump/trump-moves-to-loosen-mining-regulations-approve-projects-as-he-exits-idUSKBN29D1AD)\n\n* ^(One of those, the Lithium Americas Thacker Pass project in Nevada,) **is expected to be approved on Jan. 15, according to an official at the Bureau of Land Management.**\n* “**It’s been a good, collaborative process with state and federal authorities. We look forward to the decision**,” ^(said Jon Evans, chief executive of Lithium Americas, which has been developing the project for more than a decade. Lithium is a key component of electric vehicle batteries.)\n* **Administration officials tell Reuters** ^(they plan to publish a raft of decisions on Jan. 15 that will expand miners’ access to federal lands), **give final approval to Lithium Americas Corp’s Nevada lithium mine** ^(and approve a land swap for a Rio Tinto Ltd Arizona copper mining project, among other steps.)\n\n**Notes about the Thacker Pass Project:**\n\n* Located in Nevada\n* Nevada has recently run out of unemployment funding due to COVID and has asked for federal loans. Nevada WILL NOT deny lithium-based revenue from companies like $LAC and have already approved tax incentives for them.\n* Training of local workers for land development has already begun. Jobs are already created and filled. \n* The Thacker Pass is the largest known Lithium deposit in the US and 2nd largest globally \n\nThis is truly revolutionary in the EV and lithium-based mining. As we all know EV companies have been on an absolute run lately as well as all lithium companies.\n\n**Chart:**\n\nhttps://preview.redd.it/kvbuu5y0k8a61.png?width=1668&amp;format=png&amp;auto=webp&amp;s=7a0a0f3a5f9df9541aea219e2eb77819e5d8761d\n\nIt had a nice pullback today and consolidated at $18.50 before closing at $19.33. Expect this to absolutely run next week to $25-30.\n\n**Price Targets for next Friday:**\n\n* $25-30\n* This would put the $20 calls at $5-10 from a 1.25 entry\n\n**Final note:** \n\n* Stocks only go up\n* It's an EV play\n\n**Positions:** \n\n400 contracts of $LAC $20C Jan 15th\n\nhttps://preview.redd.it/r6xqdcj8k8a61.png?width=478&amp;format=png&amp;auto=webp&amp;s=1a8dde9141c2573a646bb28380fa822a9bff090b"
  },
  {
   "Title": "Wife’s boyfriend buys ETFs, I’m in!",
   "#Comments": 5,
   "Score": 1,
   "Symbols": [
    "$XLF"
   ],
   "Selftext": "JP, Wells, and Citi report earnings Friday and they are all part of $XLF. People have been spending money like it grows out of their home office printer so earnings should be hot! Plus ETFs are sexy right now, no way this stock is going south. \n\neaSy mONeY - $XLF 1/22 31c holding till expiry. its the way."
  },
  {
   "Title": "This week in steel, the BIG finish today and the week to come! $MT $CMC $VALE $CLF $X $STLD $NUE",
   "#Comments": 347,
   "Score": 21,
   "Symbols": [
    "$X",
    "$MT",
    "$VALE",
    "$CMC",
    "$CLF",
    "$NUE",
    "$STLD"
   ],
   "Selftext": "What a week in steel with some **BIG MOVES.**\n\nThen came this morning. . .people panicked and paper hands sold.\n\nAs I said this morning, be patient and hold - it had gotten too hot too fast and we were due for a cool off, however I said - **THIS IS YOUR BUYING OPPORTUNITY!**\n\n**BUY THE DIP!**\n\n**THE TREND IS YOUR FRIEND!**\n\n$CMC was downgraded today to HOLD by Deutsche and then it dumped.\n\nI disagree with their opinion - HIGHLY DISAGREE.\n\nThey then upgrade $X and it moons.\n\nUpgrades are great, but you have to take downgrades with a grain of salt, especially by a bank that is upgrading a competing US steel stock on the same day. . .what are they holding?  What do they want to buy?\n\nIt smells a little suspect, but that's why you do your own research.\n\nAnyhow, on to the real news of the day that reversed the market and that was Biden's press conference and he laid out that he would be announcing his economic package next week.\n\n \"Biden is also likely to push for a larger legislative effort later in 2021 after the initial stimulus package. **That effort is expected to focus on spending trillions of dollars on infrastructure** and clean-energy jobs.\"\n\n[https://www.washingtonpost.com/us-policy/2021/01/08/biden-stimulus-plan/](https://www.washingtonpost.com/us-policy/2021/01/08/biden-stimulus-plan/)\n\nThe market instantly reversed and steel started recovering, quickly and by the AH action, I believe we are **PRIMED FOR A BIG WEEK COME MONDAY.**\n\nWhat really stood out to me today was this as well:\n\n[https://www.argusmedia.com/en/news/2175282-arcelormittal-hikes-eu-steel-coil-prices-again](https://www.argusmedia.com/en/news/2175282-arcelormittal-hikes-eu-steel-coil-prices-again)\n\nEveryone that has read my posts know **$MT is my favorite play.**\n\nThe doubters in the beginning (and still - I do get your DM's - lots of angry people out there!) said this was a pump and dump.\n\n$MT popped and then went sideways for a week or so - I said to wait and be patient.\n\nThat patience has started to come to fruition.\n\nThese increases are immediate and will be taken and like Oliver Twist - customers will say, \"please sir, I want some more\"\n\n$MT: \"More?!?!?\"\n\n$MT: No problem, it's another $50/ton\"\n\nCustomer: \"Please sir, I want some more\"\n\n$MT: \"More?!?!\"\n\n$MT: Sure another $100/ton and it will ship in June, oh and by the way, you'll have to pay extra by then because your price is now the price we agreed upon and adders, so PRICE TIME OF SHIPMENT.\n\nBy the way, that is becoming common-place in the steel industry today.\n\nAs promised earlier today, here is a Force Majure letter from Deacero, one of the largest steel makers in Mexico:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pqif3v8087a61.jpg?width=2576&amp;format=pjpg&amp;auto=webp&amp;s=76d8253289fa3720ef3522996dadfbe0511a0484\n\nNOTICE HOW THE PRICE INCREASES ARE **RETROACTIVE??!!**\n\nThis is becoming common-place and this is how steelmakers ENSURE their margins in markets where raw materials are running faster than they can buy them.\n\nThis is part of my thesis as to why these companies are going to show INCREASED REVENUE and most importantly - **INCREASED PROFITS.**\n\nAlso, those that believe in what's coming and understand the value and dynamics in the market made some shrewd moves and **BOUGHT THE DIP!**\n\nAs of 5:19 CST here is some After Hours steel porn for you:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/t4ncr8k797a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=7f68e3e00886f456eae8567519dcfeb4d3fa901a\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zzxi9j2e97a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=fa4a087ef3673c4d79743863920e0f9302ba6cbc\n\nhttps://preview.redd.it/vnqrbh2e97a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=e08889812e2be64972349ca048820bb8d6a4f061\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tqx12nah97a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=c94cbef3be93f104b306b500606fe9a14c283844\n\nhttps://preview.redd.it/4t6cpzah97a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=8d5bf91847d16cda770ea90b46f5bee204056bcd\n\nhttps://preview.redd.it/21pxkxah97a61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=7a2465940199ca4414afcdd4d1f23ce67329be57\n\n&amp;#x200B;\n\n**BALLS OF STEEL!**\n\nSee you in the trenches on Monday, but who knows what the weekend may bring and a Sunday night DD may be in making. . . .\n\n\\-Vito"
  }
 ]
}