{
 "Data": [
  {
   "Title": "$BNGO",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$BNGO"
   ],
   "Selftext": "BNGO TO THE MOON 🚀🚀🚀🚀🚀🚀\n\nPosition : 190 at $2.85"
  },
  {
   "Title": "Weedmaps SSPK",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$SSPK",
    "$TLRY",
    "$ACB"
   ],
   "Selftext": "Listen here you retards. This is not a political post.   This is a $$$ post. If Georgia Senate turns Dem the weed basket gonna squeeze so crazy. Trade your plan, but cool opportunity presenting itself here imo. Especially since it didn't run as much as $ACB or $TLRY today. \n\n🚀🚀🚀 I like Weedmaps ($SSPK) 🚀🚀🚀 - all my friends in California use it. Super convenient and tracks the delivery. Apparently 50% of all dispensaries in the states use weedmaps, and the average order price for the platform's customers is $100 (vs. $50 in store). Can easily see why 18,000 dispensaries go with weedmaps paying them $500+ a month for their Business in a Box product.\n\n Weedmaps parent WM Holding Co. going public via merger with Silver Spike Acquisition Corp $SSPK\n\n* Weedmaps is dominant cannabis SaaS player and consumer marketplace\n* Revenue quadrupled to $160 million in 2020 from $43 million in 2015\n* Revenue forecast to grow at annualized 40%, Ebitda at annualized 55% through 2023\n* **Weedmaps operates high-margin marketplace services and never “touches the plant”**\n* Weedmaps generates $1.5 billion in gross merchandise volume (GMV)\n* Stock trades at enterprise value of 5.6x 2022 sales, well below SaaS comps\n\ntl;dr: Buy $SSPK for the 🚀🚀🚀🚀🚀🚀🚀 \n\nPositions: 3,500 shares of SSPK at $12.50 average."
  },
  {
   "Title": "Bull Porn",
   "#Comments": 34,
   "Score": 1,
   "Symbols": [
    "$SE",
    "$NOW"
   ],
   "Selftext": "There are a few tickers no one likes to share. They are a secret money maker that funds cocaine binges and escapades in Meme Stocks.  \n\n$SE was one of those tickers, but all the Gyna shit, and Jack Ma being disappeared has made Gyna stocks lose some of their luster.  \n\nHave a look at $NOW otherwise known as ServiceNow. They manage digital workflow. Not that you care. What you do care about is a predictable stock to fund Cocaine, Hookers and Meme stocks.  \n\nAnd surprise, surprise, they just landed on their 120 Day Support Level. Here: https://imgur.com/gallery/dtC1Ymh  \n\nAnd here is where the next resistance is: https://imgur.com/a/AJxXHHZ  \n\nThis is a set it and forget it play if you buy 1-3 month Calls on a buy signal. Due to market conditions the next day or so there may be slightly more of a dip. But with a long enough strike. It will not matter.  \n\nHella Risky Play: $NOW 570c @ .45 cents  / Add more time if you are not as retarded as me.  \n\nHere is the Option Chains History: https://www.tendiechart.com/pricehistory.cfm?symbol=NOW&amp;date=1610064000&amp;s=570.00&amp;t=C  \n\nThis has worked for me the last 6 months. Even through the fall purges, as long as I bought the support line.  \n\nOne last thing. Most of the winners here understand timing is the key. The plays are easy. So focus on timing when you buy. Watch the options chain flow, and add more time for forgiveness if needed."
  },
  {
   "Title": "RH free loan DD",
   "#Comments": 7,
   "Score": 1,
   "Symbols": [
    "$RH"
   ],
   "Selftext": "Okay guys , the f is going on ? I guess they disabled the trick with free loan ? I don’t owe them any money the fact that they let the 5 dollar go instant but not the other 4995 ... the funny part is they took that 5 bucks instant buying back also . \n\nTLDR $RH Poots on me strike - on insta buying power"
  },
  {
   "Title": "With A-List roster, $AJAX will be the top SPAC of 2021 🚀 (Founders/CEO’s of Instagram, Square, 23andMe &amp; Chipotle)",
   "#Comments": 4,
   "Score": 1,
   "Symbols": [
    "$AJAX"
   ],
   "Selftext": "How is nobody talking about this yet? The management team is stacked.\n\n“Ajax I (NYSE: AJAX) has an all-star management team led by former CEOs and founders of well-known companies. The team includes **23andMe founder Anne Wojcicki, Instagram founder Kevin Systrom, Square Inc (NYSE: SQ) founder Jim McKelvey and Chipotle Mexican Grill Inc (NYSE: CMG) founder Steve Ellis.** \n\nThe SPAC is also led by Daniel Och and Glenn Fuhrman, who both worked at Goldman Sachs (NYSE: GS) and have experience with private investments in Coinbase, Github, Instacart, Robinhood, Stripe and Wish.\n\nThe SPAC is targeting sectors that include internet, software, fintech and consumer.”"
  },
  {
   "Title": "Some DD that will actually make you people money. $BPY merger arbitrage",
   "#Comments": 45,
   "Score": 1,
   "Symbols": [
    "$BAM",
    "$BPY"
   ],
   "Selftext": " $BAM made a bid to buy $BPY for 16.50 per share today.\n\n&amp;#x200B;\n\nBAM is the parent company to BPY/ they own 60% of outstanding shares.\n\nBAM is also managing BPY, therefore, they had to put an \"independent board\" in place to evaluate the deal.\n\nShares are trading hands at 17$ a pop right now, people are betting that they'll have to increase their bid above 16.50.\n\nThe June calls have juicy premiums and minimal downside risk as they're striking lower than the bid price. \n\nThe June 2020 16$ puts have been trading hands for 1.15-25$ all day.\n\nBasically, you can sell 16$ puts, locking in the premium and simply wait for the deal vote to go through. With maximum margin, this is a 40% annual return with fairly low risk.\n\n&amp;#x200B;\n\nMy position: Sold 200x june 18/2021 puts at an average of 1.20$\n\n&amp;#x200B;\n\n*Processing img 8290waj0yd961...*"
  },
  {
   "Title": "A Warning to $PSTH holders on Robinhood",
   "#Comments": 72,
   "Score": 1,
   "Symbols": [
    "$PSTH"
   ],
   "Selftext": "About 2 months ago I asked Robinhood support if I would receive  warrants or not when the merger happens. Robinhood support told me that YES I would be able to receive them and they will be tradable on the platform. I shared this information and copy/pasted my email from support in a large PSTH thread on WSB a few weeks ago and many people took that as confirmation. \n\nToday, there are people telling me on Twitter that Robinhood Support is now saying the opposite in email. For my own peace of mind, I will be looking to reallocate my ownership of $PSTH to Schwab tomorrow since I don't trust Robinhood to handle this or communicate properly with us in time."
  },
  {
   "Title": "YOLOing with my Mom $LOOP to the moon $15 6/11",
   "#Comments": 2,
   "Score": 1,
   "Symbols": [
    "$LOOP"
   ],
   "Selftext": "Whatsup fellas, took half an edible and convinced my mom to get robinhood bc I want free TENDIES. Anyway I get $10 from that (Fuck you Wendys). She goes searing for stonk and finds $Loop. They turn PET plastics, which is water bottles and stuff into recyclables. She goes I’ll buy it (20% of her portfolio to begin). Fuck legendary. So I go ok mom I like your DD. Bought $200 of it cause fuck it. I got moms back. \n\n*NOT like Nikola"
  },
  {
   "Title": "$BBBY - Omni Channel - Short Squeeze Against Melvin Capital 🚀🚀🚀🚀🚀🚀",
   "#Comments": 48,
   "Score": 1,
   "Symbols": [
    "$BBBY"
   ],
   "Selftext": "Bed Bath and Beyond is a strong play and long term play for the year 2021.   This stock is currently shorted at around 70 percent and with earnings coming up on Jan 7 pre market the stock can easily move up quickly.  \n\nThis stock is shorted by none other than Melvin capital and they are balls deep in it. \n\nOn 11/9/2019 BBBY got there new lord and savior  Mark Tritton . Mark Tritton was the  chief merchandising officer  at target that created strong private labels and helped in the turnaround of target. BBBY has a poor private label collection prior to him joining. Tritton then cleaned house and fired 7 executives and replaced them with people with strong expertise over the course of 2020.  The boomer board was also changed.  \n\nMark did a lot of positive changes he sold  PersonalizationMall.com  for 252 million then went on and sold all the non core assests of BBBY like  one kings lane, christmas tree shops and distribution center for 250 million.   These non core assests were a big drag on operating expense and generating loss so this is a huge positive. \n\nBBBY plans to close around 250 stores over the next two years. The retailer expects to generate up to $350 million in annualized savings from the store closures; lower supply chain costs; selling, general and administrative cost optimization; and more efficient pricing and promotions \n\nBBBY also laid off 5 percent of it workforce on August 2020 to save another $100 million dollar in costs. \n\n The retailer posts a 6% year-over-year comps increase — the first sales growth in that measure since 2016. \n\n&amp;#x200B;\n\n*Processing img txxha5ihhd961...*\n\n&amp;#x200B;\n\nAs u/Daurs points out in his dd there omni channel is already in full swing. They have reported 89% increase in digital sales and they also signed instant delivery and two day delivery with  Shipt and Instacart, for its Bed Bath &amp; Beyond and BuyBuy Baby stores. ([Link to His Original DD](https://www.reddit.com/r/wallstreetbets/comments/km048x/very_bullish_on_bbby_dd_included/)) \n\nThey have an 825 million share buy back out of which 300 million will be spend before March of this year.  \n\nWith positive earnings, high short interest and share buy back this will moon soon.   \n\nLink to the investor day presentation which is awesome. [Investor Deck](http://bedbathandbeyond.gcs-web.com/static-files/2730f3a3-1969-414e-bd30-3fcf49e321d4)  \n\n&amp;#x200B;\n\nTLDR : Buy Shares or Leaps (Dec earning's won't be reported on Jan 7)  🚀🚀🚀🚀🚀🚀\n\nPositions : 2000 shares at 19.XX looking to buy more before earnings.  \n\n&amp;#x200B;\n\n*Processing img bzdlfcg2jd961...*"
  },
  {
   "Title": "$MJ 2023 LEAPS",
   "#Comments": 22,
   "Score": 1,
   "Symbols": [
    "$MJ"
   ],
   "Selftext": "$MJ is trading right now @ just under $15. The Jan 2023 $10 Call is $6. That means the break even point is an increase of under 9% over the next 2 years in an industry widely expected to explode.\n\nPossible catalysts:\n\n1. Dems win both GA seats and the MORE act which already passed the house passes the senate and decriminalizes cannabis in the next few months.\n2. Biden deschedules cannabis by executive order like Kamala Harris said he would in the VP debate.\n3. Dems take the senate in 2022 paving the way to decriminalize.\n4. Republicans listen to the 70% of Americans who want to decriminalize and vote for it.\n\nI know $MJ is only Canadian companies but if the US decriminalizes there will be some partnerships/mergers with MSOs and I'd expect $MJ to add some American companies to their holdings once they're allowed to list on the NYSE/NASDAQ. I also believe this is a winning play even if the US doesn't decriminalize.  \n\n\nWhat am I missing, why is this so cheap? We miss on what has been a fairly large dividend in the past but this is an industry that is poised for HUGE growth. This is essentially giving 2.5x leverage with very minimal downside risk IMHO."
  },
  {
   "Title": "$GRLF about to moon 🚀",
   "#Comments": 4,
   "Score": 1,
   "Symbols": [
    "$GRLF"
   ],
   "Selftext": "Gotta play the pennies 🤟"
  },
  {
   "Title": "$TLRY Will Be The First Moon Trip of 2021 🚀🚀🚀🚀🚀",
   "#Comments": 477,
   "Score": 1,
   "Symbols": [
    "$TLRY"
   ],
   "Selftext": "&amp;#x200B;\n\n**Good Afternoon Retards.** Tilray (TLRY) has been having a nice start to 2021. This is only the beginning and there's still time for you to secure your first 10 bagger of 2021. 🚀\n\n**Why TLRY?**\n\nIt's all in the fundamentals. TLRY got the better end, at least in the short term, of the merger deal with APHA. The premium APHA will pay per share in this reverse acquisition will be of great benefit to TLRY's balance sheet. Tilray's massive potential has now been coupled with strong fundamentals. When (Yes, WHEN not if) weed is legalized in the US, Tilray, a company registered in the US, has the foothold in the US that, when combined with APHA's resources and distribution, will be a DOMINANT force in the market. 🚀🚀🚀\n\nNot only is Tilray in a good position to take over the US Cannabis market, but it also has a strong presence in Canada, where it is headquartered. The merger with APHA means TLRY will own 17.3% of the Canadian Cannabis market, **by far the largest** market share of any other Canadian Cannabis companies. \n\n**The US is a HUGE market to be tapped into🚀🚀🚀🚀🚀**\n\nGeorgia Senate elections are **TOMORROW,** as of the writing of this post **BOTH** Democratic candidates are the betting favorites to win. **When this happens, the blue wave is complete and weed is all but legalized in the US.** A Democrat-controlled Senate was the last domino needed to fall. It is reasonable to believe that weed can and will be legalized in the US before the end of Q1 2021. \n\nOnce weed is federally legalized, the market expands **EXPONETIALLY** in the US. Weed will become legal in large states such as New York. **Billions of dollars are just sitting that TLRY is in the best position to take** \n\n**TLRY is MASSIVELY undervalued🚀🚀🚀🚀🚀**\n\nAs of 12/31, TLRY is trading at a very attractive 4.23 \\* book value. MorningStar gives TLRY a fair value of 14$ (As of 1/1/21). Only 1 of 18 analysts have given TLRY a sell rating.\n\n**Wall Street is bullish on TLRY🚀🚀🚀🚀🚀**\n\nSince it has cooled down since the Biden rally, Tilray has consistently been reaching higher highs and higher lows. It is up around 6% at the time I'm writing this post. Put/Call Ratio is .1! Safe to say Wall Street is preparing for the Blue Wave and the legalization of weed, of which TLRY is in the best position to take advantage of the untapped US market. \n\nSources:\n\n[https://www.livemint.com/news/world/tilray-and-aphria-announce-merger-to-create-the-largest-global-cannabis-company-11608361067376.html](https://www.livemint.com/news/world/tilray-and-aphria-announce-merger-to-create-the-largest-global-cannabis-company-11608361067376.html)\n\n[https://www.fool.com/investing/2020/12/22/the-2-best-cannabis-stocks-to-own-in-2021/](https://www.fool.com/investing/2020/12/22/the-2-best-cannabis-stocks-to-own-in-2021/)\n\n[https://bookies.com/news/senate-races-odds-tracker](https://bookies.com/news/senate-races-odds-tracker)\n\n[https://mjbizdaily.com/which-states-are-likely-to-legalize-recreational-marijuana-in-2021/](https://mjbizdaily.com/which-states-are-likely-to-legalize-recreational-marijuana-in-2021/)\n\n[https://finance.yahoo.com/quote/TLRY/key-statistics/](https://finance.yahoo.com/quote/TLRY/key-statistics/)"
  },
  {
   "Title": "$GME HOLD THE LINE 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$GME"
   ],
   "Selftext": "&amp;#x200B;\n\n![video](dwnivm019c961)"
  },
  {
   "Title": "Jan 04, 2021 | Today's Top 25 WSB Tickers",
   "#Comments": 21,
   "Score": 1,
   "Symbols": [
    "$EV",
    "$TO",
    "$EOY",
    "$ARKG",
    "$CCP",
    "$RC",
    "$SPY",
    "$THE",
    "$AI",
    "$TSLA",
    "$FUCK",
    "$BABA",
    "$AND",
    "$TLDR",
    "$THIS",
    "$MT",
    "$NIO",
    "$PLTR",
    "$ICLN",
    "$AAPL",
    "$GME",
    "$MOON",
    "$PSTH",
    "$YOU",
    "$IN"
   ],
   "Selftext": "To help you YOLO your money away, here are all of the tickers mentioned at least 10 times in all the posts within the past 24 hours (and links to their Yahoo Finance page) along with a sentiment analysis percentage:\n\nTicker | Mentions | Bullish (%) | Neutral (%) | Bearish (%)\n:- | :- | :- | :- | :-\n$GME | [1677 mentions (16% of all mentions)](https://finance.yahoo.com/quote/GME?p=GME) | 0 | 0 | 0\n$PLTR | [1092 mentions (10% of all mentions)](https://finance.yahoo.com/quote/PLTR?p=PLTR) | 0 | 0 | 0\n$TSLA | [438 mentions (4% of all mentions)](https://finance.yahoo.com/quote/TSLA?p=TSLA) | 0 | 0 | 0\n$NIO | [235 mentions (2% of all mentions)](https://finance.yahoo.com/quote/NIO?p=NIO) | 0 | 0 | 0\n$BABA | [157 mentions (1% of all mentions)](https://finance.yahoo.com/quote/BABA?p=BABA) | 0 | 0 | 0\n$MT | [130 mentions (1% of all mentions)](https://finance.yahoo.com/quote/MT?p=MT) | 0 | 0 | 0\n$THE | [129 mentions (1% of all mentions)](https://finance.yahoo.com/quote/THE?p=THE) | 0 | 0 | 0\n$RC | [93 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/RC?p=RC) | 0 | 0 | 0\n$TO | [88 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/TO?p=TO) | 0 | 0 | 0\n$CCP | [83 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/CCP?p=CCP) | 0 | 0 | 0\n$PSTH | [83 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/PSTH?p=PSTH) | 0 | 0 | 0\n$EV | [82 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/EV?p=EV) | 0 | 0 | 0\n$AI | [68 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/AI?p=AI) | 0 | 0 | 0\n$AAPL | [66 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/AAPL?p=AAPL) | 0 | 0 | 0\n$YOU | [63 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/YOU?p=YOU) | 0 | 0 | 0\n$SPY | [61 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/SPY?p=SPY) | 0 | 0 | 0\n$THIS | [58 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/THIS?p=THIS) | 0 | 0 | 0\n$FUCK | [54 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/FUCK?p=FUCK) | 0 | 0 | 0\n$IN | [53 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/IN?p=IN) | 0 | 0 | 0\n$EOY | [51 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/EOY?p=EOY) | 0 | 0 | 0\n$AND | [50 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/AND?p=AND) | 0 | 0 | 0\n$ARKG | [50 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/ARKG?p=ARKG) | 0 | 0 | 0\n$MOON | [44 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/MOON?p=MOON) | 0 | 0 | 0\n$TLDR | [43 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/TLDR?p=TLDR) | 0 | 0 | 0\n$ICLN | [43 mentions (&lt;1% of all mentions)](https://finance.yahoo.com/quote/ICLN?p=ICLN) | 0 | 0 | 0\n\nTake a look at my [source code](https://github.com/RyanElliott10/wsbtickerbot) and make some contributions if you're interested."
  },
  {
   "Title": "India’s Booming Tech Sector",
   "#Comments": 55,
   "Score": 1,
   "Symbols": [
    "$INDA"
   ],
   "Selftext": "So, I remember reading in my college business class this semester about how India is having a booming tech sector and how they might be the next economy to really grow and this is where a lot of companies are investing in such as **AMAZON**, which just built a giant warehouse there or something. Anyway, this economy is predicted to grow a lot and (relatively) soon so I’ll give it a three rocket ships rating 🚀 🚀 🚀 to show that I really do think it has potential. I don’t know of a specific Indian tech ETF but from my research $INDA has a lot of tech in it and it seems like one of the best Indian economy ETFs. And I shit you not one of my calls is already up like 80% and I just bought it. It was over 150% earlier before this recent dip.\n\nActual positions:\nINDA 20 Jan 23 55c (+82%)\nINDA 20 Jan 23 42c (+11%)\n\nIf people care I can find the paper about India and a screenshot of my positions."
  },
  {
   "Title": "Who'd You Rather: Chamath, Cathie Wood, or Daddy Musk",
   "#Comments": 0,
   "Score": 1,
   "Symbols": [
    "$ARKQ",
    "$IPOF"
   ],
   "Selftext": "If you had to invest all your money in 1 of these indivudal's SPACs, ETFs, or companies, which one would it be?\n\nChamath: $IPOD, $IPOE, $IPOF\n\nCathie: $ARKK, $ARKG, $ARKF, $ARKW, $ARKQ\n\nElon: $TSLA, SpaceX, Boring\n\n&amp;#x200B;\n\nMore importantly, who'd you rather?\n\nJust thinking of Wood makes me tingle, but there's nothing boring about 🚀🚀🚀 especially in bed. However, we all want to know if Chamath is SPACking heat.\n\n&amp;#x200B;\n\nPost is (hardly) inspired by our under-performing friends on r/investing: [https://www.reddit.com/r/investing/comments/kpqd7s/chamath\\_vs\\_cathie\\_wood\\_who\\_do\\_you\\_trust\\_more\\_with/](https://www.reddit.com/r/investing/comments/kpqd7s/chamath_vs_cathie_wood_who_do_you_trust_more_with/)"
  }
 ]
}